openNURBS SDK Help 6.0
 Public Member Functions | List of all members
ON_3fPointArray Class Reference
#include <opennurbs_point.h>
 Inheritance diagram for ON_3fPointArray:
 Public Member Functions
ON_3fPointArray ()
see ON_SimpleArray class definition comments for constructor documentation More...
ON_3fPointArray (int)
ON_3fPointArray (const ON_3fPointArray &)
bool  | GetBBox (float boxmin[3], float boxmax[3], bool bGrowBox=false) const
ON_3fPointArray &  | operator= (const ON_3fPointArray &)
bool  | SwapCoordinates (int, int)
bool  | Transform (const ON_Xform &)
 Public Member Functions inherited from ON_SimpleArray< ON_3fPoint >
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< ON_3fPoint > &)
Copy constructor. More...
ON_SimpleArray (size_t)
virtual  | ~ON_SimpleArray ()
void  | Append (const ON_3fPoint &)
void  | Append (int, const ON_3fPoint *)
ON_3fPoint &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_3fPoint *  | Array ()
const ON_3fPoint *  | Array () const
ON_3fPoint *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
ON_3fPoint *  | At (unsigned int)
ON_3fPoint *  | At (ON__INT64)
ON_3fPoint *  | At (ON__UINT64)
const ON_3fPoint *  | At (int) const
const ON_3fPoint *  | At (unsigned int) const
const ON_3fPoint *  | At (ON__INT64) const
const ON_3fPoint *  | At (ON__UINT64) const
int  | BinarySearch (const ON_3fPoint *, int(*)(const ON_3fPoint *, const ON_3fPoint *)) const
int  | BinarySearch (const ON_3fPoint *, int(*)(const ON_3fPoint *, const ON_3fPoint *), int) const
int  | Capacity () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Empty ()
ON_3fPoint *  | First ()
const ON_3fPoint *  | First () const
bool  | HeapSort (int(*)(const ON_3fPoint *, const ON_3fPoint *))
void  | Insert (int, const ON_3fPoint &)
ON_3fPoint *  | KeepArray ()
Expert user tool to take charge of the memory used by the dyanmic array. More...
ON_3fPoint *  | Last ()
const ON_3fPoint *  | Last () const
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const ON_3fPoint * () const
operator ON_3fPoint * ()
ON_SimpleArray< ON_3fPoint > &  | operator= (const ON_SimpleArray< ON_3fPoint > &)
ON_3fPoint &  | operator[] (int)
ON_3fPoint &  | operator[] (unsigned int)
ON_3fPoint &  | operator[] (ON__INT64)
ON_3fPoint &  | operator[] (ON__UINT64)
const ON_3fPoint &  | operator[] (int) const
const ON_3fPoint &  | operator[] (unsigned int) const
const ON_3fPoint &  | operator[] (ON__INT64) const
const ON_3fPoint &  | operator[] (ON__UINT64) const
bool  | Permute (const int *)
bool  | QuickSort (int(*)(const ON_3fPoint *, const ON_3fPoint *))
virtual ON_3fPoint *  | Realloc (ON_3fPoint *, int)
low level memory managment ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
ON_3fPoint *  | Reserve (size_t)
memory managment //////////////////////////////////////////////////// More...
void  | Reverse ()
int  | Search (const ON_3fPoint &) const
int  | Search (const ON_3fPoint *, int(*)(const ON_3fPoint *, const ON_3fPoint *)) const
void  | SetArray (ON_3fPoint *)
Do not use this version of SetArray(). Use the one that takes a pointer, count and capacity. More...
void  | SetArray (ON_3fPoint *, int, int)
Expert user tool to set the memory used by the dyanmic array. More...
ON_3fPoint *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory managment ////////////////////////////////////////// More...
void  | Shrink ()
unsigned int  | SizeOfArray () const
unsigned int  | SizeOfElement () const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_3fPoint *, const ON_3fPoint *)) const
Sort() fills in the index[] array so that array[index[i]] <= array[index[i+1]]. The array is not modified. More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_3fPoint *, const ON_3fPoint *, void *), void *) const
Sort() fills in the index[] array so that array[index[i]] <= array[index[i+1]]. The array is not modified. More...
void  | Swap (int, int)
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_SimpleArray< ON_3fPoint >
void  | Move (int, int, int)
implimentation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< ON_3fPoint >
ON_3fPoint *  | m_a
int  | m_capacity
int  | m_count
Constructor & Destructor Documentation
◆ ON_3fPointArray() [1/3]
 ON_3fPointArray::ON_3fPointArray  |  ( |   | )
see ON_SimpleArray class definition comments for constructor documentation
◆ ON_3fPointArray() [2/3]
 ON_3fPointArray::ON_3fPointArray  |  ( |  int  |   | )
◆ ON_3fPointArray() [3/3]
 ON_3fPointArray::ON_3fPointArray  |  ( |  const ON_3fPointArray &  |   | )
Member Function Documentation
◆ GetBBox()
 bool ON_3fPointArray::GetBBox  |  ( |  float  |  boxmin[3],
|  float  |  boxmax[3],
|  bool  |  bGrowBox = false
) |   |  const
◆ operator=()
 ON_3fPointArray& ON_3fPointArray::operator=  |  ( |  const ON_3fPointArray &  |   | )
◆ SwapCoordinates()
 bool ON_3fPointArray::SwapCoordinates  |  ( |  int  |  ,
|  int
)
◆ Transform()
 bool ON_3fPointArray::Transform  |  ( |  const ON_Xform &  |   | )