Public Member Functions | List of all members
ON_PolyCurve Class Reference
#include <opennurbs_polycurve.h>
 Inheritance diagram for ON_PolyCurve:
 Public Member Functions
ON_PolyCurve () ON_NOEXCEPT
ON_PolyCurve (const ON_PolyCurve &)
ON_PolyCurve (int)
virtual  | ~ON_PolyCurve ()
bool  | Append (ON_Curve *)
Append curve. More...
bool  | AppendAndMatch (ON_Curve *)
Append and match start of curve to end of polycurve. More...
bool  | ChangeClosedCurveSeam (double t) override
bool  | ChangeDimension (int desired_dimension) override
bool  | CloseGap (int gap_index, int segments_to_modify)
int  | CloseGaps ()
int  | Count () const
Interface. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree () const override
void  | Destroy ()
of the number of segments is known. More...
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain () const override
void  | Dump (ON_TextLog &) const override
for debugging More...
ON_Curve *  | DuplicateCurve () const override
ON_Curve overrides. More...
void  | EmergencyDestroy ()
call if memory used by ON_PolyCurve becomes invalid More...
bool  | Evaluate (double, int, int, double *, int=0, int *=0) const override
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | Extend (const ON_Interval &domain) override
int  | FindNextGap (int segment_index0) const
ON_Curve *  | FirstSegmentCurve () const
returns nullptr if count = 0 More...
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetCurveParameterFromNurbFormParameter (double, double *) const override
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override More...
bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
int  | GetNurbForm (ON_NurbsCurve &, double=0.0, const ON_Interval *=nullptr) const override
bool  | GetNurbFormParameterFromCurveParameter (double, double *) const override
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override More...
bool  | GetSpanVector (double *) const override
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override More...
ON_Curve *  | HarvestSegment (int)
bool  | HasGapAt (int segment_index) const
int  | HasNurbForm () const override
bool  | HasSynchronizedSegmentDomains () const
bool  | Insert (int, ON_Curve *)
bool  | IsArc (const ON_Plane *=nullptr, ON_Arc *=nullptr, double=ON_ZERO_TOLERANCE) const override
bool  | IsClosed (void) const override
bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
bool  | IsDeformable () const override
virtual ON_Geometry::IsDeformable() override More...
bool  | IsInPlane (const ON_Plane &, double=ON_ZERO_TOLERANCE) const override
bool  | IsLinear (double=ON_ZERO_TOLERANCE) const override
bool  | IsNested () const
bool  | IsPeriodic (void) const override
periodic.) More...
bool  | IsPlanar (ON_Plane *=nullptr, double=ON_ZERO_TOLERANCE) const override
int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const override
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
bool  | IsValid (bool bAllowGaps, ON_TextLog *text_log) const
ON_Curve *  | LastSegmentCurve () const
returns nullptr if count = 0 More...
bool  | MakeDeformable () override
virtual ON_Geometry::MakeDeformable() override More...
ON_DEPRECATED_MSG ("Replace calls to HasGap() with FindNextGap(0)") int HasGap() const
ON_DEPRECATED_MSG ("Use RemoveNesting(). RemoveNestingEx() will be removed in the next release.") bool RemoveNestingEx()
ON_PolyCurve &  | operator= (const ON_PolyCurve &)
ON_Curve *  | operator[] (int) const
These operator[] functions return nullptr if index is out of range. More...
bool  | ParameterSearch (double t, int &index, bool bEnableSnap) const
double  | PolyCurveParameter (int segment_index, double segmentcurve_parameter) const
bool  | Prepend (ON_Curve *)
Prepend curve. More...
bool  | PrependAndMatch (ON_Curve *)
Prepend and match end of curve to start of polycurve. More...
bool  | Read (ON_BinaryArchive &) override
bool  | Remove ()
delete last segment and reduce count by 1 More...
bool  | Remove (int)
delete specified segment and reduce count by 1 More...
bool  | RemoveNesting ()
void  | Reserve (int)
make sure capacity is at least the specified count More...
bool  | Reverse () override
ON_Curve *  | SegmentCurve (int segment_index) const
double  | SegmentCurveParameter (double polycurve_parameter) const
const ON_CurveArray &  | SegmentCurves () const
ON_Interval  | SegmentDomain (int segment_index) const
int  | SegmentIndex (double polycurve_parameter) const
int  | SegmentIndex (ON_Interval sub_domain, int *segment_index0, int *segment_index1) const
const ON_SimpleArray< double > &  | SegmentParameters () const
bool  | SetDomain (double t0, double t1) override
bool  | SetEndPoint (ON_3dPoint end_point) override
virtual More...
bool  | SetParameterization (const double *t)
void  | SetSegment (int index, ON_Curve *crv)
bool  | SetStartPoint (ON_3dPoint start_point) override
Domain changes from [a,b] to [-b,-a]. More...
unsigned int  | SizeOf () const override
ON_Object overrides. More...
int  | SpanCount () const override
number of smooth spans in curve More...
bool  | Split (double t, ON_Curve *&left_side, ON_Curve *&right_side) const override
bool  | SwapCoordinates (int, int) override
bool  | SynchronizeSegmentDomains ()
bool  | Transform (const ON_Xform &) override
bool  | Trim (const ON_Interval &domain) override
bool  | Write (ON_BinaryArchive &) const override
 Public Member Functions inherited from ON_Curve
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
ON_3dVector  | CurvatureAt (double t) const
ON_3dVector  | DerivativeAt (double t) const
void  | DestroyCurveTree ()
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetParameterTolerance (double t, double *tminus, double *tplus) const
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
ON::object_type  | ObjectType () const override
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
ON_3dPoint  | PointAtEnd () const
ON_3dPoint  | PointAtStart () const
bool  | SetDomain (ON_Interval domain)
ON_3dVector  | TangentAt (double t) const
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
virtual bool  | HasBrepForm () const
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
void  | CopyUserData (const ON_Object &source_object)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
void  | MoveUserData (ON_Object &source_object)
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
 Protected Member Functions inherited from ON_Curve
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
Detailed Description
NoKeywords
/ / Copyright (c) 1993-2012 Robert McNeel & Associates. All rights reserved. / OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert / McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete openNURBS copyright information see http://www.opennurbs.org. / //////////////////////////////////////////////////////////////
Definition of poly curve (composite curve) Description: An ON_PolyCurve is an ON_Curve represented by a sequence of contiguous ON_Curve segments. A valid polycurve is represented by an array m_segment of Count()>=1 curve objects and a strictly increasing array m_t of Count()+1 parameter values. The i-th curve segment, when considered as part of the polycurve, is affinely reparamaterized from m_t[i] to m_t[i+1], i.e., m_segment[i].Domain()[0] is mapped to m_t[i] and m_segment[i].Domain()[1] is mapped to m_t[i+1].
Constructor & Destructor Documentation
◆ ON_PolyCurve() [1/3]
 ON_PolyCurve::ON_PolyCurve  |  ( |   | )
◆ ~ON_PolyCurve()
 virtual ON_PolyCurve::~ON_PolyCurve  |  ( |   | )
virtual
◆ ON_PolyCurve() [2/3]
 ON_PolyCurve::ON_PolyCurve  |  ( |  const ON_PolyCurve &  |   | )
◆ ON_PolyCurve() [3/3]
 ON_PolyCurve::ON_PolyCurve  |  ( |  int  |   | )
int = initial capacity - use when a good estimate
Member Function Documentation
◆ Append()
 bool ON_PolyCurve::Append  |  ( |  ON_Curve *  |   | )
Append curve.
◆ AppendAndMatch()
 bool ON_PolyCurve::AppendAndMatch  |  ( |  ON_Curve *  |   | )
Append and match start of curve to end of polycurve.
◆ ChangeClosedCurveSeam()
 bool ON_PolyCurve::ChangeClosedCurveSeam  |  ( |  double  |  t | )
overridevirtual
Description: If this curve is closed, then modify it so that the start/end point is at curve parameter t. Parameters: t - [in] curve parameter of new start/end point. The returned curves domain will start at t. Returns: true if successful. Remarks: Overrides virtual ON_Curve::ChangeClosedCurveSeam
Reimplemented from ON_Curve.
Reimplemented in ON_PolyEdgeCurve.
◆ ChangeDimension()
 bool ON_PolyCurve::ChangeDimension  |  ( |  int  |  desired_dimension | )
overridevirtual
Description: Change the dimension of a curve. Parameters: desired_dimension - [in] Returns: true if the curve's dimension was already desired_dimension or if the curve's dimension was successfully changed to desired_dimension.
Reimplemented from ON_Curve.
◆ CloseGap()
 bool ON_PolyCurve::CloseGap  |  ( |  int  |  gap_index,
|  int  |  segments_to_modify
)
Description: Modify the one or both locations at the end of segment[gap_index-1] and the start of segment[gap_index] so they are coindicent. Parameters: gap_index - [in] 1 <= gap_index < Count() If the locations at the end of segment[gap_index-1] and the start of segment[gap_index] are not identical, then an attempt is made to modify the segments so these locations are closer. ends_to_modify - [in] 0: (suggested) The code will decide what segments to modify. 1: modify the end location of segment[gap_index-1] 2: modify the start location of segment[gap_index] Returns: True if a modification was performed and HasGap(gap_index-1) returns 0 after the modification. False if no modification was preformed because there was no gap or because one could not be performed. Remarks: Note that passing the return value from FindNextGap() will close the gap found by FindNextGap().
◆ CloseGaps()
 int ON_PolyCurve::CloseGaps  |  ( |   | )
Description: Searches for and closes all gaps that can be found. Returns: Number of gaps that were closed.
◆ Count()
 int ON_PolyCurve::Count  |  ( |   | ) |   const
Interface.
number of segment curves
◆ DataCRC()
 ON__UINT32 ON_PolyCurve::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
virtual ON_Object::DataCRC override
Reimplemented from ON_Object.
◆ Degree()
 int ON_PolyCurve::Degree  |  ( |   | ) |   const
overridevirtual
Description: Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. Returns: degree
Implements ON_Curve.
◆ Destroy()
 void ON_PolyCurve::Destroy  |  ( |   | )
of the number of segments is known.
◆ DestroyRuntimeCache()
 void ON_PolyCurve::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
virtual ON_Object::DestroyRuntimeCache override
Reimplemented from ON_Curve.
Reimplemented in ON_PolyEdgeCurve.
◆ Dimension()
 int ON_PolyCurve::Dimension  |  ( |   | ) |   const
overridevirtual
ON_Geometry overrides.
Reimplemented from ON_Geometry.
◆ Domain()
 ON_Interval ON_PolyCurve::Domain  |  ( |   | ) |   const
overridevirtual
Returns: domain of the curve.
Implements ON_Curve.
◆ Dump()
 void ON_PolyCurve::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
for debugging
Reimplemented from ON_Object.
◆ DuplicateCurve()
 ON_Curve* ON_PolyCurve::DuplicateCurve  |  ( |   | ) |   const
overridevirtual
ON_Curve overrides.
Reimplemented from ON_Curve.
Reimplemented in ON_PolyEdgeCurve.
◆ EmergencyDestroy()
 void ON_PolyCurve::EmergencyDestroy  |  ( |   | )
call if memory used by ON_PolyCurve becomes invalid
◆ Evaluate()
 bool ON_PolyCurve::Evaluate  |  ( |  double  |  t,
|  int  |  der_count,
|  int  |  v_stride,
|  double *  |  v,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
overridevirtual
Description: This evaluator actually does all the work. The other ON_Curve evaluation tools call this virtual function. Parameters: t - [in] evaluation parameter ( usually in Domain() ). der_count - [in] (>=0) number of derivatives to evaluate v_stride - [in] (>=Dimension()) stride to use for the v[] array v - [out] array of length (der_count+1)*v_stride curve(t) is returned in (v[0],...,v[m_dim-1]), curve'(t) is retuned in (v[v_stride],...,v[v_stride+m_dim-1]), curve"(t) is retuned in (v[2*v_stride],...,v[2*v_stride+m_dim-1]), etc. side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::EvPoint ON_Curve::Ev1Der ON_Curve::Ev2Der
Parameters
t | returns false if unable to evaluate evaluation parameter
der_count | number of derivatives (>=0)
v_stride | array stride (>=Dimension())
v | array of length stride*(ndir+1)
side | optional - determines which side to evaluate from 0 = default < 0 to evaluate from below, > 0 to evaluate from above
hint | optional - evaluation hint (int) used to speed repeated evaluations
Implements ON_Curve.
◆ EvaluatePoint()
 bool ON_PolyCurve::EvaluatePoint  |  ( |  const class ON_ObjRef &  |  objref,
|  ON_3dPoint &  |  P
) |   |  const
overridevirtual
virtual ON_Geometry override
Reimplemented from ON_Curve.
◆ Extend()
 bool ON_PolyCurve::Extend  |  ( |  const ON_Interval &  |  domain | )
overridevirtual
Description: Where possible, analytically extends curve to include domain. Parameters: domain - [in] if domain is not included in curve domain, curve will be extended so that its domain includes domain. Will not work if curve is closed. Original curve is identical to the restriction of the resulting curve to the original curve domain, Returns: true if successful.
Reimplemented from ON_Curve.
◆ FindNextGap()
 int ON_PolyCurve::FindNextGap  |  ( |  int  |  segment_index0 | ) |   const
Description: Search the curve for gaps between the sub curve segments. Parameters: segment_index0 - [in] The search for gaps starts at with the comparing the end of segment[segment_index0] and the start of segment[segment_index0+1]. Returns: 0: No gaps were found. i > segment_index0: The end of polycuve segment[i-1] is not coincident with the start of polycurve segment[i].
◆ FirstSegmentCurve()
 ON_Curve* ON_PolyCurve::FirstSegmentCurve  |  ( |   | ) |   const
returns nullptr if count = 0
◆ GetBBox()
 bool ON_PolyCurve::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
virtual ON_Geometry GetBBox override
Reimplemented from ON_Geometry.
◆ GetCurveParameterFromNurbFormParameter()
 bool ON_PolyCurve::GetCurveParameterFromNurbFormParameter  |  ( |  double  |  ,
|  double *
) |   |  const
overridevirtual
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override
Reimplemented from ON_Curve.
◆ GetNextDiscontinuity()
 bool ON_PolyCurve::GetNextDiscontinuity  |  ( |  ON::continuity  |  c,
|  double  |  t0,
|  double  |  t1,
|  double *  |  t,
|  int *  |  hint = nullptr,
|  int *  |  dtype = nullptr,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Description: Search for a derivatitive, tangent, or curvature discontinuity. Parameters: c - [in] type of continity to test for. If ON::continuity::C1_continuous t0 - [in] search begins at t0 t1 - [in] (t0 < t1) search ends at t1 t - [out] if a discontinuity is found, the *t reports the parameter at the discontinuity. hint - [in/out] if GetNextDiscontinuity will be called repeatedly, passing a "hint" with initial value *hint=0 will increase the speed of the search. dtype - [out] if not nullptr, *dtype reports the kind of discontinuity found at *t. A value of 1 means the first derivative or unit tangent was discontinuous. A value of 2 means the second derivative or curvature was discontinuous. cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous or ON::continuity::Gsmooth_continuous. ON::continuity::G2_continuous: If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. ON::continuity::Gsmooth_continuous: If K0 and K1 are curvatures evaluated from above and below and the angle between K0 and K1 is at least twice angle tolerance or ||K0| - |K1|| > (max(|K0|,|K1|) > curvature_tolerance, then a curvature discontinuity is reported. Returns: true if a discontinuity was found on the interior of the interval (t0,t1). Remarks: Overrides ON_Curve::GetNextDiscontinuity.
Reimplemented from ON_Curve.
◆ GetNurbForm()
 int ON_PolyCurve::GetNurbForm  |  ( |  ON_NurbsCurve &  |  nurbs_curve,
|  double  |  tolerance = 0.0,
|  const ON_Interval *  |  subdomain = nullptr
) |   |  const
overridevirtual
Description: Get a NURBS curve representation of this curve. Parameters: nurbs_curve - [out] NURBS representation returned here tolerance - [in] tolerance to use when creating NURBS representation. subdomain - [in] if not nullptr, then the NURBS representation for this portion of the curve is returned. Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - returned NURBS parameterization matches the curve's to wthe desired accuracy 2 success - returned NURBS point locus matches the curve's to the desired accuracy and the domain of the NURBS curve is correct. On However, This curve's parameterization and the NURBS curve parameterization may not match to the desired accuracy. This situation happens when getting NURBS representations of curves that have a transendental parameterization like circles Remarks: This is a low-level virtual function. If you do not need the parameterization information provided by the return code, then ON_Curve::NurbsCurve may be easier to use. See Also: ON_Curve::NurbsCurve
Parameters
nurbs_curve | returns 0: unable to create NURBS representation with desired accuracy. 1: success - returned NURBS parameterization matches the curve's to wthe desired accuracy 2: success - returned NURBS point locus matches the curve's to the desired accuracy but, on the interior of the curve's domain, the curve's parameterization and the NURBS parameterization may not match to the desired accuracy.
subdomain | OPTIONAL subdomain of polycurve
Reimplemented from ON_Curve.
◆ GetNurbFormParameterFromCurveParameter()
 bool ON_PolyCurve::GetNurbFormParameterFromCurveParameter  |  ( |  double  |  ,
|  double *
) |   |  const
overridevirtual
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override
Reimplemented from ON_Curve.
◆ GetSpanVector()
 bool ON_PolyCurve::GetSpanVector  |  ( |  double *  |  knots | ) |   const
overridevirtual
Description: Get number of parameters of "knots". Parameters: knots - [out] an array of length SpanCount()+1 is filled in with the parameters where the curve is not smooth (C-infinity). Returns: true if successful
Parameters
knots | span "knots" array of length SpanCount() + 1
Implements ON_Curve.
◆ GetTightBoundingBox()
 bool ON_PolyCurve::GetTightBoundingBox  |  ( |  class ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const class ON_Xform *  |  xform = nullptr
) |   |  const
overridevirtual
virtual ON_Geometry GetTightBoundingBox override
Reimplemented from ON_Curve.
◆ HarvestSegment()
 ON_Curve* ON_PolyCurve::HarvestSegment  |  ( |  int  |   | )
Use the HarvestSegment() function when you want to prevent a segment from being destroyed by ~ON_PolyCurve(). HarvestSegment() replaces the polycurve segment with a nullptr. Count() and parameter information remains unchanged.
◆ HasGapAt()
 bool ON_PolyCurve::HasGapAt  |  ( |  int  |  segment_index | ) |   const
Description: Determine if there is a gap between the end of segment[segment_index] and the start of segment[segment_index+1]. Parameters: segment_index - [in] >= 0 Returns: true: segment_index was valid and there is a gap between the end of segment[segment_index] and the start of segment[segment_index+1].
◆ HasNurbForm()
 int ON_PolyCurve::HasNurbForm  |  ( |   | ) |   const
overridevirtual
Description: Does a NURBS curve representation of this curve. Parameters: Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - NURBS parameterization matches the curve's to wthe desired accuracy 2 success - NURBS point locus matches the curve's and the domain of the NURBS curve is correct. However, This curve's parameterization and the NURBS curve parameterization may not match. This situation happens when getting NURBS representations of curves that have a transendental parameterization like circles Remarks: This is a low-level virtual function. See Also: ON_Curve::GetNurbForm ON_Curve::NurbsCurve
Reimplemented from ON_Curve.
◆ HasSynchronizedSegmentDomains()
 bool ON_PolyCurve::HasSynchronizedSegmentDomains  |  ( |   | ) |   const
Returns: True if the domains of the curves in the m_segment[] array exactly match the domains of the segments specified in the m_t[] array. Put another way, returns true if SegmentDomain(i) = SegmentCurve(i).Domain() for every segment index.
◆ Insert()
 bool ON_PolyCurve::Insert  |  ( |  int  |  ,
|  ON_Curve *
)
◆ IsArc()
 bool ON_PolyCurve::IsArc  |  ( |  const ON_Plane *  |  plane = nullptr,
|  ON_Arc *  |  arc = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: Test a curve to see if the locus if its points is an arc or circle. Parameters: plane - [in] if not nullptr, test is performed in this plane arc - [out] if not nullptr and true is returned, then arc parameters are filled in tolerance - [in] tolerance to use when checking Returns: ON_Arc.m_angle > 0 if curve locus is an arc between specified points. If ON_Arc.m_angle is 2.0*ON_PI, then the curve is a circle.
Parameters
plane | ON_Arc.m_angle > 0 if curve locus is an arc between specified points if not nullptr, test is performed in this plane
arc | if not nullptr and true is returned, then arc parameters
tolerance | are filled in tolerance to use when checking
Reimplemented from ON_Curve.
◆ IsClosed()
 bool ON_PolyCurve::IsClosed  |  ( |  void  |   | ) |   const
overridevirtual
CV = euclidean location of end CV, or curve is
Reimplemented from ON_Curve.
Reimplemented in ON_PolyEdgeCurve.
◆ IsContinuous()
 bool ON_PolyCurve::IsContinuous  |  ( |  ON::continuity  |  c,
|  double  |  t,
|  int *  |  hint = nullptr,
|  double  |  point_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d1_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d2_tolerance = ON_ZERO_TOLERANCE,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Description: Test continuity at a curve parameter value. Parameters: c - [in] continuity to test for t - [in] parameter to test hint - [in] evaluation hint point_tolerance - [in] if the distance between two points is greater than point_tolerance, then the curve is not C0. d1_tolerance - [in] if the difference between two first derivatives is greater than d1_tolerance, then the curve is not C1. d2_tolerance - [in] if the difference between two second derivatives is greater than d2_tolerance, then the curve is not C2. cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous or ON::continuity::Gsmooth_continuous. ON::continuity::G2_continuous: If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. ON::continuity::Gsmooth_continuous: If K0 and K1 are curvatures evaluated from above and below and the angle between K0 and K1 is at least twice angle tolerance or ||K0| - |K1|| > (max(|K0|,|K1|) > curvature_tolerance, then a curvature discontinuity is reported. Returns: true if the curve has at least the c type continuity at the parameter t. Remarks: Overrides ON_Curve::IsContinuous.
Reimplemented from ON_Curve.
◆ IsDeformable()
 bool ON_PolyCurve::IsDeformable  |  ( |   | ) |   const
overridevirtual
virtual ON_Geometry::IsDeformable() override
Reimplemented from ON_Geometry.
◆ IsInPlane()
 bool ON_PolyCurve::IsInPlane  |  ( |  const ON_Plane &  |  test_plane,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: Test a curve to see if it lies in a specific plane. Parameters: test_plane - [in] tolerance - [in] tolerance to use when checking Returns: true if the maximum distance from the curve to the test_plane is <= tolerance.
Parameters
test_plane | plane to test
tolerance | tolerance to use when checking
Implements ON_Curve.
◆ IsLinear()
 bool ON_PolyCurve::IsLinear  |  ( |  double  |  tolerance = ON_ZERO_TOLERANCE | ) |   const
overridevirtual
Description: Test a curve to see if the locus if its points is a line segment. Parameters: tolerance - [in] ///< tolerance to use when checking linearity Returns: true if the ends of the curve are farther than tolerance apart and the maximum distance from any point on the curve to the line segment connecting the curve's ends is <= tolerance.
Parameters
tolerance | true if curve locus is a line segment between between specified points tolerance to use when checking linearity
Reimplemented from ON_Curve.
◆ IsNested()
 bool ON_PolyCurve::IsNested  |  ( |   | ) |   const
Returns: True if a curve in the m_segment[] array is an ON_PolyCurve.
◆ IsPeriodic()
 bool ON_PolyCurve::IsPeriodic  |  ( |  void  |   | ) |   const
overridevirtual
periodic.)
Reimplemented from ON_Curve.
◆ IsPlanar()
 bool ON_PolyCurve::IsPlanar  |  ( |  ON_Plane *  |  plane = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: Test a curve to see if it is planar. Parameters: plane - [out] if not nullptr and true is returned, the plane parameters are filled in. tolerance - [in] tolerance to use when checking Returns: true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.
Parameters
plane | if not nullptr and true is returned, then plane parameters
tolerance | are filled in tolerance to use when checking
Reimplemented from ON_Curve.
◆ IsPolyline()
 int ON_PolyCurve::IsPolyline  |  ( |  ON_SimpleArray< ON_3dPoint > *  |  pline_points = nullptr,
|  ON_SimpleArray< double > *  |  pline_t = nullptr
) |   |  const
overridevirtual
Description: Several types of ON_Curve can have the form of a polyline including a degree 1 ON_NurbsCurve, an ON_PolylineCurve, and an ON_PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline. Parameters: pline_points - [out] if not nullptr and true is returned, then the points of the polyline form are returned here. t - [out] if not nullptr and true is returned, then the parameters of the polyline points are returned here. Returns: table 0 curve is not some form of a polyline >=2 number of points in polyline form
Reimplemented from ON_Curve.
◆ IsValid() [1/2]
 bool ON_PolyCurve::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Description: Tests an object to see if its data members are correctly initialized. Parameters: text_log - [in] if the object is not valid and text_log is not nullptr, then a brief englis description of the reason the object is not valid is appened to the log. The information appended to text_log is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Returns: table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Geometry.
◆ IsValid() [2/2]
 bool ON_PolyCurve::IsValid  |  ( |  bool  |  bAllowGaps,
|  ON_TextLog *  |  text_log
) |   |  const
Description: Tests an object to see if its data members are correctly initialized. Parameters: bAllowGaps - [in] If true, gaps are allowed between polycurve segments. If false, gaps are not allowed between polycurve segments. text_log - [in] if the object is not valid and text_log is not nullptr, then a brief englis description of the reason the object is not valid is appened to the log. The information appended to text_log is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Returns: table true object is valid false object is invalid, uninitialized, etc. Remarks: Overrides virtual ON_Object::IsValid
◆ LastSegmentCurve()
 ON_Curve* ON_PolyCurve::LastSegmentCurve  |  ( |   | ) |   const
returns nullptr if count = 0
◆ MakeDeformable()
 bool ON_PolyCurve::MakeDeformable  |  ( |   | )
overridevirtual
virtual ON_Geometry::MakeDeformable() override
Reimplemented from ON_Geometry.
◆ ON_DEPRECATED_MSG() [1/2]
 ON_PolyCurve::ON_DEPRECATED_MSG  |  ( |  "Replace calls to HasGap() with FindNextGap(0)"  |   | ) |   const
◆ ON_DEPRECATED_MSG() [2/2]
 ON_PolyCurve::ON_DEPRECATED_MSG  |  ( |  "Use RemoveNesting(). RemoveNestingEx() will be removed in the next release."  |   | )
◆ operator=()
 ON_PolyCurve& ON_PolyCurve::operator=  |  ( |  const ON_PolyCurve &  |   | )
◆ operator[]()
 ON_Curve* ON_PolyCurve::operator[]  |  ( |  int  |   | ) |   const
These operator[] functions return nullptr if index is out of range.
◆ ParameterSearch()
 bool ON_PolyCurve::ParameterSearch  |  ( |  double  |  t,
|  int &  |  index,
|  bool  |  bEnableSnap
) |   |  const
Description: Lookup a parameter in the m_t array, optionally using a built in snap tolerance to snap a parameter value to an element of m_t. Parameters: t - [in] parameter index -[out] index into m_t such that if the function returns true then t is equal to, or is within tolerance of m_t[index]. if function returns false then the value of index is
 @table
            condition                                   value of index
t<m_t[0] or m_t is empty                -1
    m_t[i] < t < m_t[i+1]               i for 0<=i<=m_t.Count()-2
    t>m_t[ m_t.Count()-1]               m_t.Count()-1
bEnableSnap -[in] if true use tolerance when comparing to m_t values Returns true if the t is exactly equal to, or within tolerance of (only if bEnableSnap==true) m_t[index].
◆ PolyCurveParameter()
 double ON_PolyCurve::PolyCurveParameter  |  ( |  int  |  segment_index,
|  double  |  segmentcurve_parameter
) |   |  const
Description: Converts a segment curve parameter to a polycurve parameter. Parameters: segment_index - [in] segmentcurve_parameter - [in] Returns: Polycurve evaluation parameter or ON_UNSET_VALUE if the polycurve curve parameter cannot be computed. See Also: ON_PolyCurve::SegmentCurveParameter
◆ Prepend()
 bool ON_PolyCurve::Prepend  |  ( |  ON_Curve *  |   | )
Prepend curve.
ON_Curve pointers added with Prepend(), Append(), PrependAndMatch(), AppendANdMatch(),and Insert() are deleted by ~ON_PolyCurve(). Use ON_CurveProxy( ON_Curve*) if you want the original curve segment to survive ~ON_PolyCurve().
◆ PrependAndMatch()
 bool ON_PolyCurve::PrependAndMatch  |  ( |  ON_Curve *  |   | )
Prepend and match end of curve to start of polycurve.
PrependAndMatch() and AppendAndMatch() return false if this->IsCLosed() or this->Count() > 0 and curve is closed
◆ Read()
 bool ON_PolyCurve::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::ReadObject(). Parameters: binary_archive - archive to read from Returns: Returns true if the read is successful. Remarks: Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Parameters
binary_archive | open binary file
Reimplemented from ON_Object.
◆ Remove() [1/2]
 bool ON_PolyCurve::Remove  |  ( |   | )
delete last segment and reduce count by 1
◆ Remove() [2/2]
 bool ON_PolyCurve::Remove  |  ( |  int  |   | )
delete specified segment and reduce count by 1
◆ RemoveNesting()
 bool ON_PolyCurve::RemoveNesting  |  ( |   | )
Description: Removes the nested of polycurves. The result will have not have an ON_PolyCurve as a segment but will have identical locus and parameterization. Returns: True if a nested polycurve was removed. False if no nested polycurves were found.
◆ Reserve()
 void ON_PolyCurve::Reserve  |  ( |  int  |   | )
make sure capacity is at least the specified count
◆ Reverse()
 bool ON_PolyCurve::Reverse  |  ( |   | )
overridevirtual
reverse parameterizatrion
Implements ON_Curve.
◆ SegmentCurve()
 ON_Curve* ON_PolyCurve::SegmentCurve  |  ( |  int  |  segment_index | ) |   const
Description: Returns a pointer to a segment curve. Parameters: segment_index - [in] 0 based index (0 <= segment_index < Count() ) Returns: A pointer to the segment curve. Returns nullptr if segment_index < 0 or segment_index >= Count().
◆ SegmentCurveParameter()
 double ON_PolyCurve::SegmentCurveParameter  |  ( |  double  |  polycurve_parameter | ) |   const
Description: Converts a polycurve parameter to a segment curve parameter. Parameters: polycurve_parameter - [in] Returns: Segment curve evaluation parameter or ON_UNSET_VALUE if the segment curve parameter cannot be computed. See Also: ON_PolyCurve::PolyCurveParameter
◆ SegmentCurves()
 const ON_CurveArray& ON_PolyCurve::SegmentCurves  |  ( |   | ) |   const
Returns: Reference to m_segment.
◆ SegmentDomain()
 ON_Interval ON_PolyCurve::SegmentDomain  |  ( |  int  |  segment_index | ) |   const
Description: Returns the polycurve subdomain assigned to a segment curve. Parameters: segment_index - [in] 0 based index (0 <= segment_index < Count() ) Returns: The polycurve subdomain assigned to a segment curve. Returns ([ON_UNSET_VALUE,ON_UNSET_VALUE) if segment_index < 0 or segment_index >= Count().
◆ SegmentIndex() [1/2]
 int ON_PolyCurve::SegmentIndex  |  ( |  double  |  polycurve_parameter | ) |   const
Description: Find the segment used for evaluation at polycurve_parameter. Parameters: polycurve_parameter - [in] Returns: index of the segment used for evaluation at polycurve_parameter. If polycurve_parameter < Domain.Min(), then 0 is returned. If polycurve_parameter > Domain.Max(), then Count()-1 is returned.
◆ SegmentIndex() [2/2]
 int ON_PolyCurve::SegmentIndex  |  ( |  ON_Interval  |  sub_domain,
|  int *  |  segment_index0,
|  int *  |  segment_index1
) |   |  const
Description: Find the segments with support on sub_domain. Parameters: sub_domain - [in] increasing interval segment_index0 - [out] segment_index1 - [out] segments with index i where segment_index0 <= i < *segment_index1 are the segments with support on the sub_domain Returns: number of segments with support on sub_domain.
◆ SegmentParameters()
 const ON_SimpleArray<double>& ON_PolyCurve::SegmentParameters  |  ( |   | ) |   const
Returns: Reference to m_t.
◆ SetDomain()
 bool ON_PolyCurve::SetDomain  |  ( |  double  |  t0,
|  double  |  t1
)
overridevirtual
Description: virtual ON_Curve::SetDomain override. Set the domain of the curve Parameters: t0 - [in] t1 - [in] new domain will be [t0,t1] Returns: true if successful.
Reimplemented from ON_Curve.
◆ SetEndPoint()
 bool ON_PolyCurve::SetEndPoint  |  ( |  ON_3dPoint  |  end_point | )
overridevirtual
virtual
Description: Force the curve to end at a specified point. Parameters: end_point - [in] Returns: true if successful. Remarks: Some end points cannot be moved. Be sure to check return code. See Also: ON_Curve::SetStartPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
Reimplemented from ON_Curve.
Reimplemented in ON_PolyEdgeCurve.
◆ SetParameterization()
 bool ON_PolyCurve::SetParameterization  |  ( |  const double *  |  t | )
Description: Expert user function to set the m_t[] array. Parameters: t - [in] increasing array of SegmentCount()+1 parameters. Returns True if successful.
◆ SetSegment()
 void ON_PolyCurve::SetSegment  |  ( |  int  |  index,
|  ON_Curve *  |  crv
)
Expert user function Sets the m_segment[index] to crv.
◆ SetStartPoint()
 bool ON_PolyCurve::SetStartPoint  |  ( |  ON_3dPoint  |  start_point | )
overridevirtual
Domain changes from [a,b] to [-b,-a].
Description: Force the curve to start at a specified point. Parameters: start_point - [in] Returns: true if successful. Remarks: Some start points cannot be moved. Be sure to check return code. See Also: ON_Curve::SetEndPoint ON_Curve::PointAtStart ON_Curve::PointAtEndvirtual
Reimplemented from ON_Curve.
Reimplemented in ON_PolyEdgeCurve.
◆ SizeOf()
 unsigned int ON_PolyCurve::SizeOf  |  ( |   | ) |   const
overridevirtual
ON_Object overrides.
virtual ON_Object::SizeOf override
Reimplemented from ON_Curve.
◆ SpanCount()
 int ON_PolyCurve::SpanCount  |  ( |   | ) |   const
overridevirtual
number of smooth spans in curve
Implements ON_Curve.
◆ Split()
 bool ON_PolyCurve::Split  |  ( |  double  |  t,
|  ON_Curve *&  |  left_side,
|  ON_Curve *&  |  right_side
) |   |  const
overridevirtual
Description: virtual ON_Curve::Split override. Divide the curve at the specified parameter. The parameter must be in the interior of the curve's domain. The pointers passed to Split must either be nullptr or point to an ON_Curve object of the same of the same type. If the pointer is nullptr, then a curve will be created in Split(). You may pass "this" as one of the pointers to Split(). Parameters: t - [in] parameter in interval Domain(). left_side - [out] left portion of curve right_side - [out] right portion of curve Example: For example, if crv were an ON_NurbsCurve, then
ON_NurbsCurve right_side; crv.Split( crv.Domain().Mid() &crv, &right_side );
would split crv at the parametric midpoint, put the left side in crv, and return the right side in right_side.
Parameters
t | t = curve parameter to split curve at
left_side | left portion returned here
right_side | right portion returned here
Reimplemented from ON_Curve.
◆ SwapCoordinates()
 bool ON_PolyCurve::SwapCoordinates  |  ( |  int  |  i,
|  int  |  j
)
overridevirtual
Description: Swaps object coordinate values with indices i and j.
Parameters: i - [in] coordinate index j - [in] coordinate index
Remarks: The default implementation uses the virtual Transform() function to calculate the result. If you are creating an object where Transform() is slow, coordinate swapping will be frequently used, and coordinate swapping can be quickly accomplished, then override this function.
Example:
     ON_Point point(7,8,9);
     point.SwapCoordinates(0,2);
     ///< point = (9,8,7)
Parameters
j | indices of coords to swap
Reimplemented from ON_Geometry.
◆ SynchronizeSegmentDomains()
 bool ON_PolyCurve::SynchronizeSegmentDomains  |  ( |   | )
Description: Sets the domain of the curve int the m_segment[] array to exactly match the domain defined in the m_t[] array. This is not required, but can simplify some coding situations. Returns: True if at least one segment was reparameterized. False if no changes were made.
◆ Transform()
 bool ON_PolyCurve::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
Description: overrides virtual ON_Geometry::Transform(). ON_Curve::Transform() calls ON_Geometry::Transform(xform), which calls ON_Object::TransformUserData(xform), and then calls this->DestroyCurveTree(). Parameters: xform - [in] transformation to apply to object. Remarks: Classes derived from ON_Curve should call ON_Curve::Transform() to handle user data transformations and curve tree destruction and then transform their definition.
Reimplemented from ON_Curve.
◆ Trim()
 bool ON_PolyCurve::Trim  |  ( |  const ON_Interval &  |  domain | )
overridevirtual
Description: virtual ON_Curve::Trim override. Removes portions of the curve outside the specified interval. Parameters: domain - [in] interval of the curve to keep. Portions of the curve before curve(domain[0]) and after curve(domain[1]) are removed. Returns: true if successful.
Reimplemented from ON_Curve.
◆ Write()
 bool ON_PolyCurve::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::WriteObject(). Parameters: binary_archive - archive to write to Returns: Returns true if the write is successful. Remarks: Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Parameters
binary_archive | open binary file
Reimplemented from ON_Object.