Public Attributes | List of all members
ON_FaceNameKey Class Reference
#include <opennurbs_textiterator.h>
 Public Attributes
unsigned int  | m_charset = 0
unsigned int  | m_codepage = 1252
ON_wString  | m_facename
int  | m_rtf_font_index = -1
Member Data Documentation
◆ m_charset
 unsigned int ON_FaceNameKey::m_charset = 0
◆ m_codepage
 unsigned int ON_FaceNameKey::m_codepage = 1252
◆ m_facename
 ON_wString ON_FaceNameKey::m_facename
◆ m_rtf_font_index
 int ON_FaceNameKey::m_rtf_font_index = -1