Public Member Functions | Public Attributes | List of all members
ON_LineCurve Class Reference
#include <opennurbs_linecurve.h>
 Inheritance diagram for ON_LineCurve:
 Public Member Functions
ON_LineCurve () ON_NOEXCEPT
ON_LineCurve (const ON_LineCurve &)
ON_LineCurve (const ON_2dPoint &, const ON_2dPoint &)
creates a 2d line curve More...
ON_LineCurve (const ON_3dPoint &, const ON_3dPoint &)
creates a 3d line curve More...
ON_LineCurve (const ON_Line &)
ON_LineCurve (const ON_Line &, double, double)
virtual  | ~ON_LineCurve ()
bool  | ChangeDimension (int desired_dimension) override
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree () const override
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain () const override
ON_Curve overrides. More...
void  | Dump (ON_TextLog &) const override
for debugging More...
bool  | Evaluate (double, int, int, double *, int=0, int *=0) const override
Domain changes from [a,b] to [-b,-a]. More...
bool  | Extend (const ON_Interval &domain) override
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetCurveParameterFromNurbFormParameter (double nurbs_t, double *curve_t) const override
int  | GetNurbForm (ON_NurbsCurve &, double=0.0, const ON_Interval *=nullptr) const override
bool  | GetNurbFormParameterFromCurveParameter (double curve_t, double *nurbs_t) const override
bool  | GetSpanVector (double *) const override
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override More...
int  | HasNurbForm () const override
bool  | IsArc (const ON_Plane *=nullptr, ON_Arc *=nullptr, double=ON_ZERO_TOLERANCE) const override
bool  | IsClosed (void) const override
bool  | IsDeformable () const override
virtual ON_Geometry::IsDeformable() override More...
bool  | IsInPlane (const ON_Plane &, double=ON_ZERO_TOLERANCE) const override
bool  | IsLinear (double=ON_ZERO_TOLERANCE) const override
bool  | IsPeriodic (void) const override
periodic.) More...
bool  | IsPlanar (ON_Plane *=nullptr, double=ON_ZERO_TOLERANCE) const override
int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const override
virtual More...
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
bool  | MakeDeformable () override
virtual ON_Geometry::MakeDeformable() override More...
ON_LineCurve &  | operator= (const ON_LineCurve &)
ON_LineCurve &  | operator= (const ON_Line &)
bool  | Read (ON_BinaryArchive &) override
bool  | Reverse () override
bool  | SetDomain (double t0, double t1) override
bool  | SetEndPoint (ON_3dPoint end_point) override
bool  | SetStartPoint (ON_3dPoint start_point) override
unsigned int  | SizeOf () const override
ON_Object overrides. More...
int  | SpanCount () const override
number of smooth spans in curve More...
bool  | Split (double t, ON_Curve *&left_side, ON_Curve *&right_side) const override
bool  | SwapCoordinates (int, int) override
bool  | Transform (const ON_Xform &) override
bool  | Trim (const ON_Interval &domain) override
bool  | Write (ON_BinaryArchive &) const override
 Public Member Functions inherited from ON_Curve
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
virtual bool  | ChangeClosedCurveSeam (double t)
ON_3dVector  | CurvatureAt (double t) const
ON_3dVector  | DerivativeAt (double t) const
void  | DestroyCurveTree ()
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
virtual ON_Curve *  | DuplicateCurve () const
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const
virtual bool  | GetParameterTolerance (double t, double *tminus, double *tplus) const
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
virtual bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
ON::object_type  | ObjectType () const override
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
ON_3dPoint  | PointAtEnd () const
ON_3dPoint  | PointAtStart () const
bool  | SetDomain (ON_Interval domain)
ON_3dVector  | TangentAt (double t) const
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
virtual bool  | HasBrepForm () const
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
void  | CopyUserData (const ON_Object &source_object)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
void  | MoveUserData (ON_Object &source_object)
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Public Attributes
int  | m_dim
2 or 3 (2 so ON_LineCurve can be uses as a trimming curve) More...
ON_Line  | m_line
Interface. More...
ON_Interval  | m_t
domain More...
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
 Protected Member Functions inherited from ON_Curve
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
Constructor & Destructor Documentation
◆ ON_LineCurve() [1/6]
 ON_LineCurve::ON_LineCurve  |  ( |   | )
◆ ~ON_LineCurve()
 virtual ON_LineCurve::~ON_LineCurve  |  ( |   | )
virtual
◆ ON_LineCurve() [2/6]
 ON_LineCurve::ON_LineCurve  |  ( |  const ON_LineCurve &  |   | )
◆ ON_LineCurve() [3/6]
 ON_LineCurve::ON_LineCurve  |  ( |  const ON_2dPoint &  |  ,
|  const ON_2dPoint &
)
creates a 2d line curve
◆ ON_LineCurve() [4/6]
 ON_LineCurve::ON_LineCurve  |  ( |  const ON_3dPoint &  |  ,
|  const ON_3dPoint &
)
creates a 3d line curve
◆ ON_LineCurve() [5/6]
 ON_LineCurve::ON_LineCurve  |  ( |  const ON_Line &  |   | )
◆ ON_LineCurve() [6/6]
 ON_LineCurve::ON_LineCurve  |  ( |  const ON_Line &  |  ,
|  double  |  ,
|  double
)
Member Function Documentation
◆ ChangeDimension()
 bool ON_LineCurve::ChangeDimension  |  ( |  int  |  desired_dimension | )
overridevirtual
Description: Change the dimension of a curve. Parameters: desired_dimension - [in] Returns: true if the curve's dimension was already desired_dimension or if the curve's dimension was successfully changed to desired_dimension.
Reimplemented from ON_Curve.
◆ DataCRC()
 ON__UINT32 ON_LineCurve::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
virtual ON_Object::DataCRC override
Reimplemented from ON_Object.
◆ Degree()
 int ON_LineCurve::Degree  |  ( |   | ) |   const
overridevirtual
Description: Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. Returns: degree
Implements ON_Curve.
◆ Dimension()
 int ON_LineCurve::Dimension  |  ( |   | ) |   const
overridevirtual
ON_Geometry overrides.
Reimplemented from ON_Geometry.
◆ Domain()
 ON_Interval ON_LineCurve::Domain  |  ( |   | ) |   const
overridevirtual
ON_Curve overrides.
Implements ON_Curve.
◆ Dump()
 void ON_LineCurve::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
for debugging
Reimplemented from ON_Object.
◆ Evaluate()
 bool ON_LineCurve::Evaluate  |  ( |  double  |  ,
|  int  |  ,
|  int  |  ,
|  double *  |  ,
|  int  |   = 0,
|  int *  |   = 0
) |   |  const
overridevirtual
Domain changes from [a,b] to [-b,-a].
Implements ON_Curve.
◆ Extend()
 bool ON_LineCurve::Extend  |  ( |  const ON_Interval &  |  domain | )
overridevirtual
Description: Where possible, analytically extends curve to include domain. Parameters: domain - [in] if domain is not included in curve domain, curve will be extended so that its domain includes domain.
 Original curve is identical to the restriction of the resulting curve to the original curve domain, Returns: true if successful.
Reimplemented from ON_Curve.
◆ GetBBox()
 bool ON_LineCurve::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
virtual ON_Geometry GetBBox override
Reimplemented from ON_Geometry.
◆ GetCurveParameterFromNurbFormParameter()
 bool ON_LineCurve::GetCurveParameterFromNurbFormParameter  |  ( |  double  |  nurbs_t,
|  double *  |  curve_t
) |   |  const
overridevirtual
Description: virtual ON_Curve::GetCurveParameterFromNurbFormParameter override. Convert a NURBS curve parameter to a curve parameter
Parameters: nurbs_t - [in] nurbs form parameter curve_t - [out] curve parameter
Remarks: If GetNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.
See Also: ON_Curve::GetNurbForm, ON_Curve::GetNurbFormParameterFromCurveParameter virtual
Reimplemented from ON_Curve.
◆ GetNurbForm()
 int ON_LineCurve::GetNurbForm  |  ( |  ON_NurbsCurve &  |  ,
|  double  |   = 0.0,
|  const ON_Interval *  |   = nullptr
) |   |  const
overridevirtual
Description: virtual ON_Curve::GetNurbForm override. Get a NURBS curve representation of this curve. Parameters: nurbs_curve - [out] NURBS representation returned here tolerance - [in] tolerance to use when creating NURBS representation. subdomain - [in] if not nullptr, then the NURBS representation for this portion of the curve is returned. Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - returned NURBS parameterization matches the curve's to wthe desired accuracy 2 success - returned NURBS point locus matches the curve's to the desired accuracy but, on the interior of the curve's domain, the curve's parameterization and the NURBS parameterization may not match to the desired accuracy.
Reimplemented from ON_Curve.
◆ GetNurbFormParameterFromCurveParameter()
 bool ON_LineCurve::GetNurbFormParameterFromCurveParameter  |  ( |  double  |  curve_t,
|  double *  |  nurbs_t
) |   |  const
overridevirtual
Description: virtual ON_Curve::GetNurbFormParameterFromCurveParameter override. Convert a curve parameter to a NURBS curve parameter.
Parameters: curve_t - [in] curve parameter nurbs_t - [out] nurbs form parameter
Remarks: If GetNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.
See Also: ON_Curve::GetNurbForm, ON_Curve::GetCurveParameterFromNurbFormParameter virtual
Reimplemented from ON_Curve.
◆ GetSpanVector()
 bool ON_LineCurve::GetSpanVector  |  ( |  double *  |  knots | ) |   const
overridevirtual
Description: Get number of parameters of "knots". Parameters: knots - [out] an array of length SpanCount()+1 is filled in with the parameters where the curve is not smooth (C-infinity). Returns: true if successful
Parameters
knots | span "knots" array of length SpanCount() + 1
Implements ON_Curve.
◆ GetTightBoundingBox()
 bool ON_LineCurve::GetTightBoundingBox  |  ( |  class ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const class ON_Xform *  |  xform = nullptr
) |   |  const
overridevirtual
virtual ON_Geometry GetTightBoundingBox override
Reimplemented from ON_Curve.
◆ HasNurbForm()
 int ON_LineCurve::HasNurbForm  |  ( |   | ) |   const
overridevirtual
Description: virtual ON_Curve::HasNurbForm override. Does a NURBS curve representation of this curve exist. Parameters: Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - returned NURBS parameterization matches the curve's to wthe desired accuracy 2 success - returned NURBS point locus matches the curve's to the desired accuracy but, on the interior of the curve's domain, the curve's parameterization and the NURBS parameterization may not match to the desired accuracy.
Reimplemented from ON_Curve.
◆ IsArc()
 bool ON_LineCurve::IsArc  |  ( |  const ON_Plane *  |  plane = nullptr,
|  ON_Arc *  |  arc = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: Test a curve to see if the locus if its points is an arc or circle. Parameters: plane - [in] if not nullptr, test is performed in this plane arc - [out] if not nullptr and true is returned, then arc parameters are filled in tolerance - [in] tolerance to use when checking Returns: ON_Arc.m_angle > 0 if curve locus is an arc between specified points. If ON_Arc.m_angle is 2.0*ON_PI, then the curve is a circle.
Parameters
plane | ON_Arc.m_angle > 0 if curve locus is an arc between specified points if not nullptr, test is performed in this plane
arc | if not nullptr and true is returned, then arc parameters
tolerance | are filled in tolerance to use when checking
Reimplemented from ON_Curve.
◆ IsClosed()
 bool ON_LineCurve::IsClosed  |  ( |  void  |   | ) |   const
overridevirtual
CV = euclidean location of end CV, or curve is
Reimplemented from ON_Curve.
◆ IsDeformable()
 bool ON_LineCurve::IsDeformable  |  ( |   | ) |   const
overridevirtual
virtual ON_Geometry::IsDeformable() override
Reimplemented from ON_Geometry.
◆ IsInPlane()
 bool ON_LineCurve::IsInPlane  |  ( |  const ON_Plane &  |  test_plane,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: Test a curve to see if it lies in a specific plane. Parameters: test_plane - [in] tolerance - [in] tolerance to use when checking Returns: true if the maximum distance from the curve to the test_plane is <= tolerance.
Parameters
test_plane | plane to test
tolerance | tolerance to use when checking
Implements ON_Curve.
◆ IsLinear()
 bool ON_LineCurve::IsLinear  |  ( |  double  |  tolerance = ON_ZERO_TOLERANCE | ) |   const
overridevirtual
Description: Test a curve to see if the locus if its points is a line segment. Parameters: tolerance - [in] ///< tolerance to use when checking linearity Returns: true if the ends of the curve are farther than tolerance apart and the maximum distance from any point on the curve to the line segment connecting the curve's ends is <= tolerance.
Parameters
tolerance | true if curve locus is a line segment between between specified points tolerance to use when checking linearity
Reimplemented from ON_Curve.
◆ IsPeriodic()
 bool ON_LineCurve::IsPeriodic  |  ( |  void  |   | ) |   const
overridevirtual
periodic.)
Reimplemented from ON_Curve.
◆ IsPlanar()
 bool ON_LineCurve::IsPlanar  |  ( |  ON_Plane *  |  plane = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: Test a curve to see if it is planar. Parameters: plane - [out] if not nullptr and true is returned, the plane parameters are filled in. tolerance - [in] tolerance to use when checking Returns: true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.
Parameters
plane | if not nullptr and true is returned, then plane parameters
tolerance | are filled in tolerance to use when checking
Reimplemented from ON_Curve.
◆ IsPolyline()
 int ON_LineCurve::IsPolyline  |  ( |  ON_SimpleArray< ON_3dPoint > *  |  pline_points = nullptr,
|  ON_SimpleArray< double > *  |  pline_t = nullptr
) |   |  const
overridevirtual
virtual
Description: Several types of ON_Curve can have the form of a polyline including a degree 1 ON_NurbsCurve, an ON_PolylineCurve, and an ON_PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline. Parameters: pline_points - [out] if not nullptr and true is returned, then the points of the polyline form are returned here. t - [out] if not nullptr and true is returned, then the parameters of the polyline points are returned here. Returns: table 0 curve is not some form of a polyline >=2 number of points in polyline form
Reimplemented from ON_Curve.
◆ IsValid()
 bool ON_LineCurve::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Description: Tests an object to see if its data members are correctly initialized. Parameters: text_log - [in] if the object is not valid and text_log is not nullptr, then a brief englis description of the reason the object is not valid is appened to the log. The information appended to text_log is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Returns: table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Geometry.
◆ MakeDeformable()
 bool ON_LineCurve::MakeDeformable  |  ( |   | )
overridevirtual
virtual ON_Geometry::MakeDeformable() override
Reimplemented from ON_Geometry.
◆ operator=() [1/2]
 ON_LineCurve& ON_LineCurve::operator=  |  ( |  const ON_LineCurve &  |   | )
◆ operator=() [2/2]
 ON_LineCurve& ON_LineCurve::operator=  |  ( |  const ON_Line &  |   | )
◆ Read()
 bool ON_LineCurve::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::ReadObject(). Parameters: binary_archive - archive to read from Returns: Returns true if the read is successful. Remarks: Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Parameters
binary_archive | open binary file
Reimplemented from ON_Object.
◆ Reverse()
 bool ON_LineCurve::Reverse  |  ( |   | )
overridevirtual
reverse parameterizatrion
Implements ON_Curve.
◆ SetDomain()
 bool ON_LineCurve::SetDomain  |  ( |  double  |  t0,
|  double  |  t1
)
overridevirtual
Description: Set the domain of the curve Parameters: t0 - [in] t1 - [in] new domain will be [t0,t1] Returns: true if successful.
Reimplemented from ON_Curve.
◆ SetEndPoint()
 bool ON_LineCurve::SetEndPoint  |  ( |  ON_3dPoint  |  end_point | )
overridevirtual
Description: Force the curve to end at a specified point. Parameters: end_point - [in] Returns: true if successful. Remarks: Some end points cannot be moved. Be sure to check return code. See Also: ON_Curve::SetStartPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
Reimplemented from ON_Curve.
◆ SetStartPoint()
 bool ON_LineCurve::SetStartPoint  |  ( |  ON_3dPoint  |  start_point | )
overridevirtual
Description: Force the curve to start at a specified point. Parameters: start_point - [in] Returns: true if successful. Remarks: Some end points cannot be moved. Be sure to check return code. See Also: ON_Curve::SetEndPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
Reimplemented from ON_Curve.
◆ SizeOf()
 unsigned int ON_LineCurve::SizeOf  |  ( |   | ) |   const
overridevirtual
ON_Object overrides.
virtual ON_Object::SizeOf override
Reimplemented from ON_Curve.
◆ SpanCount()
 int ON_LineCurve::SpanCount  |  ( |   | ) |   const
overridevirtual
number of smooth spans in curve
Implements ON_Curve.
◆ Split()
 bool ON_LineCurve::Split  |  ( |  double  |  t,
|  ON_Curve *&  |  left_side,
|  ON_Curve *&  |  right_side
) |   |  const
overridevirtual
Description: virtual ON_Curve::Split override. Divide the curve at the specified parameter. The parameter must be in the interior of the curve's domain. The pointers passed to Split must either be nullptr or point to an ON_Curve object of the same of the same type. If the pointer is nullptr, then a curve will be created in Split(). You may pass "this" as one of the pointers to Split(). Parameters: t - [in] parameter in interval Domain(). left_side - [out] left portion of curve right_side - [out] right portion of curve Example: For example, if crv were an ON_NurbsCurve, then
ON_NurbsCurve right_side; crv.Split( crv.Domain().Mid() &crv, &right_side );
would split crv at the parametric midpoint, put the left side in crv, and return the right side in right_side.
Parameters
t | t = curve parameter to split curve at
left_side | left portion returned here
right_side | right portion returned here
Reimplemented from ON_Curve.
◆ SwapCoordinates()
 bool ON_LineCurve::SwapCoordinates  |  ( |  int  |  i,
|  int  |  j
)
overridevirtual
Description: Swaps object coordinate values with indices i and j.
Parameters: i - [in] coordinate index j - [in] coordinate index
Remarks: The default implementation uses the virtual Transform() function to calculate the result. If you are creating an object where Transform() is slow, coordinate swapping will be frequently used, and coordinate swapping can be quickly accomplished, then override this function.
Example:
     ON_Point point(7,8,9);
     point.SwapCoordinates(0,2);
     ///< point = (9,8,7)
Parameters
j | indices of coords to swap
Reimplemented from ON_Geometry.
◆ Transform()
 bool ON_LineCurve::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
Description: overrides virtual ON_Geometry::Transform(). ON_Curve::Transform() calls ON_Geometry::Transform(xform), which calls ON_Object::TransformUserData(xform), and then calls this->DestroyCurveTree(). Parameters: xform - [in] transformation to apply to object. Remarks: Classes derived from ON_Curve should call ON_Curve::Transform() to handle user data transformations and curve tree destruction and then transform their definition.
Reimplemented from ON_Curve.
◆ Trim()
 bool ON_LineCurve::Trim  |  ( |  const ON_Interval &  |  domain | )
overridevirtual
Description: virtual ON_Curve::Trim override. Removes portions of the curve outside the specified interval. Parameters: domain - [in] interval of the curve to keep. Portions of the curve before curve(domain[0]) and after curve(domain[1]) are removed. Returns: true if successful.
Reimplemented from ON_Curve.
◆ Write()
 bool ON_LineCurve::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::WriteObject(). Parameters: binary_archive - archive to write to Returns: Returns true if the write is successful. Remarks: Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
 The default implementation of this virtual function returns false and does nothing.
Parameters
binary_archive | open binary file
Reimplemented from ON_Object.
Member Data Documentation
◆ m_dim
 int ON_LineCurve::m_dim
2 or 3 (2 so ON_LineCurve can be uses as a trimming curve)
◆ m_line
 ON_Line ON_LineCurve::m_line
Interface.
◆ m_t
 ON_Interval ON_LineCurve::m_t
domain