openNURBS SDK Help 6.0
 Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_3dmNotes Class Reference
#include <opennurbs_3dm_properties.h>
 Public Member Functions
ON_3dmNotes ()
~ON_3dmNotes ()
void  | Dump (ON_TextLog &) const
bool  | IsEmpty () const
bool  | IsValid () const
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
bool  | m_bHTML
bool  | m_bVisible
ON_wString  | m_notes
int  | m_window_bottom
int  | m_window_left
last window position More...
int  | m_window_right
int  | m_window_top
 Static Public Attributes
static const ON_3dmNotes  | Empty
Constructor & Destructor Documentation
◆ ON_3dmNotes()
 ON_3dmNotes::ON_3dmNotes  |  ( |   | )
◆ ~ON_3dmNotes()
 ON_3dmNotes::~ON_3dmNotes  |  ( |   | )
Member Function Documentation
◆ Dump()
 void ON_3dmNotes::Dump  |  ( |  ON_TextLog &  |   | ) |   const
◆ IsEmpty()
 bool ON_3dmNotes::IsEmpty  |  ( |   | ) |   const
◆ IsValid()
 bool ON_3dmNotes::IsValid  |  ( |   | ) |   const
◆ Read()
 bool ON_3dmNotes::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_3dmNotes::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ Empty
 const ON_3dmNotes ON_3dmNotes::Empty
static
◆ m_bHTML
 bool ON_3dmNotes::m_bHTML
◆ m_bVisible
 bool ON_3dmNotes::m_bVisible
◆ m_notes
 ON_wString ON_3dmNotes::m_notes
◆ m_window_bottom
 int ON_3dmNotes::m_window_bottom
◆ m_window_left
 int ON_3dmNotes::m_window_left
last window position
◆ m_window_right
 int ON_3dmNotes::m_window_right
◆ m_window_top
 int ON_3dmNotes::m_window_top