openNURBS SDK Help 6.0
 Public Member Functions | Public Attributes | List of all members
ON_MappingChannel Class Reference
ON_3dmObjectAttributes uses ON_MappingChannel to record which texture mapping function to use when applying a texture with a matching mapping channel id. When an object is rendered, if the material has textures and ON_Texture::m_mapping_channel_id = ON_MappingChannel::m_mapping_channel_id, then the mapping with id m_mapping_id is used to map the texture. Otherwise, the mesh m_T[] texture coordinates are used to apply the texture. More...
#include <opennurbs_mapchan.h>
 Public Member Functions
ON_MappingChannel ()
int  | Compare (const ON_MappingChannel &other) const
void  | Default ()
bool  | Read (ON_BinaryArchive &archive)
bool  | Write (ON_BinaryArchive &archive) const
 Public Attributes
int  | m_mapping_channel_id
ON_UUID  | m_mapping_id
int  | m_mapping_index
ON_Xform  | m_object_xform
Detailed Description
ON_3dmObjectAttributes uses ON_MappingChannel to record which texture mapping function to use when applying a texture with a matching mapping channel id. When an object is rendered, if the material has textures and ON_Texture::m_mapping_channel_id = ON_MappingChannel::m_mapping_channel_id, then the mapping with id m_mapping_id is used to map the texture. Otherwise, the mesh m_T[] texture coordinates are used to apply the texture.
Constructor & Destructor Documentation
◆ ON_MappingChannel()
 ON_MappingChannel::ON_MappingChannel  |  ( |   | )
Member Function Documentation
◆ Compare()
 int ON_MappingChannel::Compare  |  ( |  const ON_MappingChannel &  |  other | ) |   const
◆ Default()
 void ON_MappingChannel::Default  |  ( |   | )
◆ Read()
 bool ON_MappingChannel::Read  |  ( |  ON_BinaryArchive &  |  archive | )
◆ Write()
 bool ON_MappingChannel::Write  |  ( |  ON_BinaryArchive &  |  archive | ) |   const
Member Data Documentation
◆ m_mapping_channel_id
 int ON_MappingChannel::m_mapping_channel_id
◆ m_mapping_id
 ON_UUID ON_MappingChannel::m_mapping_id
◆ m_mapping_index
 int ON_MappingChannel::m_mapping_index
◆ m_object_xform
 ON_Xform ON_MappingChannel::m_object_xform