openNURBS SDK Help 6.0
 Public Types | Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_InstanceDefinition Class Reference
An ON_InstanceDefinition defines the geometry used by instance references. More...
#include <opennurbs_instance.h>
 Inheritance diagram for ON_InstanceDefinition:
 Public Types
enum  | {
 no_idef_settings = 0, idef_name_setting = 1, idef_description_setting = 2, idef_url_setting = 4,
 idef_units_setting = 8, idef_source_archive_setting = 0x10, idef_userdata_setting = 0x20, all_idef_settings = 0xFFFFFFFF
 }
enum  | eLinkedComponentAppearance : unsigned char { eLinkedComponentAppearance::Unset = 0, eLinkedComponentAppearance::Active = 1, eLinkedComponentAppearance::Reference = 2 }
ON_InstanceDefinition::LinkedComponentStates specifies how model components (layers, materials, dimension styles, ...) from linked instance defintion files are appear in the active model. More...
enum  | IDEF_UPDATE_TYPE : unsigned int { IDEF_UPDATE_TYPE::Unset = 0, IDEF_UPDATE_TYPE::Static = 1, IDEF_UPDATE_TYPE::LinkedAndEmbedded = 2, IDEF_UPDATE_TYPE::Linked = 3 }
 Public Types inherited from ON_ModelComponent
enum  | Attributes : unsigned int {
 NoAttributes = 0U, ComponentSerialNumberAttribute = 0x0001U, TypeAttribute = 0x0002U, ModelSerialNumberAttribute = 0x0004U,
 IdAttribute = 0x0008U, IndexAttribute = 0x0010U, NameAttribute = 0x0020U, ParentIdAttribute = 0x0040U,
 DeletedNameAttribute = 0x0080U, ComponentStatusAttribute = 0x0100U, BinaryArchiveAttributes = 0x78U, AllAttributes = 0x1FFU,
 SystemComponentAttribute = 0x8000U
 }
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Image = 1, Type::TextureMapping = 2, Type::RenderMaterial = 3,
 Type::LinePattern = 4, Type::Layer = 5, Type::Group = 6, Type::TextStyle = 7,
 Type::DimStyle = 8, Type::RenderLight = 9, Type::HatchPattern = 10, Type::InstanceDefinition = 11,
 Type::ModelGeometry = 12, Type::HistoryRecord = 13, Type::Mixed = 0xFE
 }
The ON_ModelComponent::Type enum has a value for each explicit component type and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator instance to iterate over the ON_ModelComponent::Type values. More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
When a userdata item is copied or moved from a source object to a destination object, the ON_Object::UserDataConflictResolution enum values specify how conficts are resolved. Remark: A userdata item "conflict" occurs when both the destination and source object have a user data item with the same value of ON_UserData::m_userdata_uuid. More...
 Public Member Functions
ON_InstanceDefinition () ON_NOEXCEPT
ON_InstanceDefinition (const ON_InstanceDefinition &)
~ON_InstanceDefinition ()
bool  | AddInstanceGeometryId (ON_UUID id)
Add id to the InstanceGeometryIdList(). More...
const ON_BoundingBox  | BoundingBox () const
void  | ClearBoundingBox ()
void  | ClearInstanceGeometryIdList ()
Remove all ids from the InstanceGeometryIdList(). More...
void  | ClearLinkedFileContentHash ()
void  | ClearLinkedFileReference ()
Destroy all linked file path information and convert the type to Static. More...
void  | ClearLinkedFileRelativePath ()
void  | ClearLinkedIdefReferenceComponentSettings ()
const ON_SHA1_Hash  | ContentHash () const
const ON_wString  | Description () const
void  | Dump (ON_TextLog &text_log) const override
virtual ON_Object::Dump override More...
const ON_SHA1_Hash  | GeometryContentHash () const
bool  | HasLinkedIdefReferenceComponentSettings () const
ON_InstanceDefinition::IDEF_UPDATE_TYPE  | IdefUpdateType () const
OBSOLETE - change IdefUpdateType() to InstanceDefinitionType() More...
ON_InstanceDefinition::IDEF_UPDATE_TYPE  | InstanceDefinitionType () const
const ON_SimpleArray< ON_UUID > &  | InstanceGeometryIdList () const
bool  | IsInstanceGeometryId (ON_UUID id) const
bool  | IsLinkedType () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
Tests an object to see if its data members are correctly initialized. More...
ON_InstanceDefinition::eLinkedComponentAppearance  | LinkedComponentAppearance () const
const ON_wString &  | LinkedFilePath () const
const ON_FileReference  | LinkedFileReference () const
const ON_ReferencedComponentSettings *  | LinkedIdefReferenceComponentSettings () const
ON_ReferencedComponentSettings *  | LinkedIdefReferenceComponentSettings (bool bCreateIfNonePresent)
ON::object_type  | ObjectType () const override
Useful for switch statements that need to differentiate between basic object types like points, curves, surfaces, and so on. More...
ON_InstanceDefinition &  | operator= (const ON_InstanceDefinition &)
bool  | Read (ON_BinaryArchive &archive) override
Low level archive writing tool used by ON_BinaryArchive::ReadObject(). More...
bool  | RemoveInstanceGeometryId (ON_UUID id)
Remove id from the InstanceGeometryIdList(). More...
bool  | RemoveInstanceGeometryId (int id_index)
Remove InstanceGeometryIdList()[id_index] from the InstanceGeometryIdList() array. More...
void  | SetBoundingBox (ON_BoundingBox bbox)
void  | SetDescription (const wchar_t *description)
bool  | SetInstanceDefinitionType (const ON_InstanceDefinition::IDEF_UPDATE_TYPE instance_definition_type)
void  | SetInstanceGeometryIdList (const ON_SimpleArray< ON_UUID > &instance_geometry_id_list)
bool  | SetLinkedComponentAppearance (ON_InstanceDefinition::eLinkedComponentAppearance linked_component_appearance)
bool  | SetLinkedFileReference (ON_InstanceDefinition::IDEF_UPDATE_TYPE linked_definition_type, ON_FileReference linked_file_reference)
bool  | SetLinkedFileReference (ON_InstanceDefinition::IDEF_UPDATE_TYPE linked_definition_type, const wchar_t *linked_file_full_path)
void  | SetSkipNestedLinkedDefinitions (bool bSkipNestedLinkedDefinitions)
void  | SetUnitSystem (ON::LengthUnitSystem us)
Sets m_us and m_unit_scale. More...
void  | SetUnitSystem (const ON_UnitSystem &us)
void  | SetURL (const wchar_t *url)
void  | SetURL_Tag (const wchar_t *url_tag)
unsigned int  | SizeOf () const override
virtual ON_Object:: override More...
bool  | SkipNestedLinkedDefinitions () const
This property applies when an instance definiton is linked. More...
const ON_UnitSystem &  | UnitSystem () const
const ON_wString  | URL () const
const ON_wString  | URL_Tag () const
bool  | Write (ON_BinaryArchive &archive) const override
Low level archive writing tool used by ON_BinaryArchive::WriteObject(). More...
 Public Member Functions inherited from ON_ModelComponent
ON_ModelComponent () ON_NOEXCEPT
ON_ModelComponent (const ON_ModelComponent &source)
ON_ModelComponent (ON_ModelComponent::Type component_type) ON_NOEXCEPT
Sets and locks the component type attribute. More...
ON_ModelComponent (ON_ModelComponent::Type component_type, const ON_ModelComponent &source) ON_NOEXCEPT
Locked status of source attributes is not copied to permit copy and modify operations. More...
~ON_ModelComponent ()=default
bool  | ChangeName (const wchar_t *new_name, class ON_ComponentManifest *manifest)
Change the name of a component and optionally update a manifest. More...
bool  | ClearComponentType ()
Set the model serial number value to the ON_ModelComponent::Unset.Type() and change the state so TypeIsSet() returns false. More...
bool  | ClearId ()
Set the component id value to the ON_ModelComponent::Unset.ModelComponentId() and change the state so ModelComponentIdIsSet() returns false. More...
bool  | ClearIndex ()
Set the component index value to the ON_ModelComponent::Unset.ModelComponentIndex() and change the state so ModelComponentIndexIsSet() returns false. More...
unsigned int  | ClearModelComponentAttributes (unsigned int attributes_filter)
Writes the attributes identified by the component_filter parameter. More...
bool  | ClearModelComponentStatus ()
bool  | ClearModelSerialNumber ()
Sets the model serial number, reference model serial number and instance definition model serial number values to 0 and flags these values as unset. More...
bool  | ClearName ()
Set the component name value to the ON_ModelComponent::Unset.Name() and change the state so NameIsSet() and DeletedNameIsSet() both return false. More...
bool  | ClearParentId ()
int  | CompareName (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareName (const wchar_t *other_name) const
int  | CompareNameExact (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareNameExact (const wchar_t *other_name) const
ON_ModelComponent::Type  | ComponentType () const
bool  | ComponentTypeIsLocked () const
bool  | ComponentTypeIsSet () const
ON__UINT64  | ContentVersionNumber () const
Whenever an attribute is changed, the content version number is incremented. The ContentVersionNumber() is commonly used by consumers of the model component attributes to trigger updates when needed. More...
unsigned int  | CopyFrom (const ON_ModelComponent &src, unsigned int attributes_filter)
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
Returns a CRC calculated from the information that defines the object. This CRC can be used as a quick way to see if two objects are not identical. More...
const ON_wString  | DeletedName () const
const ON_NameHash &  | DeletedNameHash () const
bool  | DeletedNameIsSet () const
bool  | DeleteName ()
If NameIsSet() is true, then the name is deleted in a waty that can be undone by calling UndeleteName() and the DeletedNameIsSet() property is changed to true. More...
void  | Dump (ON_TextLog &) const override
Creates a text dump of the object. More...
bool  | EraseIdentification (bool bIgnoreLocks)
const wchar_t *  | GetName (ON_wString &component_name) const
const ON_UUID &  | Id () const
bool  | IdIsLocked () const
bool  | IdIsNil () const
bool  | IdIsNotNil () const
bool  | IdIsSet () const
const ON_UUID &  | IfIdIsNilSetId ()
If the it is nil, call SetId(). More...
int  | Index () const
int  | Index (int unset_index_value) const
bool  | IndexIsLocked () const
bool  | IndexIsSet () const
unsigned int  | InstanceDefinitionModelSerialNumber () const
bool  | IsDeleted () const
bool  | IsHidden () const
bool  | IsLocked () const
bool  | IsReferenceComponent () const
bool  | IsSystemComponent () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
Tests an object to see if its data members are correctly initialized. More...
void  | LockAllSettingsExceptName ()
void  | LockComponentType ()
Calling LockType() will prhibit future changes to the Type attribute. More...
void  | LockId ()
Calling LockModelComponentId() will prhibit future changes to the ModelComponentId attribute. More...
void  | LockIndex ()
Calling LockModelComponentIndex() will prhibit future changes to the ModelComponentIndex attribute. More...
void  | LockModelComponentStatus ()
void  | LockModelSerialNumber ()
Calling LockModelSerialNumber() will prohibit future changes to the ModelSerialNumber(), ReferenceModelSerialNumber(), and InstanceDefinitionModelSerialNumber() attributes. More...
void  | LockName ()
Calling LockName() will prohibit future changes to the Name attribute. More...
void  | LockParentId ()
ON_ComponentStatus  | ModelComponentStatus () const
bool  | ModelComponentStatusIsLocked () const
bool  | ModelComponentStatusIsSet () const
ON_UUID  | ModelObjectId () const override
All objects in an opennurbs model have an id ( ON_Layer.m_layer_id, ON_Font.m_font_id, ON_Material.m_material_id, ON_3dmObjectAttributes.m_uuid ). More...
unsigned int  | ModelSerialNumber () const
bool  | ModelSerialNumberIsLocked () const
bool  | ModelSerialNumberIsSet () const
const ON_wString  | Name () const
const wchar_t *  | NameAsPointer () const
Expert user function that gets a pointer to the name. More...
const ON_NameHash &  | NameHash () const
Get a platform independent hash of the name suitable for equality testing and binary searching. When testing for equality or doing binary searches, using ON_NameHash values is faster than using the CompareName or ON_wString::CompareAttributeName. More...
bool  | NameIsEmpty () const
bool  | NameIsLocked () const
bool  | NameIsNotEmpty () const
bool  | NameIsSet () const
const ON_NameHash  | NewNameHash (const wchar_t *new_name) const
ON_ModelComponent &  | operator= (const ON_ModelComponent &source)
const ON_UUID &  | ParentId () const
bool  | ParentIdIsLocked () const
bool  | ParentIdIsNil () const
bool  | ParentIdIsNotNil () const
bool  | ParentIdIsSet () const
bool  | ReadModelComponentAttributes (class ON_BinaryArchive &archive)
unsigned int  | ReferenceModelSerialNumber () const
ON__UINT64  | RuntimeSerialNumber () const
const ON_UUID &  | SetAndLockId ()
Sets the id to a new value created by ON_CreateUuid() and locks the id attribute so it cannot be changed. More...
bool  | SetAsSystemComponent ()
bool  | SetAsUnsetSystemComponent ()
bool  | SetComponentType (ON_ModelComponent::Type component_component_type)
bool  | SetDeletedModelComponentState (bool bDeleted, class ON_ComponentManifest *manifest)
void  | SetHiddenModelComponentState (bool bHidden)
bool  | SetId (const ON_UUID &component_id)
const ON_UUID &  | SetId ()
Sets the id to a new value created by ON_CreateUuid(). More...
bool  | SetIdentification (const class ON_ComponentManifestItem &manifest_item, const wchar_t *manifest_name, bool bSetId, bool bParentId, bool bSetName, bool bSetIndex)
Set a component's id, name and index to the manifest_item values. More...
bool  | SetIndex (int component_index)
bool  | SetLocalizedSystemComponentName (const wchar_t *system_component_localized_name)
void  | SetLockedModelComponentState (bool bLocked)
bool  | SetModelComponentStatus (ON_ComponentStatus component_status)
bool  | SetModelSerialNumber (unsigned int model_serial_number)
Specify the model that is managing this component. More...
bool  | SetModelSerialNumber (unsigned int model_serial_number, unsigned int reference_model_serial_number, unsigned int instance_definition_model_serial_number)
Specify the model that is managing this component. More...
bool  | SetName (const wchar_t *component_name)
bool  | SetParentId (const ON_UUID &parent_id)
unsigned int  | SizeOf () const override
bool  | UndeleteName ()
bool  | WriteModelComponentAttributes (class ON_BinaryArchive &archive, unsigned int attributes_filter) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
bool  | AttachUserData (class ON_UserData *pUserData)
Attach user data to an object. More...
unsigned int  | ClearAllComponentStates () const
Set all active level component states to ON_ComponentStatus::NoneSet. More...
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
Clear the specified states on every component. More...
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
Clear states on an individual component. More...
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
Expert user tool that copies user data items with positive values of ON_UserData.m_userdata_copycount from source_object to "this. More...
void  | CopyUserData (const ON_Object &source_object)
Calls CopyUserData(source_object,ON_Object::UserDataConflictResolution::source_object). More...
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
Delete the portions of the object identified in ci_list[]. More...
virtual void  | DestroyRuntimeCache (bool bDelete=true)
Expert user function. If you are using openNURBS in its default configuration to read and write 3dm archives, you never need to call this function. Many objects employ lazy creation of (runtime) caches that save information to help speed geometric calculations. This function will destroy all runtime information. More...
bool  | DetachUserData (class ON_UserData *pUserData)
Remove user data from an object. More...
void  | EmergencyDestroy ()
Sets m_user_data_list = 0. More...
class ON_UserData *  | FirstUserData () const
User data is stored as a linked list of ON_UserData classes. FirstUserData gets the first item in the linked list. This is the most recent item attached using AttachUserData(). Remark: To iterate through all the user data on an object, call FirstUserData() and then use ON_UserData::Next() to traverse the list. More...
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
Get a pointer to user data. More...
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
Get user string from the object. More...
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
Get a list of all user string keys on the object. More...
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
Get a list of all user strings on the object. More...
bool  | IsKindOf (const ON_ClassId *pClassId) const
Low level tool to test if an object is derived from a specified class. More...
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
virtual void  | MemoryRelocate ()
The MemoryRelocate() function is called when an object's location in memory is changed. For example, if an object resides in a chunk of memory that is grown by calling a realloc that has to allocate a new chunk and copy the contents of the old chunk to the new chunk, then the location of the object's memory changes. In practice this happens when classes derived from ON_Object are stored in dynamic arrays, like the default implementation of ON_ObjectArray<>'s that use realloc to grow the dynamic array. More...
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
Expert user tool that moves user data items from source_object to "this. More...
void  | MoveUserData (ON_Object &source_object)
Calls MoveUserData(source_object,ON_Object::UserDataConflictResolution::source_object,true). More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
PurgeUserData() removes all user data from object. More...
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
Set states on an individual component. More...
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
Copy status settings to an individual component. More...
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
Attach a user string to the object. This information will perisist through copy construction, operator=, and file IO. More...
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
Append entries to the user string list More...
void  | TransformUserData (const class ON_Xform &xform)
Objects derived from ON_Geometry must call TransformUserData() in their Transform() member function. More...
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. More...
int  | UserStringCount () const
 Static Public Member Functions
static const ON_InstanceDefinition *  | FromModelComponentRef (const class ON_ModelComponentReference &model_component_reference, const ON_InstanceDefinition *none_return_value)
static ON_InstanceDefinition::IDEF_UPDATE_TYPE  | InstanceDefinitionTypeFromUnsigned (unsigned int idef_type_as_unsigned)
Converts and integer into an IDEF_UPDATE_TYPE enum. More...
static ON_InstanceDefinition::eLinkedComponentAppearance  | LinkedComponentAppearanceFromUnsigned (unsigned int linked_component_appearance_as_unsigned)
 Static Public Member Functions inherited from ON_ModelComponent
static int  | CompareId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareIdAndName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameAndId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameExact (const ON_ModelComponent &a, const ON_ModelComponent &b)
static ON_ModelComponent::Type  | ComponentTypeFromUnsigned (unsigned int component_type_as_unsigned)
static bool  | ComponentTypeIsValid (ON_ModelComponent::Type component_type)
static bool  | ComponentTypeIsValidAndNotMixed (ON_ModelComponent::Type component_type)
static const ON_wString  | ComponentTypeToString (ON_ModelComponent::Type)
static bool  | IndexRequired (ON_ModelComponent::Type component_type)
static unsigned int  | Internal_SystemComponentHelper ()
For internal use. Never call this function. More...
static const wchar_t *  | IsNamePathSeparator (const wchar_t *s)
Test a string to see if its beginning matches the string returned by ON_ModelComponent::NamePathSeparator. More...
*</code > *</example > *static const wchar_t *  | IsReferencePrefixDelimiter (const wchar_t *s)
Test a string to see if its beginning matches the string returned by ON_ModelComponent::NameReferenceDelimiter. More...
static const wchar_t *  | IsReferencePrefixSeparator (const wchar_t *s)
Test a string to see if its beginning matches the string returned by ON_ModelComponent::NameReferenceSeparator. More...
static bool  | IsValidComponentName (const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (const ON_wString &candidate_component_name)
static bool  | IsValidComponentName (size_t length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (const class ON_ComponentManifest &model_manfest, const ON_ModelComponent &model_component, bool bPermitReferencePrefix, ON_wString &valid_name)
static bool  | IsValidComponentNameFirstCodePoint (ON__UINT32 unicode_code_point)
static bool  | IsValidComponentNameFirstCodePoint (int length, const wchar_t *candidate_component_name)
static const ON_wString  | NameLeaf (const wchar_t *name)
static const ON_wString  | NameParent (const wchar_t *name, bool bIncludeReference)
static const ON_wString  | NameReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveAllReferencePrefixDelimiters (const wchar_t *name)
Remove all occurances of ON::NameReferenceDelimiter() from name. More...
static const ON_wString  | RemoveReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveTrailingNamePathSeparator (const wchar_t *name)
Remove any trailing occurance of ON_ModelComponent::NamePathSeparator from name. More...
static const ON_wString  | RemoveTrailingReferencePrefixDelimiter (const wchar_t *name)
Remove any trailing occurance of ON_ModelComponent::NameReferenceDelimiter from name. More...
static const ON_wString  | RemoveTrailingReferencePrefixSeparator (const wchar_t *name)
Remove any trailing occurance of ON_ModelComponent::NameReferenceSeparator from name. More...
static void  | SplitName (const wchar_t *name, ON_wString &reference_prefix, ON_wString &name_parent, ON_wString &name_leaf)
static bool  | UniqueNameIgnoresCase (ON_ModelComponent::Type component_type)
static bool  | UniqueNameIncludesParent (ON_ModelComponent::Type component_type)
static bool  | UniqueNameRequired (ON_ModelComponent::Type component_type)
 Static Public Attributes
static const ON_InstanceDefinition  | Unset
 Static Public Attributes inherited from ON_ModelComponent
static const ON_wString  | NamePathSeparator
Returns the string "::". This is the string Rhino uses in layer full path names to separate the names of individual layers. More...
static const ON_wString  | ReferencePrefixDelimiter
Returns the string " : ". This is the string Rhino uses to separate the reference file names from and model component names read from those files. More...
static const ON_wString  | ReferencePrefixSeparator
Returns the string ">". This is the string Rhino uses to separate the block definition name and linked file name in grandparent layers. More...
static const ON_ModelComponent  | Unset
*static const ON_wString WorksessionReferencePrefix *const  | wchar_t
 Additional Inherited Members
 Protected Member Functions inherited from ON_ModelComponent
void  | IncrementContentVersionNumber () const
Detailed Description
An ON_InstanceDefinition defines the geometry used by instance references.
See also
ON_InstanceRef
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
no_idef_settings
idef_name_setting
idef_description_setting
idef_url_setting
idef_units_setting
idef_source_archive_setting
idef_userdata_setting
all_idef_settings
◆ eLinkedComponentAppearance
 enum ON_InstanceDefinition::eLinkedComponentAppearance : unsigned char
strong
ON_InstanceDefinition::LinkedComponentStates specifies how model components (layers, materials, dimension styles, ...) from linked instance defintion files are appear in the active model.
Enumerator
Unset
This is the only valid layer style when the instance definition type is ON_InstanceDefinition::IDEF_UPDATE_TYPE::Static or ON_InstanceDefinition::IDEF_UPDATE_TYPE::LinkedAndEmbedded. This style is not valid when the instance definition type ON_InstanceDefinition::IDEF_UPDATE_TYPE::Linked.
Active
Model components (layers, materials, dimension styles, ...) from linked instance definition files are embedded as ordinary components in the active model. This layer style may be used when the instance definition type is ON_InstanceDefinition::IDEF_UPDATE_TYPE::Linked.
Reference
Layers from the linked instance definition are reference components in the model. This is the default layer style when the instance definition type is ON_InstanceDefinition::IDEF_UPDATE_TYPE::Linked. This layer style may be used when the instance definition type is ON_InstanceDefinition::IDEF_UPDATE_TYPE::Linked.
◆ IDEF_UPDATE_TYPE
 enum ON_InstanceDefinition::IDEF_UPDATE_TYPE : unsigned int
strong
Enumerator
Unset
Static
LinkedAndEmbedded
Linked
Constructor & Destructor Documentation
◆ ON_InstanceDefinition() [1/2]
 ON_InstanceDefinition::ON_InstanceDefinition  |  ( |   | )
◆ ~ON_InstanceDefinition()
 ON_InstanceDefinition::~ON_InstanceDefinition  |  ( |   | )
◆ ON_InstanceDefinition() [2/2]
 ON_InstanceDefinition::ON_InstanceDefinition  |  ( |  const ON_InstanceDefinition &  |   | )
Member Function Documentation
◆ AddInstanceGeometryId()
 bool ON_InstanceDefinition::AddInstanceGeometryId  |  ( |  ON_UUID  |  id | )
Add id to the InstanceGeometryIdList().
Parameters
id | [in]
non | nil id to add.
Returns
True if id is not nil and was added to the InstanceGeometryIdList().
◆ BoundingBox()
 const ON_BoundingBox ON_InstanceDefinition::BoundingBox  |  ( |   | ) |   const
◆ ClearBoundingBox()
 void ON_InstanceDefinition::ClearBoundingBox  |  ( |   | )
◆ ClearInstanceGeometryIdList()
 void ON_InstanceDefinition::ClearInstanceGeometryIdList  |  ( |   | )
Remove all ids from the InstanceGeometryIdList().
◆ ClearLinkedFileContentHash()
 void ON_InstanceDefinition::ClearLinkedFileContentHash  |  ( |   | )
◆ ClearLinkedFileReference()
 void ON_InstanceDefinition::ClearLinkedFileReference  |  ( |   | )
Destroy all linked file path information and convert the type to Static.
◆ ClearLinkedFileRelativePath()
 void ON_InstanceDefinition::ClearLinkedFileRelativePath  |  ( |   | )
◆ ClearLinkedIdefReferenceComponentSettings()
 void ON_InstanceDefinition::ClearLinkedIdefReferenceComponentSettings  |  ( |   | )
◆ ContentHash()
 const ON_SHA1_Hash ON_InstanceDefinition::ContentHash  |  ( |   | ) |   const
Returns
A SHA-1 hash of these instance defintions properties Description() URL() URL_Tag() and all the properties that contribute to the GeometryContentHash().
◆ Description()
 const ON_wString ON_InstanceDefinition::Description  |  ( |   | ) |   const
◆ Dump()
 void ON_InstanceDefinition::Dump  |  ( |  ON_TextLog &  |  text_log | ) |   const
overridevirtual
virtual ON_Object::Dump override
Reimplemented from ON_Object.
◆ FromModelComponentRef()
 static const ON_InstanceDefinition* ON_InstanceDefinition::FromModelComponentRef  |  ( |  const class ON_ModelComponentReference &  |  model_component_reference,
|  const ON_InstanceDefinition *  |  none_return_value
)
static
Parameters
model_component_reference | [in]
none_return_value | [in] value to return if ON_InstanceDefinition::Cast(model_component_ref.ModelComponent()) is nullptr
Returns
If ON_InstanceDefinition::Cast(model_component_ref.ModelComponent()) is not nullptr, that pointer is returned. Otherwise, none_return_value is returned.
◆ GeometryContentHash()
 const ON_SHA1_Hash ON_InstanceDefinition::GeometryContentHash  |  ( |   | ) |   const
Returns
A SHA-1 hash of these instance defintions properties:
InstanceGeometryIdList() BoundingBox() UnitSystem() InstanceDefinitionType() LinkedFileReference() LinkedComponentAppearance()
◆ HasLinkedIdefReferenceComponentSettings()
 bool ON_InstanceDefinition::HasLinkedIdefReferenceComponentSettings  |  ( |   | ) |   const
Returns
True if this is a linked instance definition with layer settings information.
◆ IdefUpdateType()
 ON_InstanceDefinition::IDEF_UPDATE_TYPE ON_InstanceDefinition::IdefUpdateType  |  ( |   | ) |   const
OBSOLETE - change IdefUpdateType() to InstanceDefinitionType()
◆ InstanceDefinitionType()
 ON_InstanceDefinition::IDEF_UPDATE_TYPE ON_InstanceDefinition::InstanceDefinitionType  |  ( |   | ) |   const
◆ InstanceDefinitionTypeFromUnsigned()
 static ON_InstanceDefinition::IDEF_UPDATE_TYPE ON_InstanceDefinition::InstanceDefinitionTypeFromUnsigned  |  ( |  unsigned int  |  idef_type_as_unsigned | )
static
Converts and integer into an IDEF_UPDATE_TYPE enum.
◆ InstanceGeometryIdList()
 const ON_SimpleArray<ON_UUID>& ON_InstanceDefinition::InstanceGeometryIdList  |  ( |   | ) |   const
Returns
A list of object ids in the instance geometry table sorted by id.
◆ IsInstanceGeometryId()
 bool ON_InstanceDefinition::IsInstanceGeometryId  |  ( |  ON_UUID  |  id | ) |   const
Returns
True if id is in the InstanceGeometryIdList().
◆ IsLinkedType()
 bool ON_InstanceDefinition::IsLinkedType  |  ( |   | ) |   const
Returns
true if InstanceDefinitionType() = ON_InstanceDefinition::IDEF_UPDATE_TYPE::Linked or ON_InstanceDefinition::IDEF_UPDATE_TYPE::LinkedAndEmbedded.
◆ IsValid()
 bool ON_InstanceDefinition::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Tests an object to see if its data members are correctly initialized.
Parameters
text_log | [in] if the object is not valid and text_log is not nullptr, then a brief englis description of the reason the object is not valid is appened to the log. The information appended to text_log is suitable for
low | level debugging purposes by programmers and is not intended to be useful as a high level user interface tool.
Returns
table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Object.
◆ LinkedComponentAppearance()
 ON_InstanceDefinition::eLinkedComponentAppearance ON_InstanceDefinition::LinkedComponentAppearance  |  ( |   | ) |   const
◆ LinkedComponentAppearanceFromUnsigned()
 static ON_InstanceDefinition::eLinkedComponentAppearance ON_InstanceDefinition::LinkedComponentAppearanceFromUnsigned  |  ( |  unsigned int  |  linked_component_appearance_as_unsigned | )
static
◆ LinkedFilePath()
 const ON_wString& ON_InstanceDefinition::LinkedFilePath  |  ( |   | ) |   const
◆ LinkedFileReference()
 const ON_FileReference ON_InstanceDefinition::LinkedFileReference  |  ( |   | ) |   const
◆ LinkedIdefReferenceComponentSettings() [1/2]
 const ON_ReferencedComponentSettings* ON_InstanceDefinition::LinkedIdefReferenceComponentSettings  |  ( |   | ) |   const
Parameters
bCreateIfNonePresent | [in] When bCreateIfNonePresent is true and the idef type is ON_InstanceDefinition::IDEF_UPDATE_TYPE::Linked, then ON_ReferencedComponentSettings will be created if none are present. Return: ON_ReferencedComponentSettings pointer or nullptr.
◆ LinkedIdefReferenceComponentSettings() [2/2]
 ON_ReferencedComponentSettings* ON_InstanceDefinition::LinkedIdefReferenceComponentSettings  |  ( |  bool  |  bCreateIfNonePresent | )
Parameters
bCreateIfNonePresent | [in] When bCreateIfNonePresent is true and the idef type is ON_InstanceDefinition::IDEF_UPDATE_TYPE::Linked, then ON_ReferencedComponentSettings will be created if none are present. Return: ON_ReferencedComponentSettings pointer or nullptr.
◆ ObjectType()
 ON::object_type ON_InstanceDefinition::ObjectType  |  ( |   | ) |   const
overridevirtual
Useful for switch statements that need to differentiate between basic object types like points, curves, surfaces, and so on.
Returns
ON::object_type enum value.
The default implementation of this virtual function returns ON::unknown_object_type
Reimplemented from ON_Object.
◆ operator=()
 ON_InstanceDefinition& ON_InstanceDefinition::operator=  |  ( |  const ON_InstanceDefinition &  |   | )
◆ Read()
 bool ON_InstanceDefinition::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::ReadObject().
Parameters
binary_archive | archive to read from
Returns
Returns true if the read is successful.
Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ RemoveInstanceGeometryId() [1/2]
 bool ON_InstanceDefinition::RemoveInstanceGeometryId  |  ( |  ON_UUID  |  id | )
Remove id from the InstanceGeometryIdList().
◆ RemoveInstanceGeometryId() [2/2]
 bool ON_InstanceDefinition::RemoveInstanceGeometryId  |  ( |  int  |  id_index | )
Remove InstanceGeometryIdList()[id_index] from the InstanceGeometryIdList() array.
◆ SetBoundingBox()
 void ON_InstanceDefinition::SetBoundingBox  |  ( |  ON_BoundingBox  |  bbox | )
◆ SetDescription()
 void ON_InstanceDefinition::SetDescription  |  ( |  const wchar_t *  |  description | )
◆ SetInstanceDefinitionType()
 bool ON_InstanceDefinition::SetInstanceDefinitionType  |  ( |  const ON_InstanceDefinition::IDEF_UPDATE_TYPE  |  instance_definition_type | )
Parameters
instance_definition_type | [in] ON_InstanceDefinition::IDEF_UPDATE_TYPE::Unset - change the type to Unset and remove all linked file information. ON_InstanceDefinition::IDEF_UPDATE_TYPE::Static - change the type to Static and remove all linked file information. ON_InstanceDefinition::IDEF_UPDATE_TYPE::LinkedAndEmbedded - change the type to from Linked to LinkedAndEmbedded. If the current type is not Linked, then no changes are made. ON_InstanceDefinition::IDEF_UPDATE_TYPE::Linked - change the type to from LinkedAndEmbedded to Linked. If the current type is not LinkedAndEmbedded, then no changes are made.
◆ SetInstanceGeometryIdList()
 void ON_InstanceDefinition::SetInstanceGeometryIdList  |  ( |  const ON_SimpleArray< ON_UUID > &  |  instance_geometry_id_list | )
Parameters
instance_geometry_id_list | [in] A list of object ids in the instance geometry table.
◆ SetLinkedComponentAppearance()
 bool ON_InstanceDefinition::SetLinkedComponentAppearance  |  ( |  ON_InstanceDefinition::eLinkedComponentAppearance  |  linked_component_appearance | )
◆ SetLinkedFileReference() [1/2]
 bool ON_InstanceDefinition::SetLinkedFileReference  |  ( |  ON_InstanceDefinition::IDEF_UPDATE_TYPE  |  linked_definition_type,
|  ON_FileReference  |  linked_file_reference
)
Parameters
linked_definition_type | [in] Either ON_InstanceDefinition::IDEF_UPDATE_TYPE::LinkedAndEmbedded or ON_InstanceDefinition::IDEF_UPDATE_TYPE::Linked.
linked_file_reference | [in]
◆ SetLinkedFileReference() [2/2]
 bool ON_InstanceDefinition::SetLinkedFileReference  |  ( |  ON_InstanceDefinition::IDEF_UPDATE_TYPE  |  linked_definition_type,
|  const wchar_t *  |  linked_file_full_path
)
◆ SetSkipNestedLinkedDefinitions()
 void ON_InstanceDefinition::SetSkipNestedLinkedDefinitions  |  ( |  bool  |  bSkipNestedLinkedDefinitions | )
◆ SetUnitSystem() [1/2]
 void ON_InstanceDefinition::SetUnitSystem  |  ( |  ON::LengthUnitSystem  |  us | )
Sets m_us and m_unit_scale.
◆ SetUnitSystem() [2/2]
 void ON_InstanceDefinition::SetUnitSystem  |  ( |  const ON_UnitSystem &  |  us | )
◆ SetURL()
 void ON_InstanceDefinition::SetURL  |  ( |  const wchar_t *  |  url | )
◆ SetURL_Tag()
 void ON_InstanceDefinition::SetURL_Tag  |  ( |  const wchar_t *  |  url_tag | )
◆ SizeOf()
 unsigned int ON_InstanceDefinition::SizeOf  |  ( |   | ) |   const
overridevirtual
virtual ON_Object:: override
Reimplemented from ON_Object.
◆ SkipNestedLinkedDefinitions()
 bool ON_InstanceDefinition::SkipNestedLinkedDefinitions  |  ( |   | ) |   const
This property applies when an instance definiton is linked.
Returns
true: When reading the file that defines the content of the linked instance definition, skip any linked instance definitions found in that file. false: When reading the file that defines the content of the linked instance definition, recursively load linked instance definitions found in that file.
◆ UnitSystem()
 const ON_UnitSystem& ON_InstanceDefinition::UnitSystem  |  ( |   | ) |   const
◆ URL()
 const ON_wString ON_InstanceDefinition::URL  |  ( |   | ) |   const
◆ URL_Tag()
 const ON_wString ON_InstanceDefinition::URL_Tag  |  ( |   | ) |   const
◆ Write()
 bool ON_InstanceDefinition::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::WriteObject().
Parameters
binary_archive | archive to write to
Returns
Returns true if the write is successful.
Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
Member Data Documentation
◆ Unset
 const ON_InstanceDefinition ON_InstanceDefinition::Unset
static