openNURBS SDK Help 6.0
 Public Member Functions | Public Attributes | List of all members
ON_MorphControl Class Reference
#include <opennurbs_nurbssurface.h>
 Inheritance diagram for ON_MorphControl:
 Public Member Functions
ON_MorphControl ()
virtual  | ~ON_MorphControl ()
bool  | AddBoxLocalizer (ON_BoundingBox bbox, double support_distance, double falloff_distance)
bool  | AddControlLocalizer (double support_distance, double falloff_distance)
Adds localizer with support near the controling NURBS object. More...
bool  | AddConvexPolygonLocalizer (const ON_SimpleArray< ON_Plane > &planes, double support_distance, double falloff_distance)
bool  | AddCylinderLocalizer (ON_Line axis, double support_distance, double falloff_distance)
bool  | AddPlaneLocalizer (const ON_Plane &plane, double support_distance, double falloff_distance)
bool  | AddSphereLocalizer (ON_3dPoint center, double support_distance, double falloff_distance)
ON_Brep *  | BrepForm (ON_Brep *brep=nullptr) const override
If possible, BrepForm() creates a brep form of the ON_Geometry. More...
void  | ClearBoundingBox () override
Some objects cache bounding box information. If you modify an object, then call ClearBoundingBox() to inform the object that any cached bounding boxes are invalid. More...
const double *  | CV (ON_3dex) const
int  | CVCount () const
int  | CVCount (int dir) const
void  | Destroy ()
C++ default copy construction and operator= work fine. More...
void  | DestroyRuntimeCache (bool bDelete=true) override
Expert user function. If you are using openNURBS in its default configuration to read and write 3dm archives, you never need to call this function. Many objects employ lazy creation of (runtime) caches that save information to help speed geometric calculations. This function will destroy all runtime information. More...
int  | Dimension () const override
Dimension of the object. More...
void  | Dump (ON_TextLog &) const override
Creates a text dump of the object. More...
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetCageMorph (class ON_CageMorph &cage_morph) const
Get a cage_morph that can be passed to Morph functions. More...
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override More...
bool  | HasBrepForm () const override
Query an object to see if it has an ON_Brep form. Result: Returns true if the virtual ON_Geometry::BrepForm can compute an ON_Brep representation of this object. More...
bool  | IsIdentity (const ON_BoundingBox &bbox) const
bool  | IsRational () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
Tests an object to see if its data members are correctly initialized. More...
const double *  | Knot (int dir) const
bool  | MakeNonRational ()
Makes the target NURBS object non-rational. More...
bool  | MakeRational ()
Makes the target NURBS object rational. More...
ON_3dex  | MaxCVIndex () const
void  | MemoryRelocate () override
The MemoryRelocate() function is called when an object's location in memory is changed. For example, if an object resides in a chunk of memory that is grown by calling a realloc that has to allocate a new chunk and copy the contents of the old chunk to the new chunk, then the location of the object's memory changes. In practice this happens when classes derived from ON_Object are stored in dynamic arrays, like the default implementation of ON_ObjectArray<>'s that use realloc to grow the dynamic array. More...
ON::object_type  | ObjectType () const override
Useful for switch statements that need to differentiate between basic object types like points, curves, surfaces, and so on. More...
int  | Order (int dir) const
bool  | Read (ON_BinaryArchive &archive) override
Low level archive writing tool used by ON_BinaryArchive::ReadObject(). More...
unsigned int  | SizeOf () const override
bool  | Transform (const ON_Xform &xform) override
Transforms the object. More...
double  | Weight (ON_3dex) const
bool  | Write (ON_BinaryArchive &archive) const override
Low level archive writing tool used by ON_BinaryArchive::WriteObject(). More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
Get object's 3d axis aligned bounding box. More...
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
If this piece of geometry is a component in something larger, like an ON_BrepEdge in an ON_Brep, then this function returns the component index. More...
virtual bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const
Evaluate the location of a point from the object reference. More...
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
Get object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
Get corners of object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
virtual bool  | IsDeformable () const
virtual bool  | MakeDeformable ()
If possible, converts the object into a form that can be accuratly modified with "squishy" transformations like projections, shears, an non-uniform scaling. More...
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Scale (double scale_factor)
Scales the object by the specified facotor. The scale is centered at the origin. More...
virtual bool  | SwapCoordinates (int i, int j)
Swaps object coordinate values with indices i and j. More...
bool  | Translate (const ON_3dVector &translation_vector)
Translates the object along the specified vector. More...
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
bool  | AttachUserData (class ON_UserData *pUserData)
Attach user data to an object. More...
unsigned int  | ClearAllComponentStates () const
Set all active level component states to ON_ComponentStatus::NoneSet. More...
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
Clear the specified states on every component. More...
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
Clear states on an individual component. More...
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
Expert user tool that copies user data items with positive values of ON_UserData.m_userdata_copycount from source_object to "this. More...
void  | CopyUserData (const ON_Object &source_object)
Calls CopyUserData(source_object,ON_Object::UserDataConflictResolution::source_object). More...
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
Returns a CRC calculated from the information that defines the object. This CRC can be used as a quick way to see if two objects are not identical. More...
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
Delete the portions of the object identified in ci_list[]. More...
bool  | DetachUserData (class ON_UserData *pUserData)
Remove user data from an object. More...
void  | EmergencyDestroy ()
Sets m_user_data_list = 0. More...
class ON_UserData *  | FirstUserData () const
User data is stored as a linked list of ON_UserData classes. FirstUserData gets the first item in the linked list. This is the most recent item attached using AttachUserData(). Remark: To iterate through all the user data on an object, call FirstUserData() and then use ON_UserData::Next() to traverse the list. More...
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
Get a pointer to user data. More...
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
Get user string from the object. More...
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
Get a list of all user string keys on the object. More...
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
Get a list of all user strings on the object. More...
bool  | IsKindOf (const ON_ClassId *pClassId) const
Low level tool to test if an object is derived from a specified class. More...
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
virtual ON_UUID  | ModelObjectId () const
All objects in an opennurbs model have an id ( ON_Layer.m_layer_id, ON_Font.m_font_id, ON_Material.m_material_id, ON_3dmObjectAttributes.m_uuid ). More...
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
Expert user tool that moves user data items from source_object to "this. More...
void  | MoveUserData (ON_Object &source_object)
Calls MoveUserData(source_object,ON_Object::UserDataConflictResolution::source_object,true). More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
PurgeUserData() removes all user data from object. More...
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
Set states on an individual component. More...
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
Copy status settings to an individual component. More...
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
Attach a user string to the object. This information will perisist through copy construction, operator=, and file IO. More...
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
Append entries to the user string list More...
void  | TransformUserData (const class ON_Xform &xform)
Objects derived from ON_Geometry must call TransformUserData() in their Transform() member function. More...
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. More...
int  | UserStringCount () const
 Public Attributes
ON_UuidList  | m_captive_id
Rhino captive object ids. More...
ON_ClassArray< ON_Localizer >  | m_localizers
Use ON_GetCageXform to set m_cage_xform. More...
ON_NurbsCage  | m_nurbs_cage
ON_Xform  | m_nurbs_cage0 = ON_Xform::IdentityTransformation
ON_NurbsCurve  | m_nurbs_curve
ON_NurbsCurve  | m_nurbs_curve0
ON_Interval  | m_nurbs_curve_domain
ON_NurbsSurface  | m_nurbs_surface
ON_NurbsSurface  | m_nurbs_surface0
ON_Interval  | m_nurbs_surface_domain [2]
bool  | m_sporh_bPreserveStructure
bool  | m_sporh_bQuickPreview
double  | m_sporh_tolerance
ON_SpaceMorphOptions. More...
int  | m_varient
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
When a userdata item is copied or moved from a source object to a destination object, the ON_Object::UserDataConflictResolution enum values specify how conficts are resolved. Remark: A userdata item "conflict" occurs when both the destination and source object have a user data item with the same value of ON_UserData::m_userdata_uuid. More...
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
Constructor & Destructor Documentation
◆ ON_MorphControl()
 ON_MorphControl::ON_MorphControl  |  ( |   | )
◆ ~ON_MorphControl()
 virtual ON_MorphControl::~ON_MorphControl  |  ( |   | )
virtual
Member Function Documentation
◆ AddBoxLocalizer()
 bool ON_MorphControl::AddBoxLocalizer  |  ( |  ON_BoundingBox  |  bbox,
|  double  |  support_distance,
|  double  |  falloff_distance
)
◆ AddControlLocalizer()
 bool ON_MorphControl::AddControlLocalizer  |  ( |  double  |  support_distance,
|  double  |  falloff_distance
)
Adds localizer with support near the controling NURBS object.
Parameters
support_distance | [in] >= 0 If the distance a point to the controls NURBS curve/surface/cage is less than or equal to support_distance, then MorphPoint() deformation has 100% effect.
falloff_distance | [in] > 0 If the distance a point to the controls NURBS curve/surface/cage is more than support_distance+falloff_distance, then MorphPoint() deformation does not move the point. As the distance varies from support_distance to support_distance+falloff_distance the deformation attenuates from 100% to 0%.
◆ AddConvexPolygonLocalizer()
 bool ON_MorphControl::AddConvexPolygonLocalizer  |  ( |  const ON_SimpleArray< ON_Plane > &  |  planes,
|  double  |  support_distance,
|  double  |  falloff_distance
)
◆ AddCylinderLocalizer()
 bool ON_MorphControl::AddCylinderLocalizer  |  ( |  ON_Line  |  axis,
|  double  |  support_distance,
|  double  |  falloff_distance
)
◆ AddPlaneLocalizer()
 bool ON_MorphControl::AddPlaneLocalizer  |  ( |  const ON_Plane &  |  plane,
|  double  |  support_distance,
|  double  |  falloff_distance
)
◆ AddSphereLocalizer()
 bool ON_MorphControl::AddSphereLocalizer  |  ( |  ON_3dPoint  |  center,
|  double  |  support_distance,
|  double  |  falloff_distance
)
◆ BrepForm()
 ON_Brep* ON_MorphControl::BrepForm  |  ( |  ON_Brep *  |  brep = nullptr | ) |   const
overridevirtual
If possible, BrepForm() creates a brep form of the ON_Geometry.
Parameters
brep | [in] if not nullptr, brep is used to store the brep form of the geometry. Result: Returns a pointer to on ON_Brep or nullptr. If the brep parameter is not nullptr, then brep is returned if the geometry has a brep form and nullptr is returned if the geometry does not have a brep form.
The caller is responsible for managing the brep memory. See Also ON_Geometry::HasBrepForm
Reimplemented from ON_Geometry.
◆ ClearBoundingBox()
 void ON_MorphControl::ClearBoundingBox  |  ( |   | )
overridevirtual
Some objects cache bounding box information. If you modify an object, then call ClearBoundingBox() to inform the object that any cached bounding boxes are invalid.
Generally, ClearBoundingBox() overrides simply invalidate a cached bounding box and then wait for a call to GetBBox() before recomputing the bounding box.
The default implementation does nothing.
Reimplemented from ON_Geometry.
◆ CV()
 const double* ON_MorphControl::CV  |  ( |  ON_3dex  |   | ) |   const
◆ CVCount() [1/2]
 int ON_MorphControl::CVCount  |  ( |   | ) |   const
Returns
Number of control points in the target NURBS object.
◆ CVCount() [2/2]
 int ON_MorphControl::CVCount  |  ( |  int  |  dir | ) |   const
◆ Destroy()
 void ON_MorphControl::Destroy  |  ( |   | )
C++ default copy construction and operator= work fine.
◆ DestroyRuntimeCache()
 void ON_MorphControl::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
Expert user function. If you are using openNURBS in its default configuration to read and write 3dm archives, you never need to call this function. Many objects employ lazy creation of (runtime) caches that save information to help speed geometric calculations. This function will destroy all runtime information.
Parameters
bDelete | [in] if true, any cached information is properly deleted. If false, any cached information is simply discarded. This is useful when the cached information may be in alternate memory pools that are managed in nonstandard ways.
Reimplemented from ON_Object.
◆ Dimension()
 int ON_MorphControl::Dimension  |  ( |   | ) |   const
overridevirtual
Dimension of the object.
Returns
Dimension of the object.
The dimension is typically three. For parameter space trimming curves the dimension is two. In rare cases the dimension can be one or greater than three.
Reimplemented from ON_Geometry.
◆ Dump()
 void ON_MorphControl::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
Creates a text dump of the object.
Dump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
The default implementations of this virtual function prints the class's name.
Reimplemented from ON_Object.
◆ GetBBox()
 bool ON_MorphControl::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
virtual ON_Geometry GetBBox override
Reimplemented from ON_Geometry.
◆ GetCageMorph()
 bool ON_MorphControl::GetCageMorph  |  ( |  class ON_CageMorph &  |  cage_morph | ) |   const
Get a cage_morph that can be passed to Morph functions.
◆ GetTightBoundingBox()
 bool ON_MorphControl::GetTightBoundingBox  |  ( |  class ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const class ON_Xform *  |  xform = nullptr
) |   |  const
overridevirtual
virtual ON_Geometry GetTightBoundingBox override
Reimplemented from ON_Geometry.
◆ HasBrepForm()
 bool ON_MorphControl::HasBrepForm  |  ( |   | ) |   const
overridevirtual
Query an object to see if it has an ON_Brep form. Result: Returns true if the virtual ON_Geometry::BrepForm can compute an ON_Brep representation of this object.
The default implementation of ON_Geometry::BrepForm returns false. See Also ON_Geometry::BrepForm
Reimplemented from ON_Geometry.
◆ IsIdentity()
 bool ON_MorphControl::IsIdentity  |  ( |  const ON_BoundingBox &  |  bbox | ) |   const
◆ IsRational()
 bool ON_MorphControl::IsRational  |  ( |   | ) |   const
Returns
True if the target NURBS object is rational
◆ IsValid()
 bool ON_MorphControl::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Tests an object to see if its data members are correctly initialized.
Parameters
text_log | [in] if the object is not valid and text_log is not nullptr, then a brief englis description of the reason the object is not valid is appened to the log. The information appended to text_log is suitable for
low | level debugging purposes by programmers and is not intended to be useful as a high level user interface tool.
Returns
table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Geometry.
◆ Knot()
 const double* ON_MorphControl::Knot  |  ( |  int  |  dir | ) |   const
◆ MakeNonRational()
 bool ON_MorphControl::MakeNonRational  |  ( |   | )
Makes the target NURBS object non-rational.
◆ MakeRational()
 bool ON_MorphControl::MakeRational  |  ( |   | )
Makes the target NURBS object rational.
◆ MaxCVIndex()
 ON_3dex ON_MorphControl::MaxCVIndex  |  ( |   | ) |   const
◆ MemoryRelocate()
 void ON_MorphControl::MemoryRelocate  |  ( |   | )
overridevirtual
The MemoryRelocate() function is called when an object's location in memory is changed. For example, if an object resides in a chunk of memory that is grown by calling a realloc that has to allocate a new chunk and copy the contents of the old chunk to the new chunk, then the location of the object's memory changes. In practice this happens when classes derived from ON_Object are stored in dynamic arrays, like the default implementation of ON_ObjectArray<>'s that use realloc to grow the dynamic array.
Reimplemented from ON_Object.
◆ ObjectType()
 ON::object_type ON_MorphControl::ObjectType  |  ( |   | ) |   const
overridevirtual
Useful for switch statements that need to differentiate between basic object types like points, curves, surfaces, and so on.
Returns
ON::object_type enum value.
The default implementation of this virtual function returns ON::unknown_object_type
Reimplemented from ON_Object.
◆ Order()
 int ON_MorphControl::Order  |  ( |  int  |  dir | ) |   const
◆ Read()
 bool ON_MorphControl::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::ReadObject().
Parameters
binary_archive | archive to read from
Returns
Returns true if the read is successful.
Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ SizeOf()
 unsigned int ON_MorphControl::SizeOf  |  ( |   | ) |   const
overridevirtual
Returns
An estimate of the amount of memory the class uses in bytes.
Reimplemented from ON_Object.
◆ Transform()
 bool ON_MorphControl::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
Transforms the object.
Parameters
xform | [in] transformation to apply to object. If xform.IsSimilarity() is zero, then you may want to call MakeSquishy() before calling Transform.
Classes derived from ON_Geometry should call ON_Geometry::Transform() to handle user data transformations and then transform their definition.
See also
ON_Geometry::IsDeformable();,
Reimplemented from ON_Geometry.
◆ Weight()
 double ON_MorphControl::Weight  |  ( |  ON_3dex  |   | ) |   const
◆ Write()
 bool ON_MorphControl::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::WriteObject().
Parameters
binary_archive | archive to write to
Returns
Returns true if the write is successful.
Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
Member Data Documentation
◆ m_captive_id
 ON_UuidList ON_MorphControl::m_captive_id
Rhino captive object ids.
◆ m_localizers
 ON_ClassArray<ON_Localizer> ON_MorphControl::m_localizers
Use ON_GetCageXform to set m_cage_xform.
Used to localize the deformation
◆ m_nurbs_cage
 ON_NurbsCage ON_MorphControl::m_nurbs_cage
◆ m_nurbs_cage0
 ON_Xform ON_MorphControl::m_nurbs_cage0 = ON_Xform::IdentityTransformation
◆ m_nurbs_curve
 ON_NurbsCurve ON_MorphControl::m_nurbs_curve
◆ m_nurbs_curve0
 ON_NurbsCurve ON_MorphControl::m_nurbs_curve0
◆ m_nurbs_curve_domain
 ON_Interval ON_MorphControl::m_nurbs_curve_domain
◆ m_nurbs_surface
 ON_NurbsSurface ON_MorphControl::m_nurbs_surface
◆ m_nurbs_surface0
 ON_NurbsSurface ON_MorphControl::m_nurbs_surface0
◆ m_nurbs_surface_domain
 ON_Interval ON_MorphControl::m_nurbs_surface_domain[2]
◆ m_sporh_bPreserveStructure
 bool ON_MorphControl::m_sporh_bPreserveStructure
◆ m_sporh_bQuickPreview
 bool ON_MorphControl::m_sporh_bQuickPreview
◆ m_sporh_tolerance
 double ON_MorphControl::m_sporh_tolerance
ON_SpaceMorphOptions.
◆ m_varient
 int ON_MorphControl::m_varient