Public Member Functions | Public Attributes | List of all members
ON_ArcCurve Class Reference
ON_ArcCurve is used to represent arcs and circles. ON_ArcCurve.IsCircle() returns true if the curve is a complete circle. More...
#include <opennurbs_arccurve.h>
 Inheritance diagram for ON_ArcCurve:
 Public Member Functions
ON_ArcCurve () ON_NOEXCEPT
ON_ArcCurve (const ON_ArcCurve &)
ON_ArcCurve (const ON_Arc &arc)
Create an arc curve with domain (0,arc.Length()). More...
ON_ArcCurve (const ON_Arc &arc, double t0, double t1)
Create an arc curve with domain (t0,t1) More...
ON_ArcCurve (const ON_Circle &circle)
Creates a curve that is a complete circle with domain (0,circle.Length()). More...
ON_ArcCurve (const ON_Circle &circle, double t0, double t1)
Creates a curve that is a complete circle with domain (t0,t1). More...
virtual  | ~ON_ArcCurve ()
double  | AngleDegrees () const
double  | AngleRadians () const
bool  | ChangeClosedCurveSeam (double t) override
If this curve is closed, then modify it so that the start/end point is at curve parameter t. More...
bool  | ChangeDimension (int desired_dimension) override
Change the dimension of a curve. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree () const override
Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. More...
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain () const override
void  | Dump (ON_TextLog &) const override
Creates a text dump of the object. More...
bool  | Evaluate (double, int, int, double *, int=0, int *=0) const override
This evaluator actually does all the work. The other ON_Curve evaluation tools call this virtual function. More...
bool  | Extend (const ON_Interval &domain) override
Where possible, analytically extends curve to include domain. More...
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetCurveParameterFromNurbFormParameter (double, double *) const override
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override More...
int  | GetNurbForm (ON_NurbsCurve &, double=0.0, const ON_Interval *=nullptr) const override
virtual ON_Curve::GetNurbForm override More...
bool  | GetNurbFormParameterFromCurveParameter (double, double *) const override
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override More...
bool  | GetSpanVector (double *) const override
Get number of parameters of "knots". More...
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override More...
int  | HasNurbForm () const override
virtual ON_Curve::HasNurbForm override More...
bool  | IsArc (const ON_Plane *=nullptr, ON_Arc *=nullptr, double=0.0) const override
Test a curve to see if the locus if its points is an arc or circle. More...
bool  | IsCircle () const
Returns true if this arc curve is a complete circle. More...
bool  | IsClosed (void) const override
Test a curve to see if it is closed. More...
bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
Test continuity at a curve parameter value. More...
bool  | IsInPlane (const ON_Plane &, double=0.0) const override
Test a curve to see if it lies in a specific plane. More...
bool  | IsLinear (double=ON_ZERO_TOLERANCE) const override
Test a curve to see if the locus if its points is a line segment. More...
bool  | IsPeriodic (void) const override
Test a curve to see if it is periodic. More...
bool  | IsPlanar (ON_Plane *=nullptr, double=0.0) const override
Test a curve to see if it is planar. More...
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_Object overrides. More...
ON_ArcCurve &  | operator= (const ON_ArcCurve &)
ON_ArcCurve &  | operator= (const ON_Arc &arc)
Create an arc curve with domain (0,arc.Length()). More...
ON_ArcCurve &  | operator= (const ON_Circle &circle)
Creates a curve that is a complete circle with domain (0,circle.Length()). More...
double  | Radius () const
bool  | Read (ON_BinaryArchive &) override
Low level archive writing tool used by ON_BinaryArchive::ReadObject(). More...
bool  | Reverse () override
Reverse the direction of the curve. More...
bool  | SetDomain (double t0, double t1) override
ON_Curve overrides. More...
bool  | SetEndPoint (ON_3dPoint end_point) override
Force the curve to end at a specified point. More...
bool  | SetStartPoint (ON_3dPoint start_point) override
Force the curve to start at a specified point. More...
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
int  | SpanCount () const override
Get number of nonempty smooth (c-infinity) spans in curve More...
bool  | Split (double t, ON_Curve *&left_side, ON_Curve *&right_side) const override
Splits (divides) the arc at the specified parameter. The parameter must be in the interior of the arc's domain. The ON_Curve pointers passed to ON_ArcCurve::Split must either be nullptr or point to ON_ArcCurve objects. If a pointer is nullptr, then an ON_ArcCurve will be created in Split(). You may pass "this" as left_side or right_side. More...
bool  | Transform (const ON_Xform &) override
Transforms the object. More...
bool  | Trim (const ON_Interval &) override
Removes portions of the curve outside the specified interval. More...
bool  | Write (ON_BinaryArchive &) const override
Low level archive writing tool used by ON_BinaryArchive::WriteObject(). More...
 Public Member Functions inherited from ON_Curve
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
ON_3dVector  | CurvatureAt (double t) const
Evaluate the curvature vector at a parameter. More...
ON_3dVector  | DerivativeAt (double t) const
Evaluate first derivative at a parameter. More...
void  | DestroyCurveTree ()
Destroys the runtime curve tree used to speed closest point and intersection calcuations. More...
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
virtual ON_Curve *  | DuplicateCurve () const
Get a duplicate of the curve. More...
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
Evaluate first derivative at a parameter with error checking. More...
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
Evaluate second derivative at a parameter with error checking. More...
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
Evaluate unit tangent and curvature at a parameter with error checking. More...
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
Evaluate point at a parameter with error checking. More...
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
Evaluate unit tangent at a parameter with error checking. More...
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
Return a 3d frame at a parameter. More...
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const
Search for a derivatitive, tangent, or curvature discontinuity. More...
virtual bool  | GetParameterTolerance (double t, double *tminus, double *tplus) const
Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. More...
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override More...
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
Decide if it makes sense to close off this curve by moving the endpoint to the start based on start-end gap size and length of curve as approximated by chord defined by 6 points. More...
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
virtual int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const
Several types of ON_Curve can have the form of a polyline including a degree 1 ON_NurbsCurve, an ON_PolylineCurve, and an ON_PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline. More...
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
Get a NURBS curve representation of this curve. More...
ON::object_type  | ObjectType () const override
overrides virtual ON_Object::ObjectType. More...
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
Evaluate point at a parameter. More...
ON_3dPoint  | PointAtEnd () const
Evaluate point at the end of the curve. More...
ON_3dPoint  | PointAtStart () const
Evaluate point at the start of the curve. More...
bool  | SetDomain (ON_Interval domain)
Set the domain of the curve. More...
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
ON_3dVector  | TangentAt (double t) const
Evaluate unit tangent vector at a parameter. More...
bool  | Transform (const ON_Xform &xform) override
overrides virtual ON_Geometry::Transform(). ON_Curve::Transform() calls ON_Geometry::Transform(xform), which calls ON_Object::TransformUserData(xform), and then calls this->DestroyCurveTree(). More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
Get object's 3d axis aligned bounding box. More...
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
If possible, BrepForm() creates a brep form of the ON_Geometry. More...
virtual void  | ClearBoundingBox ()
Some objects cache bounding box information. If you modify an object, then call ClearBoundingBox() to inform the object that any cached bounding boxes are invalid. More...
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
If this piece of geometry is a component in something larger, like an ON_BrepEdge in an ON_Brep, then this function returns the component index. More...
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
Get object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
Get corners of object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
virtual bool  | HasBrepForm () const
Query an object to see if it has an ON_Brep form. Result: Returns true if the virtual ON_Geometry::BrepForm can compute an ON_Brep representation of this object. More...
virtual bool  | IsDeformable () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
Tests an object to see if its data members are correctly initialized. More...
virtual bool  | MakeDeformable ()
If possible, converts the object into a form that can be accuratly modified with "squishy" transformations like projections, shears, an non-uniform scaling. More...
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Scale (double scale_factor)
Scales the object by the specified facotor. The scale is centered at the origin. More...
virtual bool  | SwapCoordinates (int i, int j)
Swaps object coordinate values with indices i and j. More...
bool  | Translate (const ON_3dVector &translation_vector)
Translates the object along the specified vector. More...
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
bool  | AttachUserData (class ON_UserData *pUserData)
Attach user data to an object. More...
unsigned int  | ClearAllComponentStates () const
Set all active level component states to ON_ComponentStatus::NoneSet. More...
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
Clear the specified states on every component. More...
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
Clear states on an individual component. More...
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
Expert user tool that copies user data items with positive values of ON_UserData.m_userdata_copycount from source_object to "this. More...
void  | CopyUserData (const ON_Object &source_object)
Calls CopyUserData(source_object,ON_Object::UserDataConflictResolution::source_object). More...
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
Delete the portions of the object identified in ci_list[]. More...
bool  | DetachUserData (class ON_UserData *pUserData)
Remove user data from an object. More...
void  | EmergencyDestroy ()
Sets m_user_data_list = 0. More...
class ON_UserData *  | FirstUserData () const
User data is stored as a linked list of ON_UserData classes. FirstUserData gets the first item in the linked list. This is the most recent item attached using AttachUserData(). Remark: To iterate through all the user data on an object, call FirstUserData() and then use ON_UserData::Next() to traverse the list. More...
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
Get a pointer to user data. More...
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
Get user string from the object. More...
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
Get a list of all user string keys on the object. More...
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
Get a list of all user strings on the object. More...
bool  | IsKindOf (const ON_ClassId *pClassId) const
Low level tool to test if an object is derived from a specified class. More...
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
virtual void  | MemoryRelocate ()
The MemoryRelocate() function is called when an object's location in memory is changed. For example, if an object resides in a chunk of memory that is grown by calling a realloc that has to allocate a new chunk and copy the contents of the old chunk to the new chunk, then the location of the object's memory changes. In practice this happens when classes derived from ON_Object are stored in dynamic arrays, like the default implementation of ON_ObjectArray<>'s that use realloc to grow the dynamic array. More...
virtual ON_UUID  | ModelObjectId () const
All objects in an opennurbs model have an id ( ON_Layer.m_layer_id, ON_Font.m_font_id, ON_Material.m_material_id, ON_3dmObjectAttributes.m_uuid ). More...
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
Expert user tool that moves user data items from source_object to "this. More...
void  | MoveUserData (ON_Object &source_object)
Calls MoveUserData(source_object,ON_Object::UserDataConflictResolution::source_object,true). More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
PurgeUserData() removes all user data from object. More...
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
Set states on an individual component. More...
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
Copy status settings to an individual component. More...
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
Attach a user string to the object. This information will perisist through copy construction, operator=, and file IO. More...
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
Append entries to the user string list More...
void  | TransformUserData (const class ON_Xform &xform)
Objects derived from ON_Geometry must call TransformUserData() in their Transform() member function. More...
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. More...
int  | UserStringCount () const
 Public Attributes
ON_Arc  | m_arc = ON_Arc::UnitCircle
int  | m_dim = 3
ON_Interval  | m_t = ON_Interval::ZeroToTwoPi
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
When a userdata item is copied or moved from a source object to a destination object, the ON_Object::UserDataConflictResolution enum values specify how conficts are resolved. Remark: A userdata item "conflict" occurs when both the destination and source object have a user data item with the same value of ON_UserData::m_userdata_uuid. More...
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
 Protected Member Functions inherited from ON_Curve
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
Lookup a parameter in the m_t array, optionally using a built in snap tolerance to snap a parameter value to an element of m_t. This function is used by some types derived from ON_Curve to snap parameter values More...
Detailed Description
ON_ArcCurve is used to represent arcs and circles. ON_ArcCurve.IsCircle() returns true if the curve is a complete circle.
An ON_ArcCurve is a subcurve of a circle, with a constant speed parameterization. The parameterization is an affine linear reparameterzation of the underlying arc m_arc onto the domain m_t.
A valid ON_ArcCurve has Radius()>0 and 0<AngleRadians()<=2*PI and a strictly increasing Domain().
Constructor & Destructor Documentation
◆ ON_ArcCurve() [1/6]
 ON_ArcCurve::ON_ArcCurve  |  ( |   | )
◆ ~ON_ArcCurve()
 virtual ON_ArcCurve::~ON_ArcCurve  |  ( |   | )
virtual
◆ ON_ArcCurve() [2/6]
 ON_ArcCurve::ON_ArcCurve  |  ( |  const ON_ArcCurve &  |   | )
◆ ON_ArcCurve() [3/6]
 ON_ArcCurve::ON_ArcCurve  |  ( |  const ON_Arc &  |  arc | )
Create an arc curve with domain (0,arc.Length()).
◆ ON_ArcCurve() [4/6]
 ON_ArcCurve::ON_ArcCurve  |  ( |  const ON_Arc &  |  arc,
|  double  |  t0,
|  double  |  t1
)
Create an arc curve with domain (t0,t1)
◆ ON_ArcCurve() [5/6]
 ON_ArcCurve::ON_ArcCurve  |  ( |  const ON_Circle &  |  circle | )
Creates a curve that is a complete circle with domain (0,circle.Length()).
◆ ON_ArcCurve() [6/6]
 ON_ArcCurve::ON_ArcCurve  |  ( |  const ON_Circle &  |  circle,
|  double  |  t0,
|  double  |  t1
)
Creates a curve that is a complete circle with domain (t0,t1).
Member Function Documentation
◆ AngleDegrees()
 double ON_ArcCurve::AngleDegrees  |  ( |   | ) |   const
Returns
The arc's subtended angle in degrees.
◆ AngleRadians()
 double ON_ArcCurve::AngleRadians  |  ( |   | ) |   const
Returns
The arc's subtended angle in radians.
◆ ChangeClosedCurveSeam()
 bool ON_ArcCurve::ChangeClosedCurveSeam  |  ( |  double  |  t | )
overridevirtual
If this curve is closed, then modify it so that the start/end point is at curve parameter t.
Parameters
t | [in] curve parameter of new start/end point. The returned curves domain will start at t.
Returns
true if successful.
Reimplemented from ON_Curve.
◆ ChangeDimension()
 bool ON_ArcCurve::ChangeDimension  |  ( |  int  |  desired_dimension | )
overridevirtual
Change the dimension of a curve.
Parameters
desired_dimension | [in]
Returns
true if the curve's dimension was already desired_dimension or if the curve's dimension was successfully changed to desired_dimension.
Reimplemented from ON_Curve.
◆ DataCRC()
 ON__UINT32 ON_ArcCurve::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
virtual ON_Object::DataCRC override
Reimplemented from ON_Object.
◆ Degree()
 int ON_ArcCurve::Degree  |  ( |   | ) |   const
overridevirtual
Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic.
Returns
degree
Implements ON_Curve.
◆ Dimension()
 int ON_ArcCurve::Dimension  |  ( |   | ) |   const
overridevirtual
ON_Geometry overrides.
Reimplemented from ON_Geometry.
◆ Domain()
 ON_Interval ON_ArcCurve::Domain  |  ( |   | ) |   const
overridevirtual
Returns
domain of the curve.
Implements ON_Curve.
◆ Dump()
 void ON_ArcCurve::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
Creates a text dump of the object.
Dump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
The default implementations of this virtual function prints the class's name.
Reimplemented from ON_Object.
◆ Evaluate()
 bool ON_ArcCurve::Evaluate  |  ( |  double  |  t,
|  int  |  der_count,
|  int  |  v_stride,
|  double *  |  v,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
overridevirtual
This evaluator actually does all the work. The other ON_Curve evaluation tools call this virtual function.
Parameters
t | [in] evaluation parameter ( usually in Domain() ).
der_count | [in] (>=0) number of derivatives to evaluate
v_stride | [in] (>=Dimension()) stride to use for the v[] array
v | [out] array of length (der_count+1)*v_stride curve(t) is returned in (v[0],...,v[m_dim-1]), curve'(t) is retuned in (v[v_stride],...,v[v_stride+m_dim-1]), curve"(t) is retuned in (v[2*v_stride],...,v[2*v_stride+m_dim-1]), etc.
side | [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above
hint | [in/out] optional evaluation hint used to speed repeated evaluations
Returns
false if unable to evaluate.
See also
ON_Curve::EvPoint, ON_Curve::Ev1Der, ON_Curve::Ev2Der
Implements ON_Curve.
◆ Extend()
 bool ON_ArcCurve::Extend  |  ( |  const ON_Interval &  |  domain | )
overridevirtual
Where possible, analytically extends curve to include domain.
Parameters
domain | [in] if domain is not included in curve domain, curve will be extended so that its domain includes domain. Will not work if curve is closed. Original curve is identical to the restriction of the resulting curve to the original curve domain,
Returns
true if successful.
Reimplemented from ON_Curve.
◆ GetBBox()
 bool ON_ArcCurve::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
virtual ON_Geometry GetBBox override
Reimplemented from ON_Geometry.
◆ GetCurveParameterFromNurbFormParameter()
 bool ON_ArcCurve::GetCurveParameterFromNurbFormParameter  |  ( |  double  |  ,
|  double *
) |   |  const
overridevirtual
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override
Reimplemented from ON_Curve.
◆ GetNurbForm()
 int ON_ArcCurve::GetNurbForm  |  ( |  ON_NurbsCurve &  |  ,
|  double  |   = 0.0,
|  const ON_Interval *  |   = nullptr
) |   |  const
overridevirtual
virtual ON_Curve::GetNurbForm override
Reimplemented from ON_Curve.
◆ GetNurbFormParameterFromCurveParameter()
 bool ON_ArcCurve::GetNurbFormParameterFromCurveParameter  |  ( |  double  |  ,
|  double *
) |   |  const
overridevirtual
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override
Reimplemented from ON_Curve.
◆ GetSpanVector()
 bool ON_ArcCurve::GetSpanVector  |  ( |  double *  |  knots | ) |   const
overridevirtual
Get number of parameters of "knots".
Parameters
knots | [out] an array of length SpanCount()+1 is filled in with the parameters where the curve is not smooth (C-infinity).
Returns
true if successful
Implements ON_Curve.
◆ GetTightBoundingBox()
 bool ON_ArcCurve::GetTightBoundingBox  |  ( |  class ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const class ON_Xform *  |  xform = nullptr
) |   |  const
overridevirtual
virtual ON_Geometry GetTightBoundingBox override
Reimplemented from ON_Geometry.
◆ HasNurbForm()
 int ON_ArcCurve::HasNurbForm  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::HasNurbForm override
Reimplemented from ON_Curve.
◆ IsArc()
 bool ON_ArcCurve::IsArc  |  ( |  const ON_Plane *  |  plane = nullptr,
|  ON_Arc *  |  arc = nullptr,
|  double  |  tolerance = 0.0
) |   |  const
overridevirtual
Test a curve to see if the locus if its points is an arc or circle.
Parameters
plane | [in] if not nullptr, test is performed in this plane
arc | [out] if not nullptr and true is returned, then arc parameters are filled in
tolerance | [in] tolerance to use when checking
Returns
ON_Arc.m_angle > 0 if curve locus is an arc between specified points. If ON_Arc.m_angle is 2.0*ON_PI, then the curve is a circle.
Reimplemented from ON_Curve.
◆ IsCircle()
 bool ON_ArcCurve::IsCircle  |  ( |   | ) |   const
Returns true if this arc curve is a complete circle.
◆ IsClosed()
 bool ON_ArcCurve::IsClosed  |  ( |  void  |   | ) |   const
overridevirtual
Test a curve to see if it is closed.
Returns
true if the curve is closed.
Reimplemented from ON_Curve.
◆ IsContinuous()
 bool ON_ArcCurve::IsContinuous  |  ( |  ON::continuity  |  c,
|  double  |  t,
|  int *  |  hint = nullptr,
|  double  |  point_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d1_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d2_tolerance = ON_ZERO_TOLERANCE,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Test continuity at a curve parameter value.
Parameters
c | [in] type of continuity to test for. Read ON::continuity comments for details.
t | [in] parameter to test
hint | [in] evaluation hint
point_tolerance | [in] if the distance between two points is greater than point_tolerance, then the curve is not C0.
d1_tolerance | [in] if the difference between two first derivatives is greater than d1_tolerance, then the curve is not C1.
d2_tolerance | [in] if the difference between two second derivatives is greater than d2_tolerance, then the curve is not C2.
cos_angle_tolerance | [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported.
curvature_tolerance | [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous or ON::continuity::Gsmooth_continuous. ON::continuity::G2_continuous: If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. ON::continuity::Gsmooth_continuous: If K0 and K1 are curvatures evaluated from above and below and the angle between K0 and K1 is at least twice angle tolerance or ||K0| - |K1|| > (max(|K0|,|K1|) > curvature_tolerance, then a curvature discontinuity is reported.
Returns
true if the curve has at least the c type continuity at the parameter t.
Reimplemented from ON_Curve.
◆ IsInPlane()
 bool ON_ArcCurve::IsInPlane  |  ( |  const ON_Plane &  |  test_plane,
|  double  |  tolerance = 0.0
) |   |  const
overridevirtual
Test a curve to see if it lies in a specific plane.
Parameters
test_plane | [in]
tolerance | [in] tolerance to use when checking
Returns
true if the maximum distance from the curve to the test_plane is <= tolerance.
Implements ON_Curve.
◆ IsLinear()
 bool ON_ArcCurve::IsLinear  |  ( |  double  |  tolerance = ON_ZERO_TOLERANCE | ) |   const
overridevirtual
Test a curve to see if the locus if its points is a line segment.
Parameters
tolerance | [in] // tolerance to use when checking linearity
Returns
true if the ends of the curve are farther than tolerance apart and the maximum distance from any point on the curve to the line segment connecting the curve's ends is <= tolerance.
Reimplemented from ON_Curve.
◆ IsPeriodic()
 bool ON_ArcCurve::IsPeriodic  |  ( |  void  |   | ) |   const
overridevirtual
Test a curve to see if it is periodic.
Returns
true if the curve is closed and at least C2 at the start/end.
Reimplemented from ON_Curve.
◆ IsPlanar()
 bool ON_ArcCurve::IsPlanar  |  ( |  ON_Plane *  |  plane = nullptr,
|  double  |  tolerance = 0.0
) |   |  const
overridevirtual
Test a curve to see if it is planar.
Parameters
plane | [out] if not nullptr and true is returned, the plane parameters are filled in.
tolerance | [in] tolerance to use when checking
Returns
true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.
Reimplemented from ON_Curve.
◆ IsValid()
 bool ON_ArcCurve::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
ON_Object overrides.
Reimplemented from ON_Object.
◆ operator=() [1/3]
 ON_ArcCurve& ON_ArcCurve::operator=  |  ( |  const ON_ArcCurve &  |   | )
◆ operator=() [2/3]
 ON_ArcCurve& ON_ArcCurve::operator=  |  ( |  const ON_Arc &  |  arc | )
Create an arc curve with domain (0,arc.Length()).
◆ operator=() [3/3]
 ON_ArcCurve& ON_ArcCurve::operator=  |  ( |  const ON_Circle &  |  circle | )
Creates a curve that is a complete circle with domain (0,circle.Length()).
◆ Radius()
 double ON_ArcCurve::Radius  |  ( |   | ) |   const
Returns
The arc's radius.
◆ Read()
 bool ON_ArcCurve::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::ReadObject().
Parameters
binary_archive | archive to read from
Returns
Returns true if the read is successful.
Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ Reverse()
 bool ON_ArcCurve::Reverse  |  ( |   | )
overridevirtual
Reverse the direction of the curve.
Returns
true if curve was reversed.
If reveresed, the domain changes from [a,b] to [-b,-a]
Implements ON_Curve.
◆ SetDomain()
 bool ON_ArcCurve::SetDomain  |  ( |  double  |  t0,
|  double  |  t1
)
overridevirtual
ON_Curve overrides.
virtual ON_Curve::SetDomain override. Set the domain of the curve
Parameters
t0 | [in]
t1 | [in] new domain will be [t0,t1]
Returns
true if successful.
Reimplemented from ON_Curve.
◆ SetEndPoint()
 bool ON_ArcCurve::SetEndPoint  |  ( |  ON_3dPoint  |  end_point | )
overridevirtual
Force the curve to end at a specified point.
Parameters
end_point | [in]
Returns
true if successful.
Some end points cannot be moved. Be sure to check return code.
See also
ON_Curve::SetStartPoint, ON_Curve::PointAtStart, ON_Curve::PointAtEnd
Reimplemented from ON_Curve.
◆ SetStartPoint()
 bool ON_ArcCurve::SetStartPoint  |  ( |  ON_3dPoint  |  start_point | )
overridevirtual
Force the curve to start at a specified point.
Parameters
start_point | [in]
Returns
true if successful.
Some end points cannot be moved. Be sure to check return code.
See also
ON_Curve::SetEndPoint, ON_Curve::PointAtStart, ON_Curve::PointAtEnd
Reimplemented from ON_Curve.
◆ SizeOf()
 unsigned int ON_ArcCurve::SizeOf  |  ( |   | ) |   const
overridevirtual
virtual ON_Object::SizeOf override
Reimplemented from ON_Object.
◆ SpanCount()
 int ON_ArcCurve::SpanCount  |  ( |   | ) |   const
overridevirtual
Get number of nonempty smooth (c-infinity) spans in curve
Returns
Number of nonempty smooth (c-infinity) spans.
Implements ON_Curve.
◆ Split()
 bool ON_ArcCurve::Split  |  ( |  double  |  t,
|  ON_Curve *&  |  left_side,
|  ON_Curve *&  |  right_side
) |   |  const
overridevirtual
Splits (divides) the arc at the specified parameter. The parameter must be in the interior of the arc's domain. The ON_Curve pointers passed to ON_ArcCurve::Split must either be nullptr or point to ON_ArcCurve objects. If a pointer is nullptr, then an ON_ArcCurve will be created in Split(). You may pass "this" as left_side or right_side.
Parameters
t | [in] parameter to split the curve at in the interval returned by Domain().
left_side | [out] left portion of curve returned here. If not nullptr, left_side must point to an ON_ArcCuve.
right_side | [out] right portion of curve returned here If not nullptr, right_side must point to an ON_ArcCuve.
Overrides virtual ON_Curve::Split.
Reimplemented from ON_Curve.
◆ Transform()
 bool ON_ArcCurve::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
Transforms the object.
Parameters
xform | [in] transformation to apply to object. If xform.IsSimilarity() is zero, then you may want to call MakeSquishy() before calling Transform.
Classes derived from ON_Geometry should call ON_Geometry::Transform() to handle user data transformations and then transform their definition.
See also
ON_Geometry::IsDeformable();,
Reimplemented from ON_Geometry.
◆ Trim()
 bool ON_ArcCurve::Trim  |  ( |  const ON_Interval &  |  domain | )
overridevirtual
Removes portions of the curve outside the specified interval.
Parameters
domain | [in] interval of the curve to keep. Portions of the curve before curve(domain[0]) and after curve(domain[1]) are removed.
Returns
true if successful.
Reimplemented from ON_Curve.
◆ Write()
 bool ON_ArcCurve::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::WriteObject().
Parameters
binary_archive | archive to write to
Returns
Returns true if the write is successful.
Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
Member Data Documentation
◆ m_arc
 ON_Arc ON_ArcCurve::m_arc = ON_Arc::UnitCircle
◆ m_dim
 int ON_ArcCurve::m_dim = 3
◆ m_t
 ON_Interval ON_ArcCurve::m_t = ON_Interval::ZeroToTwoPi