Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ON_RevSurface Class Reference
surface of revolution More...
#include <opennurbs_revsurface.h>
 Inheritance diagram for ON_RevSurface:
 Public Member Functions
ON_RevSurface ()
ON_RevSurface (const ON_RevSurface &)
~ON_RevSurface ()
void  | ClearBoundingBox () override
Some objects cache bounding box information. If you modify an object, then call ClearBoundingBox() to inform the object that any cached bounding boxes are invalid. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree (int) const override
void  | Destroy ()
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
int  | Dimension () const override
Dimension of the object. More...
ON_Interval  | Domain (int) const override
void  | Dump (ON_TextLog &) const override
Creates a text dump of the object. More...
bool  | Evaluate (double, double, int, int, double *, int=0, int *=0) const override
work horse evaluator More...
bool  | Extend (int dir, const ON_Interval &domain) override
Where possible, analytically extends surface to include domain. More...
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetNextDiscontinuity (int dir, ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
Search for a derivatitive, tangent, or curvature discontinuity. More...
int  | GetNurbForm (ON_NurbsSurface &, double=0.0) const override
Get a NURBS surface representation of this surface. More...
bool  | GetNurbFormParameterFromSurfaceParameter (double surface_s, double surface_t, double *nurbs_s, double *nurbs_t) const override
bool  | GetParameterTolerance (int, double, double *, double *) const override
bool  | GetSpanVector (int, double *) const override
bool  | GetSurfaceParameterFromNurbFormParameter (double nurbs_s, double nurbs_t, double *surface_s, double *surface_t) const override
bool  | GetSurfaceSize (double *width, double *height) const override
Get an estimate of the size of the rectangle that would be created if the 3d surface where flattened into a rectangle. More...
int  | HasNurbForm () const override
Is there a NURBS surface representation of this surface. More...
bool  | IsClosed (int) const override
bool  | IsConical (ON_Cone *cone=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
Test a surface of revolution to see if it is a portion of a cone. More...
bool  | IsContinuous (ON::continuity c, double s, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
Test continuity at a surface parameter value. More...
bool  | IsCylindrical (ON_Cylinder *cylinder=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
Test a surface of revolution to see if it is a portion of a cylinder. More...
ON_Curve *  | IsoCurve (int dir, double c) const override
Get isoparametric curve. Overrides virtual ON_Surface::IsoCurve. More...
bool  | IsPeriodic (int) const override
bool  | IsPlanar (ON_Plane *plane=nullptr, double tolerance=ON_ZERO_TOLERANCE) const override
Test a surface to see if it is planar. More...
bool  | IsSingular (int) const override
bool  | IsSpherical (ON_Sphere *sphere=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
Test a surface of revolution to see if it is a portion of a sphere. More...
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
Tests an object to see if its data members are correctly initialized. More...
ON_RevSurface &  | operator= (const ON_RevSurface &)
bool  | Read (ON_BinaryArchive &) override
Low level archive writing tool used by ON_BinaryArchive::ReadObject(). More...
bool  | Reverse (int) override
bool  | SetAngleDegrees (double start_angle_degrees, double end_angle_degrees)
bool  | SetAngleRadians (double start_angle_radians, double end_angle_radians)
bool  | SetDomain (int dir, double t0, double t1) override
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
int  | SpanCount (int) const override
bool  | Split (int dir, double c, ON_Surface *&west_or_south_side, ON_Surface *&east_or_north_side) const override
Splits (divides) the surface into two parts at the specified parameter. More...
bool  | Transform (const ON_Xform &) override
Transforms the object. More...
bool  | Transpose () override
bool  | Trim (int dir, const ON_Interval &domain) override
Removes the portions of the surface outside of the specified interval. More...
bool  | Write (ON_BinaryArchive &) const override
Low level archive writing tool used by ON_BinaryArchive::WriteObject(). More...
 Public Member Functions inherited from ON_Surface
ON_Surface ()
ON_Surface (const ON_Surface &)
virtual  | ~ON_Surface ()
ON_Brep *  | BrepForm (ON_Brep *brep=nullptr) const override
Overrides virtual ON_Geometry::HasBrepForm. Uses ON_Brep::Create( ON_Surface&* ) to create a brep form. The surface is copied for use in the returned brep. More...
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
void  | DestroySurfaceTree ()
virtual ON_Surface *  | DuplicateSurface () const
Get a duplicate of the surface. More...
bool  | Ev1Der (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, int quadrant=0, int *hint=0) const
bool  | Ev2Der (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, ON_3dVector &duu, ON_3dVector &duv, ON_3dVector &dvv, int quadrant=0, int *hint=0) const
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvNormal (double u, double v, ON_3dPoint &point, ON_3dVector &normal, int quadrant=0, int *hint=0) const
bool  | EvNormal (double u, double v, ON_3dVector &normal, int quadrant=0, int *hint=0) const
bool  | EvNormal (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, ON_3dVector &normal, int=0, int *=0) const
bool  | EvPoint (double u, double v, ON_3dPoint &point, int quadrant=0, int *hint=0) const
bool  | FrameAt (double u, double v, ON_Plane &frame) const
bool  | GetDomain (int dir, double *t0, double *t1) const
surface interface More...
virtual bool  | GetSpanVectorIndex (int dir, double t, int side, int *span_vector_index, ON_Interval *span_interval) const
bool  | HasBrepForm () const override
Overrides virtual ON_Geometry::HasBrepForm and returns true. Result: Returns true. More...
int  | IsAtSeam (double s, double t) const
Test if a surface parameter value is at a seam. More...
bool  | IsAtSingularity (double s, double t, bool bExact=true) const
Test if a surface parameter value is at a singularity. More...
bool  | IsCone (ON_Cone *cone=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
Determine if the surface is a portion of a cone. More...
bool  | IsCylinder (ON_Cylinder *cylinder=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
Determine if the surface is a portion of a cylinder. More...
virtual ISO  | IsIsoparametric (const ON_Curve &curve, const ON_Interval *curve_domain=nullptr) const
Test a 2d curve to see if it is iso parameteric in the surface's parameter space. More...
virtual ISO  | IsIsoparametric (const ON_BoundingBox &bbox) const
Test a 2d bounding box to see if it is iso parameteric in the surface's parameter space. More...
bool  | IsSolid () const
bool  | IsSphere (ON_Sphere *sphere=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
Determine if the surface is a portion of a sphere. More...
bool  | IsTorus (ON_Torus *torus=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
Determine if the surface is a portion of a torus. More...
ON_3dVector  | NormalAt (double, double) const
ON_NurbsSurface *  | NurbsSurface (ON_NurbsSurface *pNurbsSurface=nullptr, double tolerance=0.0, const ON_Interval *s_subdomain=nullptr, const ON_Interval *t_subdomain=nullptr) const
Get a NURBS surface representation of this surface. More...
ON::object_type  | ObjectType () const override
override ON_Object::ObjectType() - returns ON::surface_object More...
ON_Surface &  | operator= (const ON_Surface &)
ON_3dPoint  | PointAt (double, double) const
simple evaluation interface - no error handling More...
bool  | SetDomain (int dir, ON_Interval domain)
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
Get object's 3d axis aligned bounding box. More...
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
If this piece of geometry is a component in something larger, like an ON_BrepEdge in an ON_Brep, then this function returns the component index. More...
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
Get object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
Get corners of object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
virtual bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const
Get tight bounding box. More...
virtual bool  | IsDeformable () const
virtual bool  | MakeDeformable ()
If possible, converts the object into a form that can be accuratly modified with "squishy" transformations like projections, shears, an non-uniform scaling. More...
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Scale (double scale_factor)
Scales the object by the specified facotor. The scale is centered at the origin. More...
virtual bool  | SwapCoordinates (int i, int j)
Swaps object coordinate values with indices i and j. More...
bool  | Translate (const ON_3dVector &translation_vector)
Translates the object along the specified vector. More...
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
bool  | AttachUserData (class ON_UserData *pUserData)
Attach user data to an object. More...
unsigned int  | ClearAllComponentStates () const
Set all active level component states to ON_ComponentStatus::NoneSet. More...
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
Clear the specified states on every component. More...
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
Clear states on an individual component. More...
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
Expert user tool that copies user data items with positive values of ON_UserData.m_userdata_copycount from source_object to "this. More...
void  | CopyUserData (const ON_Object &source_object)
Calls CopyUserData(source_object,ON_Object::UserDataConflictResolution::source_object). More...
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
Delete the portions of the object identified in ci_list[]. More...
bool  | DetachUserData (class ON_UserData *pUserData)
Remove user data from an object. More...
void  | EmergencyDestroy ()
Sets m_user_data_list = 0. More...
class ON_UserData *  | FirstUserData () const
User data is stored as a linked list of ON_UserData classes. FirstUserData gets the first item in the linked list. This is the most recent item attached using AttachUserData(). Remark: To iterate through all the user data on an object, call FirstUserData() and then use ON_UserData::Next() to traverse the list. More...
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
Get a pointer to user data. More...
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
Get user string from the object. More...
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
Get a list of all user string keys on the object. More...
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
Get a list of all user strings on the object. More...
bool  | IsKindOf (const ON_ClassId *pClassId) const
Low level tool to test if an object is derived from a specified class. More...
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
virtual void  | MemoryRelocate ()
The MemoryRelocate() function is called when an object's location in memory is changed. For example, if an object resides in a chunk of memory that is grown by calling a realloc that has to allocate a new chunk and copy the contents of the old chunk to the new chunk, then the location of the object's memory changes. In practice this happens when classes derived from ON_Object are stored in dynamic arrays, like the default implementation of ON_ObjectArray<>'s that use realloc to grow the dynamic array. More...
virtual ON_UUID  | ModelObjectId () const
All objects in an opennurbs model have an id ( ON_Layer.m_layer_id, ON_Font.m_font_id, ON_Material.m_material_id, ON_3dmObjectAttributes.m_uuid ). More...
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
Expert user tool that moves user data items from source_object to "this. More...
void  | MoveUserData (ON_Object &source_object)
Calls MoveUserData(source_object,ON_Object::UserDataConflictResolution::source_object,true). More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
PurgeUserData() removes all user data from object. More...
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
Set states on an individual component. More...
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
Copy status settings to an individual component. More...
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
Attach a user string to the object. This information will perisist through copy construction, operator=, and file IO. More...
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
Append entries to the user string list More...
void  | TransformUserData (const class ON_Xform &xform)
Objects derived from ON_Geometry must call TransformUserData() in their Transform() member function. More...
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. More...
int  | UserStringCount () const
 Static Public Member Functions
static ON_RevSurface *  | New ()
Use ON_RevSurface::New(...) instead of new ON_RevSurface(...) More...
static ON_RevSurface *  | New (const ON_RevSurface &rev_surface)
 Public Attributes
ON_Interval  | m_angle
ON_Line  | m_axis
Axis of revolution. More...
ON_BoundingBox  | m_bbox
Bounding box of the surface of revolution. More...
bool  | m_bTransposed
ON_Curve *  | m_curve
ON_Interval  | m_t
 Additional Inherited Members
 Public Types inherited from ON_Surface
enum  | ISO {
 not_iso = 0, x_iso = 1, y_iso = 2, W_iso = 3,
 S_iso = 4, E_iso = 5, N_iso = 6, iso_count = 7
 }
pure virtual class for surface objects More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
When a userdata item is copied or moved from a source object to a destination object, the ON_Object::UserDataConflictResolution enum values specify how conficts are resolved. Remark: A userdata item "conflict" occurs when both the destination and source object have a user data item with the same value of ON_UserData::m_userdata_uuid. More...
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
Detailed Description
surface of revolution
Constructor & Destructor Documentation
◆ ON_RevSurface() [1/2]
 ON_RevSurface::ON_RevSurface  |  ( |   | )
◆ ~ON_RevSurface()
 ON_RevSurface::~ON_RevSurface  |  ( |   | )
◆ ON_RevSurface() [2/2]
 ON_RevSurface::ON_RevSurface  |  ( |  const ON_RevSurface &  |   | )
Member Function Documentation
◆ ClearBoundingBox()
 void ON_RevSurface::ClearBoundingBox  |  ( |   | )
overridevirtual
Some objects cache bounding box information. If you modify an object, then call ClearBoundingBox() to inform the object that any cached bounding boxes are invalid.
Generally, ClearBoundingBox() overrides simply invalidate a cached bounding box and then wait for a call to GetBBox() before recomputing the bounding box.
The default implementation does nothing.
Reimplemented from ON_Geometry.
◆ DataCRC()
 ON__UINT32 ON_RevSurface::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
virtual ON_Object::DataCRC override
Reimplemented from ON_Object.
◆ Degree()
 int ON_RevSurface::Degree  |  ( |  int  |   | ) |   const
overridevirtual
Implements ON_Surface.
◆ Destroy()
 void ON_RevSurface::Destroy  |  ( |   | )
◆ DestroyRuntimeCache()
 void ON_RevSurface::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
virtual ON_Object::DestroyRuntimeCache override
Reimplemented from ON_Object.
◆ Dimension()
 int ON_RevSurface::Dimension  |  ( |   | ) |   const
overridevirtual
Dimension of the object.
Returns
Dimension of the object.
The dimension is typically three. For parameter space trimming curves the dimension is two. In rare cases the dimension can be one or greater than three.
Reimplemented from ON_Geometry.
◆ Domain()
 ON_Interval ON_RevSurface::Domain  |  ( |  int  |   | ) |   const
overridevirtual
Implements ON_Surface.
◆ Dump()
 void ON_RevSurface::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
Creates a text dump of the object.
Dump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
The default implementations of this virtual function prints the class's name.
Reimplemented from ON_Object.
◆ Evaluate()
 bool ON_RevSurface::Evaluate  |  ( |  double  |  u,
|  double  |  v,
|  int  |  num_der,
|  int  |  array_stride,
|  double *  |  der_array,
|  int  |  quadrant = 0,
|  int *  |  hint = 0
) |   |  const
overridevirtual
work horse evaluator
Implements ON_Surface.
◆ Extend()
 bool ON_RevSurface::Extend  |  ( |  int  |  dir,
|  const ON_Interval &  |  domain
)
overridevirtual
Where possible, analytically extends surface to include domain.
Parameters
dir | [in] 0 new Domain(0) will include domain. (the first surface parameter). 1 new Domain(1) will include domain. (the second surface parameter).
domain | [in] if domain is not included in surface domain, surface will be extended so that its domain includes domain. Will not work if surface is closed in direction dir. Original surface is identical to the restriction of the resulting surface to the original surface domain,
Returns
true if successful.
Reimplemented from ON_Surface.
◆ GetBBox()
 bool ON_RevSurface::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
virtual ON_Geometry GetBBox override
Reimplemented from ON_Geometry.
◆ GetNextDiscontinuity()
 bool ON_RevSurface::GetNextDiscontinuity  |  ( |  int  |  dir,
|  ON::continuity  |  c,
|  double  |  t0,
|  double  |  t1,
|  double *  |  t,
|  int *  |  hint = nullptr,
|  int *  |  dtype = nullptr,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Search for a derivatitive, tangent, or curvature discontinuity.
Parameters
dir | [in] If 0, then "u" parameter is checked. If 1, then the "v" parameter is checked.
c | [in] type of continity to test for.
t0 | [in] Search begins at t0. If there is a discontinuity at t0, it will be ignored. This makes it possible to repeatedly call GetNextDiscontinuity and step through the discontinuities.
t1 | [in] (t0 != t1) If there is a discontinuity at t1 is will be ingored unless c is a locus discontinuity type and t1 is at the start or end of the curve.
t | [out] if a discontinuity is found, then *t reports the parameter at the discontinuity.
hint | [in/out] if GetNextDiscontinuity will be called repeatedly, passing a "hint" with initial value *hint=0 will increase the speed of the search.
dtype | [out] if not nullptr, *dtype reports the kind of discontinuity found at *t. A value of 1 means the first derivative or unit tangent was discontinuous. A value of 2 means the second derivative or curvature was discontinuous. A value of 0 means teh curve is not closed, a locus discontinuity test was applied, and t1 is at the start of end of the curve.
cos_angle_tolerance | [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported.
curvature_tolerance | [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous. If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported.
Returns
Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
true if a parametric discontinuity was found strictly
between t0 and t1. Note well that all curves are
parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
true if a locus discontinuity was found strictly between
t0 and t1 or at t1 is the at the end of a curve.
Note well that all open curves (IsClosed()=false) are locus
discontinuous at the ends of their domains.  All closed
curves (IsClosed()=true) are at least C0_locus_continuous at
the ends of their domains.
Reimplemented from ON_Surface.
◆ GetNurbForm()
 int ON_RevSurface::GetNurbForm  |  ( |  ON_NurbsSurface &  |  nurbs_surface,
|  double  |  tolerance = 0.0
) |   |  const
overridevirtual
Get a NURBS surface representation of this surface.
Parameters
nurbs_surface | [out] NURBS representation returned here
tolerance | [in] tolerance to use when creating NURBS representation.
s_subdomain | [in] if not nullptr, then the NURBS representation for this portion of the surface is returned.
t_subdomain | [in] if not nullptr, then the NURBS representation for this portion of the surface is returned.
Returns
0 unable to create NURBS representation with desired accuracy. 1 success - returned NURBS parameterization matches the surface's to wthe desired accuracy 2 success - returned NURBS point locus matches the surface's to the desired accuracy and the domain of the NURBS surface is correct. On However, This surface's parameterization and the NURBS surface parameterization may not match to the desired accuracy. This situation happens when getting NURBS representations of surfaces that have a transendental parameterization like spheres, cylinders, and cones.
This is a low-level virtual function. If you do not need the parameterization information provided by the return code, then ON_Surface::NurbsSurface may be easier to use.
See also
ON_Surface::NurbsSurface
Reimplemented from ON_Surface.
◆ GetNurbFormParameterFromSurfaceParameter()
 bool ON_RevSurface::GetNurbFormParameterFromSurfaceParameter  |  ( |  double  |  surface_s,
|  double  |  surface_t,
|  double *  |  nurbs_s,
|  double *  |  nurbs_t
) |   |  const
overridevirtual
Reimplemented from ON_Surface.
◆ GetParameterTolerance()
 bool ON_RevSurface::GetParameterTolerance  |  ( |  int  |  ,
|  double  |  ,
|  double *  |  ,
|  double *
) |   |  const
overridevirtual
Reimplemented from ON_Surface.
◆ GetSpanVector()
 bool ON_RevSurface::GetSpanVector  |  ( |  int  |  ,
|  double *
) |   |  const
overridevirtual
Implements ON_Surface.
◆ GetSurfaceParameterFromNurbFormParameter()
 bool ON_RevSurface::GetSurfaceParameterFromNurbFormParameter  |  ( |  double  |  nurbs_s,
|  double  |  nurbs_t,
|  double *  |  surface_s,
|  double *  |  surface_t
) |   |  const
overridevirtual
Reimplemented from ON_Surface.
◆ GetSurfaceSize()
 bool ON_RevSurface::GetSurfaceSize  |  ( |  double *  |  width,
|  double *  |  height
) |   |  const
overridevirtual
Get an estimate of the size of the rectangle that would be created if the 3d surface where flattened into a rectangle.
Parameters
width | [out] (corresponds to the first surface parameter)
height | [out] (corresponds to the first surface parameter)
Returns
true if successful.
overrides virtual ON_Surface::GetSurfaceSize
Reimplemented from ON_Surface.
◆ HasNurbForm()
 int ON_RevSurface::HasNurbForm  |  ( |   | ) |   const
overridevirtual
Is there a NURBS surface representation of this surface.
Returns
0 unable to create NURBS representation with desired accuracy. 1 success - NURBS parameterization matches the surface's 2 success - NURBS point locus matches the surface's and the domain of the NURBS surface is correct. However, This surface's parameterization and the NURBS surface parameterization may not match. This situation happens when getting NURBS representations of surfaces that have a transendental parameterization like spheres, cylinders, and cones.
This is a low-level virtual function.
See also
ON_Surface::GetNurbForm, ON_Surface::NurbsSurface
Reimplemented from ON_Surface.
◆ IsClosed()
 bool ON_RevSurface::IsClosed  |  ( |  int  |   | ) |   const
overridevirtual
Reimplemented from ON_Surface.
◆ IsConical()
 bool ON_RevSurface::IsConical  |  ( |  ON_Cone *  |  cone = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
Test a surface of revolution to see if it is a portion of a cone.
Parameters
cone | [out] if not nullptr and true is returned, the cone parameters are filled in.
tolerance | [in] tolerance to use when checking
Returns
true if the surface of revolution is a portion of a cone.
◆ IsContinuous()
 bool ON_RevSurface::IsContinuous  |  ( |  ON::continuity  |  c,
|  double  |  s,
|  double  |  t,
|  int *  |  hint = nullptr,
|  double  |  point_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d1_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d2_tolerance = ON_ZERO_TOLERANCE,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Test continuity at a surface parameter value.
Parameters
c | [in] continuity to test for
s | [in] surface parameter to test
t | [in] surface parameter to test
hint | [in] evaluation hint
point_tolerance | [in] if the distance between two points is greater than point_tolerance, then the surface is not C0.
d1_tolerance | [in] if the difference between two first derivatives is greater than d1_tolerance, then the surface is not C1.
d2_tolerance | [in] if the difference between two second derivatives is greater than d2_tolerance, then the surface is not C2.
cos_angle_tolerance | [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two normal vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported.
curvature_tolerance | [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous. If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported.
Returns
true if the surface has at least the c type continuity at the parameter t.
Overrides virtual ON_Surface::IsContinuous
Reimplemented from ON_Surface.
◆ IsCylindrical()
 bool ON_RevSurface::IsCylindrical  |  ( |  ON_Cylinder *  |  cylinder = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
Test a surface of revolution to see if it is a portion of a cylinder.
Parameters
cylinder | [out] if not nullptr and true is returned, the cylinder parameters are filled in.
tolerance | [in] tolerance to use when checking
Returns
true if the surface of revolution is a portion of a cylinder.
◆ IsoCurve()
 ON_Curve* ON_RevSurface::IsoCurve  |  ( |  int  |  dir,
|  double  |  c
) |   |  const
overridevirtual
Get isoparametric curve. Overrides virtual ON_Surface::IsoCurve.
Parameters
dir | [in] 0 first parameter varies and second parameter is constant e.g., point on IsoCurve(0,c) at t is srf(t,c) 1 first parameter is constant and second parameter varies e.g., point on IsoCurve(1,c) at t is srf(c,t)
c | [in] value of constant parameter
Returns
Isoparametric curve.
Reimplemented from ON_Surface.
◆ IsPeriodic()
 bool ON_RevSurface::IsPeriodic  |  ( |  int  |   | ) |   const
overridevirtual
Reimplemented from ON_Surface.
◆ IsPlanar()
 bool ON_RevSurface::IsPlanar  |  ( |  ON_Plane *  |  plane = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Test a surface to see if it is planar.
Parameters
plane | [out] if not nullptr and true is returned, the plane parameters are filled in.
tolerance | [in] tolerance to use when checking
Returns
true if there is a plane such that the maximum distance from the surface to the plane is <= tolerance.
Overrides virtual ON_Surface::IsPlanar.
Reimplemented from ON_Surface.
◆ IsSingular()
 bool ON_RevSurface::IsSingular  |  ( |  int  |   | ) |   const
overridevirtual
Reimplemented from ON_Surface.
◆ IsSpherical()
 bool ON_RevSurface::IsSpherical  |  ( |  ON_Sphere *  |  sphere = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
Test a surface of revolution to see if it is a portion of a sphere.
Parameters
sphere | [out] if not nullptr and true is returned, the sphere parameters are filled in.
tolerance | [in] tolerance to use when checking
Returns
true if the surface of revolution is a portion of a sphere.
◆ IsValid()
 bool ON_RevSurface::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Tests an object to see if its data members are correctly initialized.
Parameters
text_log | [in] if the object is not valid and text_log is not nullptr, then a brief englis description of the reason the object is not valid is appened to the log. The information appended to text_log is suitable for
low | level debugging purposes by programmers and is not intended to be useful as a high level user interface tool.
Returns
table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Geometry.
◆ New() [1/2]
 static ON_RevSurface* ON_RevSurface::New  |  ( |   | )
static
Use ON_RevSurface::New(...) instead of new ON_RevSurface(...)
Returns
Pointer to an ON_RevSurface. Destroy by calling delete.
See static ON_Brep* ON_Brep::New() for details.
◆ New() [2/2]
 static ON_RevSurface* ON_RevSurface::New  |  ( |  const ON_RevSurface &  |  rev_surface | )
static
◆ operator=()
 ON_RevSurface& ON_RevSurface::operator=  |  ( |  const ON_RevSurface &  |   | )
◆ Read()
 bool ON_RevSurface::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::ReadObject().
Parameters
binary_archive | archive to read from
Returns
Returns true if the read is successful.
Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ Reverse()
 bool ON_RevSurface::Reverse  |  ( |  int  |   | )
overridevirtual
Implements ON_Surface.
◆ SetAngleDegrees()
 bool ON_RevSurface::SetAngleDegrees  |  ( |  double  |  start_angle_degrees,
|  double  |  end_angle_degrees
)
◆ SetAngleRadians()
 bool ON_RevSurface::SetAngleRadians  |  ( |  double  |  start_angle_radians,
|  double  |  end_angle_radians
)
◆ SetDomain()
 bool ON_RevSurface::SetDomain  |  ( |  int  |  dir,
|  double  |  t0,
|  double  |  t1
)
overridevirtual
Reimplemented from ON_Surface.
◆ SizeOf()
 unsigned int ON_RevSurface::SizeOf  |  ( |   | ) |   const
overridevirtual
virtual ON_Object::SizeOf override
Reimplemented from ON_Object.
◆ SpanCount()
 int ON_RevSurface::SpanCount  |  ( |  int  |   | ) |   const
overridevirtual
Implements ON_Surface.
◆ Split()
 bool ON_RevSurface::Split  |  ( |  int  |  dir,
|  double  |  c,
|  ON_Surface *&  |  west_or_south_side,
|  ON_Surface *&  |  east_or_north_side
) |   |  const
overridevirtual
Splits (divides) the surface into two parts at the specified parameter.
Parameters
dir | [in] 0 The surface is split vertically. The "west" side is returned in "west_or_south_side" and the "east" side is returned in "east_or_north_side". 1 The surface is split horizontally. The "south" side is returned in "west_or_south_side" and the "north" side is returned in "east_or_north_side".
c | [in] value of constant parameter in interval returned by Domain(dir)
west_or_south_side | [out] west/south portion of surface returned here
east_or_north_side | [out] east/north portion of surface returned here
@verbatim
 ON_NurbsSurface srf = ...;
 int dir = 1;
 ON_RevSurface* south_side = 0;
 ON_RevSurface* north_side = 0;
 srf.Split( dir, srf.Domain(dir).Mid() south_side, north_side );
@endverbatim
Reimplemented from ON_Surface.
◆ Transform()
 bool ON_RevSurface::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
Transforms the object.
Parameters
xform | [in] transformation to apply to object. If xform.IsSimilarity() is zero, then you may want to call MakeSquishy() before calling Transform.
Classes derived from ON_Geometry should call ON_Geometry::Transform() to handle user data transformations and then transform their definition.
See also
ON_Geometry::IsDeformable();,
Reimplemented from ON_Geometry.
◆ Transpose()
 bool ON_RevSurface::Transpose  |  ( |   | )
overridevirtual
Implements ON_Surface.
◆ Trim()
 bool ON_RevSurface::Trim  |  ( |  int  |  dir,
|  const ON_Interval &  |  domain
)
overridevirtual
Removes the portions of the surface outside of the specified interval.
Parameters
dir | [in] 0 The domain specifies an sub-interval of Domain(0) (the first surface parameter). 1 The domain specifies an sub-interval of Domain(1) (the second surface parameter).
domain | [in] interval of the surface to keep. If dir is 0, then the portions of the surface with parameters (s,t) satisfying s < Domain(0).Min() or s > Domain(0).Max() are trimmed away. If dir is 1, then the portions of the surface with parameters (s,t) satisfying t < Domain(1).Min() or t > Domain(1).Max() are trimmed away.
Reimplemented from ON_Surface.
◆ Write()
 bool ON_RevSurface::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::WriteObject().
Parameters
binary_archive | archive to write to
Returns
Returns true if the write is successful.
Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
Member Data Documentation
◆ m_angle
 ON_Interval ON_RevSurface::m_angle
◆ m_axis
 ON_Line ON_RevSurface::m_axis
Axis of revolution.
◆ m_bbox
 ON_BoundingBox ON_RevSurface::m_bbox
Bounding box of the surface of revolution.
◆ m_bTransposed
 bool ON_RevSurface::m_bTransposed
◆ m_curve
 ON_Curve* ON_RevSurface::m_curve
◆ m_t
 ON_Interval ON_RevSurface::m_t