openNURBS SDK Help 6.0
 Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_PickPoint Class Reference
#include <opennurbs_xform.h>
 Public Member Functions
ON_PickPoint ()=default
ON_PickPoint (const ON_PickPoint &)=default
~ON_PickPoint ()=default
bool  | IsNotSet () const
bool  | IsSet () const
ON_PickPoint &  | operator= (const ON_PickPoint &)=default
 Static Public Member Functions
static int  | Compare (const ON_PickPoint &a, const ON_PickPoint &b)
 Public Attributes
double  | m_depth = ON_UNSET_VALUE
double  | m_distance = 1.0e300
ON_3dPoint  | m_point = ON_3dPoint::UnsetPoint
double  | m_t [4]
 Static Public Attributes
static const ON_PickPoint  | Unset
Constructor & Destructor Documentation
◆ ON_PickPoint() [1/2]
 ON_PickPoint::ON_PickPoint  |  ( |   | )
default
◆ ~ON_PickPoint()
 ON_PickPoint::~ON_PickPoint  |  ( |   | )
default
◆ ON_PickPoint() [2/2]
 ON_PickPoint::ON_PickPoint  |  ( |  const ON_PickPoint &  |   | )
default
Member Function Documentation
◆ Compare()
 static int ON_PickPoint::Compare  |  ( |  const ON_PickPoint &  |  a,
|  const ON_PickPoint &  |  b
)
static
Returns
+1: a is a better pick pont than b. -1: b is a better pick point than a. 0: a and b are the same.
◆ IsNotSet()
 bool ON_PickPoint::IsNotSet  |  ( |   | ) |   const
Returns
True if this is not set.
◆ IsSet()
 bool ON_PickPoint::IsSet  |  ( |   | ) |   const
Returns
True if this is set.
◆ operator=()
 ON_PickPoint& ON_PickPoint::operator=  |  ( |  const ON_PickPoint &  |   | )
default
Member Data Documentation
◆ m_depth
 double ON_PickPoint::m_depth = ON_UNSET_VALUE
◆ m_distance
 double ON_PickPoint::m_distance = 1.0e300
◆ m_point
 ON_3dPoint ON_PickPoint::m_point = ON_3dPoint::UnsetPoint
◆ m_t
 double ON_PickPoint::m_t[4]
◆ Unset
 const ON_PickPoint ON_PickPoint::Unset
static