openNURBS SDK Help 6.0
 Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_DisplayMaterialRef Class Reference
Objects can have per viewport display properties that override a viewport's default display properties. These overrides are stored on ON_3dmObjectAttributes as a list of ON_DisplayMaterialRefs. More...
#include <opennurbs_linestyle.h>
 Public Member Functions
ON_DisplayMaterialRef ()
Default constructor sets both ids to nil. More...
int  | Compare (const ON_DisplayMaterialRef &other) const
bool  | operator!= (const ON_DisplayMaterialRef &other) const
bool  | operator< (const ON_DisplayMaterialRef &other) const
bool  | operator<= (const ON_DisplayMaterialRef &other) const
bool  | operator== (const ON_DisplayMaterialRef &other) const
bool  | operator> (const ON_DisplayMaterialRef &other) const
bool  | operator>= (const ON_DisplayMaterialRef &other) const
 Public Attributes
ON_UUID  | m_display_material_id
ON_UUID  | m_viewport_id
 Static Public Attributes
static const ON_UUID  | m_invisible_in_detail_id
Detailed Description
Objects can have per viewport display properties that override a viewport's default display properties. These overrides are stored on ON_3dmObjectAttributes as a list of ON_DisplayMaterialRefs.
For example, by default a viewport
might display objects using a wireframe, but
one special object may need to be shaded.
In this case the special object would have
a display material ref with the "wireframe"
viewport's id and the id of a display material
that specified shading.
Constructor & Destructor Documentation
◆ ON_DisplayMaterialRef()
 ON_DisplayMaterialRef::ON_DisplayMaterialRef  |  ( |   | )
Default constructor sets both ids to nil.
Member Function Documentation
◆ Compare()
 int ON_DisplayMaterialRef::Compare  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
◆ operator!=()
 bool ON_DisplayMaterialRef::operator!=  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
◆ operator<()
 bool ON_DisplayMaterialRef::operator<  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
◆ operator<=()
 bool ON_DisplayMaterialRef::operator<=  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
◆ operator==()
 bool ON_DisplayMaterialRef::operator==  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
◆ operator>()
 bool ON_DisplayMaterialRef::operator>  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
◆ operator>=()
 bool ON_DisplayMaterialRef::operator>=  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
Member Data Documentation
◆ m_display_material_id
 ON_UUID ON_DisplayMaterialRef::m_display_material_id
◆ m_invisible_in_detail_id
 const ON_UUID ON_DisplayMaterialRef::m_invisible_in_detail_id
static
◆ m_viewport_id
 ON_UUID ON_DisplayMaterialRef::m_viewport_id