openNURBS SDK Help 6.0
 Public Member Functions | List of all members
ON_SimpleFixedSizePoolIterator< T > Class Template Reference
#include <opennurbs_fsp.h>
 Inheritance diagram for ON_SimpleFixedSizePoolIterator< T >:
 Public Member Functions
ON_SimpleFixedSizePoolIterator (const class ON_SimpleFixedSizePool< T > &fsp)
ON_SimpleFixedSizePoolIterator (const class ON_SimpleFixedSizePoolIterator< T > &)
T *  | CurrentElement ()
T *  | FirstBlock (size_t *block_element_count)
T *  | FirstElement ()
T *  | FirstElement (size_t element_index)
T *  | NextBlock (size_t *block_element_count)
T *  | NextElement ()
void  | Reset ()
Constructor & Destructor Documentation
◆ ON_SimpleFixedSizePoolIterator() [1/2]
 template<class T >
 ON_SimpleFixedSizePoolIterator< T >::ON_SimpleFixedSizePoolIterator  |  ( |  const class ON_SimpleFixedSizePool< T > &  |  fsp | )
◆ ON_SimpleFixedSizePoolIterator() [2/2]
 template<class T >
 ON_SimpleFixedSizePoolIterator< T >::ON_SimpleFixedSizePoolIterator  |  ( |  const class ON_SimpleFixedSizePoolIterator< T > &  |  fsp_it | )
Member Function Documentation
◆ CurrentElement()
 template<class T >
 T * ON_SimpleFixedSizePoolIterator< T >::CurrentElement  |  ( |   | )
Returns: The most recently returned value from a call to FirstElement() or NextElement(). Remarks: Do not make any calls to FirstBlock() or NextBlock() when using FirstElement() and NextElement() to iteratate through elements.
◆ FirstBlock()
 template<class T >
 T * ON_SimpleFixedSizePoolIterator< T >::FirstBlock  |  ( |  size_t *  |  block_element_count | )
Description: Get a pointer to the first element in the first block. Parameters: block_element_count - [out] (can be null) If not null, the number of elements allocated from the first block is returned in block_element_count. Note that if you have used ReturnElement(), some of these elemements may have been returned. Example: The loop will iteratate through all the blocks.
/ iterate through all blocks in the pool size_t block_element_count = 0; for ( void* p = FirstBlock(&block_element_count); 0 != p; p = NextBlock(&block_element_count) ) { ElementType* e = (ElementType*)p; for ( size_t i = 0; i < block_element_count; i++, e = ((const char*)e) + SizeofElement() ) { ... } }
Returns: The first block when iterating the list of blocks. Remarks: The heap for a fixed size memory pool is simply a linked list of blocks. FirstBlock() and NextBlock() can be used to iterate through the list of blocks.
Do not make any calls to FirstElement() or NextElement() when using FirstBlock() and NextBlock() to iteratate through blocks.
◆ FirstElement() [1/2]
 template<class T >
 T * ON_SimpleFixedSizePoolIterator< T >::FirstElement  |  ( |   | )
Description: Get the first element when iterating through the list of elements. Parameters: element_index - [in] If you use the version of FirstElement() that has an element_index parameter, then the iteration begins at that element. Example: The loop will iteratate through all the elements returned from AllocateElement(), including any that have be returned to the pool using ReturnElement().
/ iterate through all elements in the pool / This iteration will go through TotalElements() items. for ( void* p = FirstElement(); 0 != p; p = NextElement() ) { / If you are not using ReturnElement(), then you may process / "p" immediately. If you have used ReturnElement(), then you / must check some value in p located after the first sizeof(void*) / bytes to see if p is active. if ( p is not active ) continue;
... process p }
Returns: The first element when iterating through the list of elements. Remarks: FirstElement() and NextElement() will return elements that have been returned to the pool using ReturnElement(). If you use ReturnElement(), then be sure to mark the element so it can be identified and skipped.
Do not make any calls to FirstBlock() or NextBlock() when using FirstElement() and NextElement() to iteratate through elements.
◆ FirstElement() [2/2]
 template<class T >
 T * ON_SimpleFixedSizePoolIterator< T >::FirstElement  |  ( |  size_t  |  element_index | )
◆ NextBlock()
 template<class T >
 T * ON_SimpleFixedSizePoolIterator< T >::NextBlock  |  ( |  size_t *  |  block_element_count | )
Description: Get the next block when iterating through the blocks. Parameters: block_element_count - [out] (can be null) If not null, the number of elements allocated from the block is returned in block_element_count. Note that if you have used ReturnElement(), some of these elemements may have been returned. Example: See the FirstBlock() documentation. Returns: The next block when iterating through the blocks. Remarks: Do not make any calls to FirstElement() or NextElement() when using FirstBlock() and NextBlock() to iteratate through blocks.
◆ NextElement()
 template<class T >
 T * ON_SimpleFixedSizePoolIterator< T >::NextElement  |  ( |   | )
Description: Get the next element when iterating through the list of elements. If FirstElement() is not called, then the first call to NextElement() returns the first element. Example: See the FirstElement() documentation. Returns: The next element when iterating through the list of elements. Remarks: FirstElement() and NextElement() will return elements that have been returned to the pool using ReturnElement(). If you use ReturnElement(), then be sure to mark the element so it can be identified and skipped.
Do not make any calls to FirstBlock() or NextBlock() when using FirstElement() and NextElement() to iteratate through elements.
◆ Reset()
 template<class T >
 void ON_SimpleFixedSizePoolIterator< T >::Reset  |  ( |   | )
Description: Sets the state of the iterator to the initail state that exists after construction. This is useful if the iterator has been used the get one or more elements and then the referenced fixed size pool is modified or code wants to begin iteration again a used a call to NextElement() to return the first element.