Public Member Functions | Public Attributes | List of all members
ON_PolylineCurve Class Reference
#include <opennurbs_polylinecurve.h>
 Inheritance diagram for ON_PolylineCurve:
 Public Member Functions
ON_PolylineCurve () ON_NOEXCEPT
ON_PolylineCurve (const ON_PolylineCurve &)
ON_PolylineCurve (const ON_3dPointArray &, const ON_SimpleArray< double > &)
Construct polyline from points and parameters. More...
ON_PolylineCurve (const ON_3dPointArray &)
virtual  | ~ON_PolylineCurve ()
bool  | Append (const ON_PolylineCurve &)
bool  | ChangeClosedCurveSeam (double t) override
bool  | ChangeDimension (int desired_dimension) override
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree () const override
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain () const override
ON_Curve overrides. More...
void  | Dump (ON_TextLog &dump) const override
void  | EmergencyDestroy ()
bool  | Evaluate (double, int, int, double *, int=0, int *=0) const override
bool  | Extend (const ON_Interval &domain) override
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetCurveParameterFromNurbFormParameter (double, double *) const override
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override More...
bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
int  | GetNurbForm (ON_NurbsCurve &, double=0.0, const ON_Interval *=nullptr) const override
bool  | GetNurbFormParameterFromCurveParameter (double, double *) const override
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override More...
bool  | GetSpanVector (double *knot_values) const override
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override More...
int  | HasNurbForm () const override
bool  | IsArc (const ON_Plane *plane=nullptr, ON_Arc *arc=nullptr, double tolerance=ON_ZERO_TOLERANCE) const override
bool  | IsClosed () const override
bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
bool  | IsDeformable () const override
virtual ON_Geometry::IsDeformable() override More...
bool  | IsInPlane (const ON_Plane &test_plane, double tolerance=ON_ZERO_TOLERANCE) const override
bool  | IsLinear (double tolerance=ON_ZERO_TOLERANCE) const override
bool  | IsPeriodic (void) const override
bool  | IsPlanar (ON_Plane *plane=nullptr, double tolerance=ON_ZERO_TOLERANCE) const override
int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const override
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
bool  | MakeDeformable () override
virtual ON_Geometry::MakeDeformable() override More...
ON_PolylineCurve &  | operator= (const ON_PolylineCurve &)
ON_PolylineCurve &  | operator= (const ON_3dPointArray &)
bool  | ParameterSearch (double t, int &index, bool bEnableSnap) const
int  | PointCount () const
Interface. More...
bool  | Read (ON_BinaryArchive &binary_archive) override
bool  | Reverse () override
bool  | SetDomain (double t0, double t1) override
bool  | SetEndPoint (ON_3dPoint end_point) override
virtual More...
bool  | SetStartPoint (ON_3dPoint start_point) override
virtual More...
unsigned int  | SizeOf () const override
ON_Object overrides. More...
int  | SpanCount () const override
bool  | Split (double, ON_Curve *&, ON_Curve *&) const override
bool  | SwapCoordinates (int i, int j) override
bool  | Transform (const ON_Xform &xform) override
bool  | Trim (const ON_Interval &) override
bool  | Write (ON_BinaryArchive &binary_archive) const override
 Public Member Functions inherited from ON_Curve
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
ON_3dVector  | CurvatureAt (double t) const
ON_3dVector  | DerivativeAt (double t) const
void  | DestroyCurveTree ()
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
virtual ON_Curve *  | DuplicateCurve () const
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetParameterTolerance (double t, double *tminus, double *tplus) const
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
ON::object_type  | ObjectType () const override
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
ON_3dPoint  | PointAtEnd () const
ON_3dPoint  | PointAtStart () const
bool  | SetDomain (ON_Interval domain)
ON_3dVector  | TangentAt (double t) const
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
virtual bool  | HasBrepForm () const
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
void  | CopyUserData (const ON_Object &source_object)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
void  | MoveUserData (ON_Object &source_object)
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Public Attributes
int  | m_dim
2 or 3 (2 so ON_PolylineCurve can be uses as a trimming curve) More...
ON_Polyline  | m_pline
ON_SimpleArray< double >  | m_t
parameters More...
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
 Protected Member Functions inherited from ON_Curve
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
Constructor & Destructor Documentation
◆ ON_PolylineCurve() [1/4]
 ON_PolylineCurve::ON_PolylineCurve  |  ( |   | )
◆ ~ON_PolylineCurve()
 virtual ON_PolylineCurve::~ON_PolylineCurve  |  ( |   | )
virtual
◆ ON_PolylineCurve() [2/4]
 ON_PolylineCurve::ON_PolylineCurve  |  ( |  const ON_PolylineCurve &  |   | )
◆ ON_PolylineCurve() [3/4]
 ON_PolylineCurve::ON_PolylineCurve  |  ( |  const ON_3dPointArray &  |  ,
|  const ON_SimpleArray< double > &
)
Construct polyline from points and parameters.
◆ ON_PolylineCurve() [4/4]
 ON_PolylineCurve::ON_PolylineCurve  |  ( |  const ON_3dPointArray &  |   | )
Member Function Documentation
◆ Append()
 bool ON_PolylineCurve::Append  |  ( |  const ON_PolylineCurve &  |   | )
◆ ChangeClosedCurveSeam()
 bool ON_PolylineCurve::ChangeClosedCurveSeam  |  ( |  double  |  t | )
overridevirtual
Description: If this curve is closed, then modify it so that the start/end point is at curve parameter t. Parameters: t - [in] curve parameter of new start/end point. The returned curves domain will start at t. Returns: true if successful. Remarks: Overrides virtual ON_Curve::ChangeClosedCurveSeam
Reimplemented from ON_Curve.
◆ ChangeDimension()
 bool ON_PolylineCurve::ChangeDimension  |  ( |  int  |  desired_dimension | )
overridevirtual
Description: Change the dimension of a curve. Parameters: desired_dimension - [in] Returns: true if the curve's dimension was already desired_dimension or if the curve's dimension was successfully changed to desired_dimension.
Reimplemented from ON_Curve.
◆ DataCRC()
 ON__UINT32 ON_PolylineCurve::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
virtual ON_Object::DataCRC override
Reimplemented from ON_Object.
◆ Degree()
 int ON_PolylineCurve::Degree  |  ( |   | ) |   const
overridevirtual
Description: virtual ON_Curve::Degree override. Returns: 1
Implements ON_Curve.
◆ Dimension()
 int ON_PolylineCurve::Dimension  |  ( |   | ) |   const
overridevirtual
ON_Geometry overrides.
Description: virtual ON_Geometry::Dimension override Returns: value of m_dim
Reimplemented from ON_Geometry.
◆ Domain()
 ON_Interval ON_PolylineCurve::Domain  |  ( |   | ) |   const
overridevirtual
ON_Curve overrides.
Description: virtual ON_Curve::Domain override. Returns: domain of the polyline curve.
Implements ON_Curve.
◆ Dump()
 void ON_PolylineCurve::Dump  |  ( |  ON_TextLog &  |  dump | ) |   const
overridevirtual
Description: virtual ON_Object::Dump override
Reimplemented from ON_Object.
◆ EmergencyDestroy()
 void ON_PolylineCurve::EmergencyDestroy  |  ( |   | )
Description: Call if memory used by ON_PolylineCurve becomes invalid.
◆ Evaluate()
 bool ON_PolylineCurve::Evaluate  |  ( |  double  |  t,
|  int  |  der_count,
|  int  |  v_stride,
|  double *  |  v,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
overridevirtual
Description: This evaluator actually does all the work. The other ON_Curve evaluation tools call this virtual function. Parameters: t - [in] evaluation parameter ( usually in Domain() ). der_count - [in] (>=0) number of derivatives to evaluate v_stride - [in] (>=Dimension()) stride to use for the v[] array v - [out] array of length (der_count+1)*v_stride curve(t) is returned in (v[0],...,v[m_dim-1]), curve'(t) is retuned in (v[v_stride],...,v[v_stride+m_dim-1]), curve"(t) is retuned in (v[2*v_stride],...,v[2*v_stride+m_dim-1]), etc. side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::EvPoint ON_Curve::Ev1Der ON_Curve::Ev2Der
Parameters
t | returns false if unable to evaluate evaluation parameter
der_count | number of derivatives (>=0)
v_stride | array stride (>=Dimension())
v | array of length stride*(ndir+1)
side | optional - determines which side to evaluate from 0 = default < 0 to evaluate from below, > 0 to evaluate from above
hint | optional - evaluation hint (int) used to speed repeated evaluations
Implements ON_Curve.
◆ Extend()
 bool ON_PolylineCurve::Extend  |  ( |  const ON_Interval &  |  domain | )
overridevirtual
Description: Where possible, analytically extends curve to include domain. Parameters: domain - [in] if domain is not included in curve domain, curve will be extended so that its domain includes domain.
 Will not work if curve is closed. Original curve is identical to the restriction of the resulting curve to the original curve domain, Returns: true if successful.
Reimplemented from ON_Curve.
◆ GetBBox()
 bool ON_PolylineCurve::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
virtual ON_Geometry GetBBox override
Reimplemented from ON_Geometry.
◆ GetCurveParameterFromNurbFormParameter()
 bool ON_PolylineCurve::GetCurveParameterFromNurbFormParameter  |  ( |  double  |  ,
|  double *
) |   |  const
overridevirtual
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override
Reimplemented from ON_Curve.
◆ GetNextDiscontinuity()
 bool ON_PolylineCurve::GetNextDiscontinuity  |  ( |  ON::continuity  |  c,
|  double  |  t0,
|  double  |  t1,
|  double *  |  t,
|  int *  |  hint = nullptr,
|  int *  |  dtype = nullptr,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Description: Search for a derivatitive, tangent, or curvature discontinuity. Parameters: c - [in] type of continity to test for. If ON::continuity::C1_continuous t0 - [in] search begins at t0 t1 - [in] (t0 < t1) search ends at t1 t - [out] if a discontinuity is found, the *t reports the parameter at the discontinuity. hint - [in/out] if GetNextDiscontinuity will be called repeatedly, passing a "hint" with initial value *hint=0 will increase the speed of the search.
 dtype - [out] if not nullptr, *dtype reports the kind of discontinuity found at *t. A value of 1 means the first derivative or unit tangent was discontinuous. A value of 2 means the second derivative or curvature was discontinuous. cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous or ON::continuity::Gsmooth_continuous.
 ON::continuity::G2_continuous: If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. ON::continuity::Gsmooth_continuous: If K0 and K1 are curvatures evaluated from above and below and the angle between K0 and K1 is at least twice angle tolerance or ||K0| - |K1|| > (max(|K0|,|K1|) > curvature_tolerance, then a curvature discontinuity is reported. Returns: true if a discontinuity was found on the interior of the interval (t0,t1). Remarks: Overrides ON_Curve::GetNextDiscontinuity.
Reimplemented from ON_Curve.
◆ GetNurbForm()
 int ON_PolylineCurve::GetNurbForm  |  ( |  ON_NurbsCurve &  |  nurbs_curve,
|  double  |  tolerance = 0.0,
|  const ON_Interval *  |  subdomain = nullptr
) |   |  const
overridevirtual
Description: Get a NURBS curve representation of this curve. Parameters: nurbs_curve - [out] NURBS representation returned here tolerance - [in] tolerance to use when creating NURBS representation. subdomain - [in] if not nullptr, then the NURBS representation for this portion of the curve is returned. Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - returned NURBS parameterization matches the curve's to wthe desired accuracy 2 success - returned NURBS point locus matches the curve's to the desired accuracy and the domain of the NURBS curve is correct. On However, This curve's parameterization and the NURBS curve parameterization may not match to the desired accuracy. This situation happens when getting NURBS representations of curves that have a transendental parameterization like circles Remarks: This is a low-level virtual function. If you do not need the parameterization information provided by the return code, then ON_Curve::NurbsCurve may be easier to use. See Also: ON_Curve::NurbsCurve
Parameters
nurbs_curve | returns 0: unable to create NURBS representation with desired accuracy. 1: success - returned NURBS parameterization matches the curve's to wthe desired accuracy 2: success - returned NURBS point locus matches the curve's to the desired accuracy but, on the interior of the curve's domain, the curve's parameterization and the NURBS parameterization may not match to the desired accuracy.
subdomain | OPTIONAL subdomain of polyline
Reimplemented from ON_Curve.
◆ GetNurbFormParameterFromCurveParameter()
 bool ON_PolylineCurve::GetNurbFormParameterFromCurveParameter  |  ( |  double  |  ,
|  double *
) |   |  const
overridevirtual
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override
Reimplemented from ON_Curve.
◆ GetSpanVector()
 bool ON_PolylineCurve::GetSpanVector  |  ( |  double *  |  knot_values | ) |   const
overridevirtual
Description: virtual ON_Curve::GetSpanVector override. Get list of parameters at polyline points. Parameters: knot_values - [out] an array of length SpanCount()+1 is filled in with the parameter values. knot_values[i] is the parameter for the point m_pline[i]. Returns: true if successful
Implements ON_Curve.
◆ GetTightBoundingBox()
 bool ON_PolylineCurve::GetTightBoundingBox  |  ( |  class ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const class ON_Xform *  |  xform = nullptr
) |   |  const
overridevirtual
virtual ON_Geometry GetTightBoundingBox override
Reimplemented from ON_Curve.
◆ HasNurbForm()
 int ON_PolylineCurve::HasNurbForm  |  ( |   | ) |   const
overridevirtual
Description: Does a NURBS curve representation of this curve. Parameters: Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - NURBS parameterization matches the curve's to wthe desired accuracy 2 success - NURBS point locus matches the curve's and the domain of the NURBS curve is correct.
 However, This curve's parameterization and the NURBS curve parameterization may not match. This situation happens when getting NURBS representations of curves that have a transendental parameterization like circles Remarks: This is a low-level virtual function.
 See Also: ON_Curve::GetNurbForm ON_Curve::NurbsCurve
Reimplemented from ON_Curve.
◆ IsArc()
 bool ON_PolylineCurve::IsArc  |  ( |  const ON_Plane *  |  plane = nullptr,
|  ON_Arc *  |  arc = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: virtual ON_Curve::IsArc override. Returns: false for all polylines.
Reimplemented from ON_Curve.
◆ IsClosed()
 bool ON_PolylineCurve::IsClosed  |  ( |   | ) |   const
overridevirtual
Description: virtual ON_Curve::IsClosed override. Returns: true if the polyline has 4 or more point, the first point and the last point are equal, and some other point is distinct from the first and last point.
Reimplemented from ON_Curve.
◆ IsContinuous()
 bool ON_PolylineCurve::IsContinuous  |  ( |  ON::continuity  |  c,
|  double  |  t,
|  int *  |  hint = nullptr,
|  double  |  point_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d1_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d2_tolerance = ON_ZERO_TOLERANCE,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Description: Test continuity at a curve parameter value. Parameters: c - [in] continuity to test for t - [in] parameter to test hint - [in] evaluation hint point_tolerance - [in] if the distance between two points is greater than point_tolerance, then the curve is not C0. d1_tolerance - [in] if the difference between two first derivatives is greater than d1_tolerance, then the curve is not C1. d2_tolerance - [in] if the difference between two second derivatives is greater than d2_tolerance, then the curve is not C2. cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous or ON::continuity::Gsmooth_continuous.
 ON::continuity::G2_continuous: If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. ON::continuity::Gsmooth_continuous: If K0 and K1 are curvatures evaluated from above and below and the angle between K0 and K1 is at least twice angle tolerance or ||K0| - |K1|| > (max(|K0|,|K1|) > curvature_tolerance, then a curvature discontinuity is reported. Returns: true if the curve has at least the c type continuity at the parameter t. Remarks: Overrides ON_Curve::IsContinuous.
Reimplemented from ON_Curve.
◆ IsDeformable()
 bool ON_PolylineCurve::IsDeformable  |  ( |   | ) |   const
overridevirtual
virtual ON_Geometry::IsDeformable() override
Reimplemented from ON_Geometry.
◆ IsInPlane()
 bool ON_PolylineCurve::IsInPlane  |  ( |  const ON_Plane &  |  test_plane,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: virtual ON_Curve::IsInPlane override. Returns: true if every point in the polyline is within tolerance of the test_plane.
Implements ON_Curve.
◆ IsLinear()
 bool ON_PolylineCurve::IsLinear  |  ( |  double  |  tolerance = ON_ZERO_TOLERANCE | ) |   const
overridevirtual
Description: virtual ON_Curve::IsLinear override. Returns: true if all the polyline points are within tolerance of the line segment connecting the ends of the polyline.
Reimplemented from ON_Curve.
◆ IsPeriodic()
 bool ON_PolylineCurve::IsPeriodic  |  ( |  void  |   | ) |   const
overridevirtual
Description: virtual ON_Curve::IsPeriodic override. Returns: false for all polylines.
Reimplemented from ON_Curve.
◆ IsPlanar()
 bool ON_PolylineCurve::IsPlanar  |  ( |  ON_Plane *  |  plane = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: virtual ON_Curve::IsPlanar override. Returns: true if the polyline is planar.
Reimplemented from ON_Curve.
◆ IsPolyline()
 int ON_PolylineCurve::IsPolyline  |  ( |  ON_SimpleArray< ON_3dPoint > *  |  pline_points = nullptr,
|  ON_SimpleArray< double > *  |  pline_t = nullptr
) |   |  const
overridevirtual
Description: Several types of ON_Curve can have the form of a polyline including a degree 1 ON_NurbsCurve, an ON_PolylineCurve, and an ON_PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline. Parameters: pline_points - [out] if not nullptr and true is returned, then the points of the polyline form are returned here. t - [out] if not nullptr and true is returned, then the parameters of the polyline points are returned here. Returns: table 0 curve is not some form of a polyline >=2 number of points in polyline form
Reimplemented from ON_Curve.
◆ IsValid()
 bool ON_PolylineCurve::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Description: Tests an object to see if its data members are correctly initialized. Parameters: text_log - [in] if the object is not valid and text_log is not nullptr, then a brief englis description of the reason the object is not valid is appened to the log. The information appended to text_log is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Returns: table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Geometry.
◆ MakeDeformable()
 bool ON_PolylineCurve::MakeDeformable  |  ( |   | )
overridevirtual
virtual ON_Geometry::MakeDeformable() override
Reimplemented from ON_Geometry.
◆ operator=() [1/2]
 ON_PolylineCurve& ON_PolylineCurve::operator=  |  ( |  const ON_PolylineCurve &  |   | )
◆ operator=() [2/2]
 ON_PolylineCurve& ON_PolylineCurve::operator=  |  ( |  const ON_3dPointArray &  |   | )
◆ ParameterSearch()
 bool ON_PolylineCurve::ParameterSearch  |  ( |  double  |  t,
|  int &  |  index,
|  bool  |  bEnableSnap
) |   |  const
Description: Lookup a parameter in the m_t array, optionally using a built in snap tolerance to snap a parameter value to an element of m_t. Parameters: t - [in] parameter index -[out] index into m_t such that if function returns false then value of index is
 @table
 value of index              condition
  -1                                      t<m_t[0] or m_t is empty
      0<=i<=m_t.Count()-2       m_t[i] < t < m_t[i+1]
      m_t.Count()-1                 t>m_t[ m_t.Count()-1]
if the function returns true then t is equal to, or is closest to and
within  tolerance of m_t[index].
bEnableSnap-[in] enable snapping
 Returns:
 true if the t is exactly equal to, or within tolerance of (only if bEnableSnap==true) m_t[index].
◆ PointCount()
 int ON_PolylineCurve::PointCount  |  ( |   | ) |   const
Interface.
number of points in polyline
◆ Read()
 bool ON_PolylineCurve::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Description: virtual ON_Object::Read override
Reimplemented from ON_Object.
◆ Reverse()
 bool ON_PolylineCurve::Reverse  |  ( |   | )
overridevirtual
Description: virtual ON_Curve::Reverse override. Reverse parameterizatrion by negating all m_t values and reversing the order of the m_pline points. Remarks: Domain changes from [a,b] to [-b,-a]
Implements ON_Curve.
◆ SetDomain()
 bool ON_PolylineCurve::SetDomain  |  ( |  double  |  t0,
|  double  |  t1
)
overridevirtual
Description: virtual ON_Curve::SetDomain override. Set the domain of the curve Parameters: t0 - [in] t1 - [in] new domain will be [t0,t1] Returns: true if successful.
Reimplemented from ON_Curve.
◆ SetEndPoint()
 bool ON_PolylineCurve::SetEndPoint  |  ( |  ON_3dPoint  |  end_point | )
overridevirtual
virtual
Description: Force the curve to end at a specified point. Parameters: end_point - [in] Returns: true if successful. Remarks: Some end points cannot be moved. Be sure to check return code. See Also: ON_Curve::SetStartPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
Reimplemented from ON_Curve.
◆ SetStartPoint()
 bool ON_PolylineCurve::SetStartPoint  |  ( |  ON_3dPoint  |  start_point | )
overridevirtual
virtual
Description: Force the curve to start at a specified point. Parameters: start_point - [in] Returns: true if successful. Remarks: Some start points cannot be moved. Be sure to check return code. See Also: ON_Curve::SetEndPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
Reimplemented from ON_Curve.
◆ SizeOf()
 unsigned int ON_PolylineCurve::SizeOf  |  ( |   | ) |   const
overridevirtual
ON_Object overrides.
virtual ON_Object::SizeOf override
Reimplemented from ON_Curve.
◆ SpanCount()
 int ON_PolylineCurve::SpanCount  |  ( |   | ) |   const
overridevirtual
Description: virtual ON_Curve::SpanCount override. Get number of segments in polyline. Returns: Number of segments in polyline.
Implements ON_Curve.
◆ Split()
 bool ON_PolylineCurve::Split  |  ( |  double  |  ,
|  ON_Curve *&  |  ,
|  ON_Curve *&
) |   |  const
overridevirtual
Description: virtual ON_Curve::Split override.
Split() divides the polyline at the specified parameter. The parameter must be in the interior of the curve's domain. The pointers passed to ON_NurbsCurve::Split must either be nullptr or point to an ON_NurbsCurve. If the pointer is nullptr, then a curve will be created in Split(). You may pass "this" as one of the pointers to Split(). For example,
ON_NurbsCurve right_side; crv.Split( crv.Domain().Mid() &crv, &right_side );
would split crv at the parametric midpoint, put the left side in crv, and return the right side in right_side.
Reimplemented from ON_Curve.
◆ SwapCoordinates()
 bool ON_PolylineCurve::SwapCoordinates  |  ( |  int  |  i,
|  int  |  j
)
overridevirtual
Description: virtual ON_Geometry::SwapCoordinates override. Swaps control point coordinate values with indices i and j. Parameters: i - [in] coordinate index j - [in] coordinate index
Reimplemented from ON_Geometry.
◆ Transform()
 bool ON_PolylineCurve::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
Description: virtual ON_Geometry::Transform override. Transforms the NURBS curve.
Parameters: xform - [in] transformation to apply to object.
Remarks: When overriding this function, be sure to include a call to ON_Object::TransformUserData() which takes care of transforming any ON_UserData that may be attached to the object.
Reimplemented from ON_Curve.
◆ Trim()
 bool ON_PolylineCurve::Trim  |  ( |  const ON_Interval &  |   | )
overridevirtual
Description: virtual ON_Curve::Trim override.
Reimplemented from ON_Curve.
◆ Write()
 bool ON_PolylineCurve::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Description: virtual ON_Object::Write override
Reimplemented from ON_Object.
Member Data Documentation
◆ m_dim
 int ON_PolylineCurve::m_dim
2 or 3 (2 so ON_PolylineCurve can be uses as a trimming curve)
◆ m_pline
 ON_Polyline ON_PolylineCurve::m_pline
◆ m_t
 ON_SimpleArray<double> ON_PolylineCurve::m_t
parameters