Public Member Functions | List of all members
ON_4fPointArray Class Reference
#include <opennurbs_point.h>
 Inheritance diagram for ON_4fPointArray:
 Public Member Functions
ON_4fPointArray ()
see ON_SimpleArray class definition comments for constructor documentation More...
ON_4fPointArray (int)
ON_4fPointArray (const ON_4fPointArray &)
ON_4fPointArray &  | operator= (const ON_4fPointArray &)
bool  | SwapCoordinates (int, int)
bool  | Transform (const ON_Xform &)
 Public Member Functions inherited from ON_SimpleArray< ON_4fPoint >
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< ON_4fPoint > &)
Copy constructor. More...
ON_SimpleArray (size_t)
virtual  | ~ON_SimpleArray ()
void  | Append (const ON_4fPoint &)
void  | Append (int, const ON_4fPoint *)
ON_4fPoint &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_4fPoint *  | Array ()
const ON_4fPoint *  | Array () const
ON_4fPoint *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
ON_4fPoint *  | At (unsigned int)
ON_4fPoint *  | At (ON__INT64)
ON_4fPoint *  | At (ON__UINT64)
const ON_4fPoint *  | At (int) const
const ON_4fPoint *  | At (unsigned int) const
const ON_4fPoint *  | At (ON__INT64) const
const ON_4fPoint *  | At (ON__UINT64) const
int  | BinarySearch (const ON_4fPoint *, int(*)(const ON_4fPoint *, const ON_4fPoint *)) const
int  | BinarySearch (const ON_4fPoint *, int(*)(const ON_4fPoint *, const ON_4fPoint *), int) const
int  | Capacity () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Empty ()
ON_4fPoint *  | First ()
const ON_4fPoint *  | First () const
bool  | HeapSort (int(*)(const ON_4fPoint *, const ON_4fPoint *))
void  | Insert (int, const ON_4fPoint &)
ON_4fPoint *  | KeepArray ()
Expert user tool to take charge of the memory used by the dyanmic array. More...
ON_4fPoint *  | Last ()
const ON_4fPoint *  | Last () const
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const ON_4fPoint * () const
operator ON_4fPoint * ()
ON_SimpleArray< ON_4fPoint > &  | operator= (const ON_SimpleArray< ON_4fPoint > &)
ON_4fPoint &  | operator[] (int)
ON_4fPoint &  | operator[] (unsigned int)
ON_4fPoint &  | operator[] (ON__INT64)
ON_4fPoint &  | operator[] (ON__UINT64)
const ON_4fPoint &  | operator[] (int) const
const ON_4fPoint &  | operator[] (unsigned int) const
const ON_4fPoint &  | operator[] (ON__INT64) const
const ON_4fPoint &  | operator[] (ON__UINT64) const
bool  | Permute (const int *)
bool  | QuickSort (int(*)(const ON_4fPoint *, const ON_4fPoint *))
virtual ON_4fPoint *  | Realloc (ON_4fPoint *, int)
low level memory managment ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
ON_4fPoint *  | Reserve (size_t)
memory managment //////////////////////////////////////////////////// More...
void  | Reverse ()
int  | Search (const ON_4fPoint &) const
int  | Search (const ON_4fPoint *, int(*)(const ON_4fPoint *, const ON_4fPoint *)) const
void  | SetArray (ON_4fPoint *)
Do not use this version of SetArray(). Use the one that takes a pointer, count and capacity. More...
void  | SetArray (ON_4fPoint *, int, int)
Expert user tool to set the memory used by the dyanmic array. More...
ON_4fPoint *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory managment ////////////////////////////////////////// More...
void  | Shrink ()
unsigned int  | SizeOfArray () const
unsigned int  | SizeOfElement () const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_4fPoint *, const ON_4fPoint *)) const
Sort() fills in the index[] array so that array[index[i]] <= array[index[i+1]]. The array is not modified. More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_4fPoint *, const ON_4fPoint *, void *), void *) const
Sort() fills in the index[] array so that array[index[i]] <= array[index[i+1]]. The array is not modified. More...
void  | Swap (int, int)
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_SimpleArray< ON_4fPoint >
void  | Move (int, int, int)
implimentation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< ON_4fPoint >
ON_4fPoint *  | m_a
int  | m_capacity
int  | m_count
Constructor & Destructor Documentation
◆ ON_4fPointArray() [1/3]
 ON_4fPointArray::ON_4fPointArray  |  ( |   | )
see ON_SimpleArray class definition comments for constructor documentation
◆ ON_4fPointArray() [2/3]
 ON_4fPointArray::ON_4fPointArray  |  ( |  int  |   | )
◆ ON_4fPointArray() [3/3]
 ON_4fPointArray::ON_4fPointArray  |  ( |  const ON_4fPointArray &  |   | )
Member Function Documentation
◆ operator=()
 ON_4fPointArray& ON_4fPointArray::operator=  |  ( |  const ON_4fPointArray &  |   | )
◆ SwapCoordinates()
 bool ON_4fPointArray::SwapCoordinates  |  ( |  int  |  ,
|  int
)
◆ Transform()
 bool ON_4fPointArray::Transform  |  ( |  const ON_Xform &  |   | )