openNURBS SDK Help 6.0
 Public Member Functions | Public Attributes | Friends | List of all members
ON_PolyEdgeSegment Class Reference
#include <opennurbs_polyedgecurve.h>
 Inheritance diagram for ON_PolyEdgeSegment:
 Public Member Functions
ON_PolyEdgeSegment ()
construction More...
~ON_PolyEdgeSegment ()
const ON_Brep *  | Brep () const
const ON_BrepEdge *  | BrepEdge () const
const ON_BrepFace *  | BrepFace () const
const ON_BrepTrim *  | BrepTrim () const
bool  | Create (const ON_BrepTrim *trim, const ON_UUID &object_id)
Creates a polyedge segment that uses the entire edge and has the same domain as the edge. More...
bool  | Create (const ON_Curve *curve, const ON_UUID &object_id)
Creates a polyedge segment that uses the entire curve and has the same domain as the curve. More...
void  | DestroyRuntimeCache (bool bDelete=true) override
default copy constructor and operator= are fine. More...
ON_Curve *  | DuplicateCurve () const override
virtual ON_Curve::DuplicateCurve override More...
ON_Interval  | EdgeDomain () const
double  | EdgeParameter (double t) const
bool  | IsClosed () const override
virtual ON_Curve::IsClosed override More...
ON_Surface::ISO  | IsoType () const
bool  | Read (ON_BinaryArchive &) override
Low level archive writing tool used by ON_BinaryArchive::ReadObject(). More...
bool  | ReversedEdgeDir () const
bool  | ReversedTrimDir () const
const ON_Surface *  | Surface () const
ON_Interval  | TrimDomain () const
bool  | Write (ON_BinaryArchive &) const override
Low level archive writing tool used by ON_BinaryArchive::WriteObject(). More...
 Public Member Functions inherited from ON_CurveProxy
ON_CurveProxy () ON_NOEXCEPT
ON_CurveProxy (const ON_CurveProxy &)
ON_CurveProxy (const ON_Curve *)
ON_CurveProxy (const ON_Curve *, ON_Interval)
virtual  | ~ON_CurveProxy ()
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree () const override
Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. More...
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain () const override
ON_Curve overrides. More...
void  | Dump (ON_TextLog &) const override
Creates a text dump of the object. More...
bool  | Evaluate (double, int, int, double *, int=0, int *=0) const override
This evaluator actually does all the work. The other ON_Curve evaluation tools call this virtual function. More...
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetCurveParameterFromNurbFormParameter (double, double *) const override
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override More...
bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
Search for a derivatitive, tangent, or curvature discontinuity. More...
int  | GetNurbForm (ON_NurbsCurve &, double=0.0, const ON_Interval *=nullptr) const override
Get a NURBS curve representation of this curve. More...
bool  | GetNurbFormParameterFromCurveParameter (double, double *) const override
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override More...
bool  | GetParameterTolerance (double, double *, double *) const override
(optional - override if curve is piecewise smooth) More...
bool  | GetSpanVector (double *) const override
Get number of parameters of "knots". More...
int  | HasNurbForm () const override
Does a NURBS curve representation of this curve. More...
bool  | IsArc (const ON_Plane *=nullptr, ON_Arc *=nullptr, double=ON_ZERO_TOLERANCE) const override
Test a curve to see if the locus if its points is an arc or circle. More...
bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
Test continuity at a curve parameter value. More...
bool  | IsInPlane (const ON_Plane &, double=ON_ZERO_TOLERANCE) const override
Test a curve to see if it lies in a specific plane. More...
bool  | IsLinear (double=ON_ZERO_TOLERANCE) const override
Test a curve to see if the locus if its points is a line segment. More...
bool  | IsPeriodic (void) const override
Test a curve to see if it is periodic. More...
bool  | IsPlanar (ON_Plane *=nullptr, double=ON_ZERO_TOLERANCE) const override
Test a curve to see if it is planar. More...
int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const override
virtual override of ON_Curve::IsPolyline More...
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_Object overrides. More...
ON_CurveProxy &  | operator= (const ON_CurveProxy &)
const ON_Curve *  | ProxyCurve () const
ON_Interval  | ProxyCurveDomain () const
bool  | ProxyCurveIsReversed () const
double  | RealCurveParameter (double t) const
bool  | Reverse () override
Reverse the direction of the curve. More...
bool  | SetDomain (double t0, double t1) override
Set the domain of the curve More...
bool  | SetDomain (ON_Interval domain)
void  | SetProxyCurve (const ON_Curve *real_curve)
Sets the curve geometry that "this" is a proxy for. Sets proxy domain to proxy_curve->Domain(). More...
void  | SetProxyCurve (const ON_Curve *real_curve, ON_Interval real_curve_subdomain)
Sets the curve geometry that "this" is a proxy for. Sets proxy domain to proxy_curve->Domain(). More...
bool  | SetProxyCurveDomain (ON_Interval proxy_curve_subdomain)
Sets portion of the "real" curve that this proxy represents. Does NOT change the domain of "this" curve. More...
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
int  | SpanCount () const override
Get number of nonempty smooth (c-infinity) spans in curve More...
bool  | Split (double t, ON_Curve *&left_side, ON_Curve *&right_side) const override
override of virtual ON_Curve::Split More...
double  | ThisCurveParameter (double real_curve_parameter) const
bool  | Transform (const ON_Xform &) override
overrides virtual ON_Geometry::Transform(). ON_Curve::Transform() calls ON_Geometry::Transform(xform), which calls ON_Object::TransformUserData(xform), and then calls this->DestroyCurveTree(). More...
bool  | Trim (const ON_Interval &domain) override
override of virtual ON_Curve::Trim More...
 Public Member Functions inherited from ON_Curve
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
virtual bool  | ChangeClosedCurveSeam (double t)
If this curve is closed, then modify it so that the start/end point is at curve parameter t. More...
virtual bool  | ChangeDimension (int desired_dimension)
Change the dimension of a curve. More...
ON_3dVector  | CurvatureAt (double t) const
Evaluate the curvature vector at a parameter. More...
ON_3dVector  | DerivativeAt (double t) const
Evaluate first derivative at a parameter. More...
void  | DestroyCurveTree ()
Destroys the runtime curve tree used to speed closest point and intersection calcuations. More...
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
Evaluate first derivative at a parameter with error checking. More...
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
Evaluate second derivative at a parameter with error checking. More...
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
Evaluate unit tangent and curvature at a parameter with error checking. More...
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
Evaluate point at a parameter with error checking. More...
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
Evaluate unit tangent at a parameter with error checking. More...
virtual bool  | Extend (const ON_Interval &domain)
Pure virtual function. Default returns false. Where possible, analytically extends curve to include domain. More...
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
Return a 3d frame at a parameter. More...
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override More...
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
Decide if it makes sense to close off this curve by moving the endpoint to the start based on start-end gap size and length of curve as approximated by chord defined by 6 points. More...
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
Get a NURBS curve representation of this curve. More...
ON::object_type  | ObjectType () const override
overrides virtual ON_Object::ObjectType. More...
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
Evaluate point at a parameter. More...
ON_3dPoint  | PointAtEnd () const
Evaluate point at the end of the curve. More...
ON_3dPoint  | PointAtStart () const
Evaluate point at the start of the curve. More...
bool  | SetDomain (ON_Interval domain)
Set the domain of the curve. More...
virtual bool  | SetEndPoint (ON_3dPoint end_point)
Force the curve to end at a specified point. More...
virtual bool  | SetStartPoint (ON_3dPoint start_point)
Force the curve to start at a specified point. More...
ON_3dVector  | TangentAt (double t) const
Evaluate unit tangent vector at a parameter. More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
Get object's 3d axis aligned bounding box. More...
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
If possible, BrepForm() creates a brep form of the ON_Geometry. More...
virtual void  | ClearBoundingBox ()
Some objects cache bounding box information. If you modify an object, then call ClearBoundingBox() to inform the object that any cached bounding boxes are invalid. More...
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
If this piece of geometry is a component in something larger, like an ON_BrepEdge in an ON_Brep, then this function returns the component index. More...
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
Get object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
Get corners of object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
virtual bool  | HasBrepForm () const
Query an object to see if it has an ON_Brep form. Result: Returns true if the virtual ON_Geometry::BrepForm can compute an ON_Brep representation of this object. More...
virtual bool  | IsDeformable () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
Tests an object to see if its data members are correctly initialized. More...
virtual bool  | MakeDeformable ()
If possible, converts the object into a form that can be accuratly modified with "squishy" transformations like projections, shears, an non-uniform scaling. More...
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Scale (double scale_factor)
Scales the object by the specified facotor. The scale is centered at the origin. More...
virtual bool  | SwapCoordinates (int i, int j)
Swaps object coordinate values with indices i and j. More...
bool  | Translate (const ON_3dVector &translation_vector)
Translates the object along the specified vector. More...
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
bool  | AttachUserData (class ON_UserData *pUserData)
Attach user data to an object. More...
unsigned int  | ClearAllComponentStates () const
Set all active level component states to ON_ComponentStatus::NoneSet. More...
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
Clear the specified states on every component. More...
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
Clear states on an individual component. More...
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
Expert user tool that copies user data items with positive values of ON_UserData.m_userdata_copycount from source_object to "this. More...
void  | CopyUserData (const ON_Object &source_object)
Calls CopyUserData(source_object,ON_Object::UserDataConflictResolution::source_object). More...
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
Delete the portions of the object identified in ci_list[]. More...
bool  | DetachUserData (class ON_UserData *pUserData)
Remove user data from an object. More...
void  | EmergencyDestroy ()
Sets m_user_data_list = 0. More...
class ON_UserData *  | FirstUserData () const
User data is stored as a linked list of ON_UserData classes. FirstUserData gets the first item in the linked list. This is the most recent item attached using AttachUserData(). Remark: To iterate through all the user data on an object, call FirstUserData() and then use ON_UserData::Next() to traverse the list. More...
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
Get a pointer to user data. More...
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
Get user string from the object. More...
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
Get a list of all user string keys on the object. More...
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
Get a list of all user strings on the object. More...
bool  | IsKindOf (const ON_ClassId *pClassId) const
Low level tool to test if an object is derived from a specified class. More...
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
virtual void  | MemoryRelocate ()
The MemoryRelocate() function is called when an object's location in memory is changed. For example, if an object resides in a chunk of memory that is grown by calling a realloc that has to allocate a new chunk and copy the contents of the old chunk to the new chunk, then the location of the object's memory changes. In practice this happens when classes derived from ON_Object are stored in dynamic arrays, like the default implementation of ON_ObjectArray<>'s that use realloc to grow the dynamic array. More...
virtual ON_UUID  | ModelObjectId () const
All objects in an opennurbs model have an id ( ON_Layer.m_layer_id, ON_Font.m_font_id, ON_Material.m_material_id, ON_3dmObjectAttributes.m_uuid ). More...
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
Expert user tool that moves user data items from source_object to "this. More...
void  | MoveUserData (ON_Object &source_object)
Calls MoveUserData(source_object,ON_Object::UserDataConflictResolution::source_object,true). More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
PurgeUserData() removes all user data from object. More...
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
Set states on an individual component. More...
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
Copy status settings to an individual component. More...
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
Attach a user string to the object. This information will perisist through copy construction, operator=, and file IO. More...
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
Append entries to the user string list More...
void  | TransformUserData (const class ON_Xform &xform)
Objects derived from ON_Geometry must call TransformUserData() in their Transform() member function. More...
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. More...
int  | UserStringCount () const
 Public Attributes
const ON_Brep *  | m_brep
ON_COMPONENT_INDEX  | m_component_index
const ON_BrepEdge *  | m_edge
ON_Interval  | m_edge_domain = ON_Interval::EmptyInterval
corresponding domain of the edge - see note below More...
const ON_BrepFace *  | m_face
ON_UUID  | m_object_id
m_object_id = id of a brep or curve object in Rhino More...
const void *  | m_parent_object
Runtime helpers. More...
const ON_Surface *  | m_surface
const ON_BrepTrim *  | m_trim
ON_Interval  | m_trim_domain = ON_Interval::EmptyInterval
corresponding domain of the trim - see note below More...
 Friends
class  | ON_PolyEdgeCurve
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
When a userdata item is copied or moved from a source object to a destination object, the ON_Object::UserDataConflictResolution enum values specify how conficts are resolved. Remark: A userdata item "conflict" occurs when both the destination and source object have a user data item with the same value of ON_UserData::m_userdata_uuid. More...
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
 Protected Member Functions inherited from ON_CurveProxy
void  | SetProxyCurveIsReversed (bool bReversed)
 Protected Member Functions inherited from ON_Curve
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
Lookup a parameter in the m_t array, optionally using a built in snap tolerance to snap a parameter value to an element of m_t. This function is used by some types derived from ON_Curve to snap parameter values More...
Constructor & Destructor Documentation
◆ ON_PolyEdgeSegment()
 ON_PolyEdgeSegment::ON_PolyEdgeSegment  |  ( |   | )
construction
◆ ~ON_PolyEdgeSegment()
 ON_PolyEdgeSegment::~ON_PolyEdgeSegment  |  ( |   | )
Member Function Documentation
◆ Brep()
 const ON_Brep* ON_PolyEdgeSegment::Brep  |  ( |   | ) |   const
◆ BrepEdge()
 const ON_BrepEdge* ON_PolyEdgeSegment::BrepEdge  |  ( |   | ) |   const
◆ BrepFace()
 const ON_BrepFace* ON_PolyEdgeSegment::BrepFace  |  ( |   | ) |   const
◆ BrepTrim()
 const ON_BrepTrim* ON_PolyEdgeSegment::BrepTrim  |  ( |   | ) |   const
◆ Create() [1/2]
 bool ON_PolyEdgeSegment::Create  |  ( |  const ON_BrepTrim *  |  trim,
|  const ON_UUID &  |  object_id
)
Creates a polyedge segment that uses the entire edge and has the same domain as the edge.
Parameters
trim | [in]
Returns
true if successful (edge was valid and trim_index was valid)
Use ON_Curve::SetDomain, ON_Curve::Trim, ON_Curve::Reverse, etc., to tweak the domain, support, direction etc.
◆ Create() [2/2]
 bool ON_PolyEdgeSegment::Create  |  ( |  const ON_Curve *  |  curve,
|  const ON_UUID &  |  object_id
)
Creates a polyedge segment that uses the entire curve and has the same domain as the curve.
Parameters
curve | [in]
Use ON_Curve::SetDomain, ON_Curve::Trim, ON_Curve::Reverse, etc., to tweak the domain, support, direction etc.
◆ DestroyRuntimeCache()
 void ON_PolyEdgeSegment::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
default copy constructor and operator= are fine.
virtual ON_Object::DestroyRuntimeCache override
Reimplemented from ON_CurveProxy.
◆ DuplicateCurve()
 ON_Curve* ON_PolyEdgeSegment::DuplicateCurve  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::DuplicateCurve override
Reimplemented from ON_CurveProxy.
◆ EdgeDomain()
 ON_Interval ON_PolyEdgeSegment::EdgeDomain  |  ( |   | ) |   const
Returns
subdomain of the edge that this segment uses. This can be different than the domain returned by this->Domain().
◆ EdgeParameter()
 double ON_PolyEdgeSegment::EdgeParameter  |  ( |  double  |  t | ) |   const
◆ IsClosed()
 bool ON_PolyEdgeSegment::IsClosed  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::IsClosed override
Reimplemented from ON_CurveProxy.
◆ IsoType()
 ON_Surface::ISO ON_PolyEdgeSegment::IsoType  |  ( |   | ) |   const
◆ Read()
 bool ON_PolyEdgeSegment::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::ReadObject().
Parameters
binary_archive | archive to read from
Returns
Returns true if the read is successful.
Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_CurveProxy.
◆ ReversedEdgeDir()
 bool ON_PolyEdgeSegment::ReversedEdgeDir  |  ( |   | ) |   const
Returns
True if this segment has an ON_BrepEdge and the direction of the ON_BrepEdge is the reverse of the direction of the segment.
◆ ReversedTrimDir()
 bool ON_PolyEdgeSegment::ReversedTrimDir  |  ( |   | ) |   const
Returns
True if this segment has an ON_BrepTrim and the direction of the ON_BrepTrime is the reverse of the direction of the segment.
◆ Surface()
 const ON_Surface* ON_PolyEdgeSegment::Surface  |  ( |   | ) |   const
◆ TrimDomain()
 ON_Interval ON_PolyEdgeSegment::TrimDomain  |  ( |   | ) |   const
Returns
subdomain of the trim that this segment uses. This can be different than the domain returned by this->Domain().
◆ Write()
 bool ON_PolyEdgeSegment::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::WriteObject().
Parameters
binary_archive | archive to write to
Returns
Returns true if the write is successful.
Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_CurveProxy.
Friends And Related Function Documentation
◆ ON_PolyEdgeCurve
 friend class ON_PolyEdgeCurve
friend
Member Data Documentation
◆ m_brep
 const ON_Brep* ON_PolyEdgeSegment::m_brep
◆ m_component_index
 ON_COMPONENT_INDEX ON_PolyEdgeSegment::m_component_index
◆ m_edge
 const ON_BrepEdge* ON_PolyEdgeSegment::m_edge
◆ m_edge_domain
 ON_Interval ON_PolyEdgeSegment::m_edge_domain = ON_Interval::EmptyInterval
corresponding domain of the edge - see note below
◆ m_face
 const ON_BrepFace* ON_PolyEdgeSegment::m_face
◆ m_object_id
 ON_UUID ON_PolyEdgeSegment::m_object_id
m_object_id = id of a brep or curve object in Rhino
◆ m_parent_object
 const void* ON_PolyEdgeSegment::m_parent_object
Runtime helpers.
◆ m_surface
 const ON_Surface* ON_PolyEdgeSegment::m_surface
◆ m_trim
 const ON_BrepTrim* ON_PolyEdgeSegment::m_trim
◆ m_trim_domain
 ON_Interval ON_PolyEdgeSegment::m_trim_domain = ON_Interval::EmptyInterval
corresponding domain of the trim - see note below