Public Member Functions | Public Attributes | List of all members
ON_CageMorph Class Reference
#include <opennurbs_nurbssurface.h>
 Inheritance diagram for ON_CageMorph:
 Public Member Functions
ON_CageMorph ()
virtual  | ~ON_CageMorph ()
bool  | IsIdentity (const ON_BoundingBox &bbox) const override
Provides a quick way to determine if a morph function is the identity (doesn't move the points) on a region of space. More...
 Public Member Functions inherited from ON_SpaceMorph
ON_SpaceMorph ()
virtual  | ~ON_SpaceMorph ()
bool  | IsIdentity (const ON_SimpleArray< ON_3dPoint > &Points, double tol) const
A slower way to determine if a morph function is the identity (doesn't move the points) on a set of points, to within a tolerance More...
bool  | IsIdentity (const class ON_Surface &Srf, double tol) const
A slower way to determine if a morph function is the identity (doesn't move the points) on a surface, to within a tolerance More...
bool  | IsIdentity (const class ON_Curve &Crv, double tol) const
A slower way to determine if a morph function is the identity (doesn't move the points) on a curve, to within a tolerance. More...
bool  | PreserveStructure () const
bool  | QuickPreview () const
void  | SetPreserveStructure (bool bPreserveStructure)
Set the preserve structure value. More...
void  | SetQuickPreview (bool bQuickPreview)
Set the quick preview value. More...
void  | SetTolerance (double tolerance)
Set the 3d fitting tolerance used when morphing surfaces and breps. More...
double  | Tolerance () const
Returns the desired accuracy of the morph. This value is primarily used for deforming surfaces and breps. More...
 Public Attributes
const ON_MorphControl *  | m_control
Constructor & Destructor Documentation
◆ ON_CageMorph()
 ON_CageMorph::ON_CageMorph  |  ( |   | )
◆ ~ON_CageMorph()
 virtual ON_CageMorph::~ON_CageMorph  |  ( |   | )
virtual
Member Function Documentation
◆ IsIdentity()
 bool ON_CageMorph::IsIdentity  |  ( |  const ON_BoundingBox &  |  bbox | ) |   const
overridevirtual
Provides a quick way to determine if a morph function is the identity (doesn't move the points) on a region of space.
Parameters
bbox | [in] region of space to test.
Returns
The default always returns false. If you override this function, then return true when every point in the bounding box is fixed by the morph.
Reimplemented from ON_SpaceMorph.
Member Data Documentation
◆ m_control
 const ON_MorphControl* ON_CageMorph::m_control