Public Member Functions | Public Attributes | List of all members
ON_RenderingAttributes Class Reference
#include <opennurbs_rendering.h>
 Inheritance diagram for ON_RenderingAttributes:
 Public Member Functions
ON_RenderingAttributes ()
int  | Compare (const ON_RenderingAttributes &other) const
void  | Default ()
bool  | IsValid (ON_TextLog *text_log) const
const ON_MaterialRef *  | MaterialRef (const ON_UUID &plugin_id) const
bool  | Read (ON_BinaryArchive &archive)
bool  | Write (ON_BinaryArchive &archive) const
 Public Attributes
ON_ClassArray< ON_MaterialRef >  | m_materials
Constructor & Destructor Documentation
◆ ON_RenderingAttributes()
 ON_RenderingAttributes::ON_RenderingAttributes  |  ( |   | )
Member Function Documentation
◆ Compare()
 int ON_RenderingAttributes::Compare  |  ( |  const ON_RenderingAttributes &  |  other | ) |   const
◆ Default()
 void ON_RenderingAttributes::Default  |  ( |   | )
◆ IsValid()
 bool ON_RenderingAttributes::IsValid  |  ( |  ON_TextLog *  |  text_log | ) |   const
◆ MaterialRef()
 const ON_MaterialRef* ON_RenderingAttributes::MaterialRef  |  ( |  const ON_UUID &  |  plugin_id | ) |   const
◆ Read()
 bool ON_RenderingAttributes::Read  |  ( |  ON_BinaryArchive &  |  archive | )
◆ Write()
 bool ON_RenderingAttributes::Write  |  ( |  ON_BinaryArchive &  |  archive | ) |   const
Member Data Documentation
◆ m_materials
 ON_ClassArray<ON_MaterialRef> ON_RenderingAttributes::m_materials