openNURBS SDK Help 6.0
 Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ON_UuidPair Class Reference
#include <opennurbs_array.h>
 Public Member Functions
ON_UuidPair ()
 Static Public Member Functions
static int  | Compare (const class ON_UuidPair *, const class ON_UuidPair *)
Compares m_uuid[0] then m_uuid[1]. More...
static int  | CompareFirstUuid (const class ON_UuidPair *, const class ON_UuidPair *)
Compares m_uuid[0] and ignores m_uuid[1] More...
static int  | CompareSecondUuid (const class ON_UuidPair *, const class ON_UuidPair *)
Compares m_uuid[1] and ignores m_uuid[0] More...
 Public Attributes
ON_UUID  | m_uuid [2]
Constructor & Destructor Documentation
◆ ON_UuidPair()
 ON_UuidPair::ON_UuidPair  |  ( |   | )
Member Function Documentation
◆ Compare()
 static int ON_UuidPair::Compare  |  ( |  const class ON_UuidPair *  |  ,
|  const class ON_UuidPair *
)
static
Compares m_uuid[0] then m_uuid[1].
◆ CompareFirstUuid()
 static int ON_UuidPair::CompareFirstUuid  |  ( |  const class ON_UuidPair *  |  ,
|  const class ON_UuidPair *
)
static
Compares m_uuid[0] and ignores m_uuid[1]
◆ CompareSecondUuid()
 static int ON_UuidPair::CompareSecondUuid  |  ( |  const class ON_UuidPair *  |  ,
|  const class ON_UuidPair *
)
static
Compares m_uuid[1] and ignores m_uuid[0]
Member Data Documentation
◆ m_uuid
 ON_UUID ON_UuidPair::m_uuid[2]