Public Member Functions | List of all members
ON_PolyEdgeCurve Class Reference
#include <opennurbs_polyedgecurve.h>
 Inheritance diagram for ON_PolyEdgeCurve:
 Public Member Functions
ON_PolyEdgeCurve ()
~ON_PolyEdgeCurve ()
bool  | Append (ON_PolyEdgeSegment *new_segment)
Append curve. More...
bool  | AppendAndMatch (ON_Curve *)
const ON_Brep *  | BrepAt (double t) const
bool  | ChangeClosedCurveSeam (double t) override
bool  | ContainsAllEdges () const
Test if all segments of the polyedge are surface edges. More...
bool  | ContainsAnyEdges () const
Test if there are any surface edges in the polyedge. More...
bool  | Create (const ON_BrepTrim *trim, const ON_UUID &object_id)
bool  | Create (const ON_Curve *curve, const ON_UUID &object_id)
void  | DestroyRuntimeCache (bool bDelete=true) override
default copy constructor and operator= are fine. More...
ON_Curve *  | DuplicateCurve () const override
virtual ON_Curve::DuplicateCurve override More...
const ON_BrepEdge *  | EdgeAt (double t) const
double  | EdgeParameter (double t) const
const ON_BrepFace *  | FaceAt (double t) const
int  | FindCurve (const ON_Curve *curve) const
int  | FindEdge (const ON_BrepEdge *edge) const
int  | FindTrim (const ON_BrepTrim *trim) const
bool  | Insert (int segment_index, ON_PolyEdgeSegment *new_segment)
bool  | IsClosed () const override
virtual ON_Curve::IsClosed override More...
ON_Surface::ISO  | IsoType (double t) const
ON_PolyEdgeSegment *  | operator[] (int) const
bool  | Prepend (ON_PolyEdgeSegment *new_segment)
Prepend curve. More...
bool  | PrependAndMatch (ON_Curve *)
bool  | Remove ()
remove last More...
bool  | Remove (int index)
int  | SegmentCount () const
ON_PolyEdgeSegment *  | SegmentCurve (int segment_index) const
bool  | SetEndPoint (ON_3dPoint end_point) override
virtual More...
bool  | SetStartPoint (ON_3dPoint start_point) override
const ON_Surface *  | SurfaceAt (double t) const
const ON_BrepTrim *  | TrimAt (double t) const
 Public Member Functions inherited from ON_PolyCurve
ON_PolyCurve () ON_NOEXCEPT
ON_PolyCurve (const ON_PolyCurve &)
ON_PolyCurve (int)
virtual  | ~ON_PolyCurve ()
bool  | Append (ON_Curve *)
Append curve. More...
bool  | AppendAndMatch (ON_Curve *)
Append and match start of curve to end of polycurve. More...
bool  | ChangeDimension (int desired_dimension) override
bool  | CloseGap (int gap_index, int segments_to_modify)
int  | CloseGaps ()
int  | Count () const
Interface. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree () const override
void  | Destroy ()
of the number of segments is known. More...
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain () const override
void  | Dump (ON_TextLog &) const override
for debugging More...
void  | EmergencyDestroy ()
call if memory used by ON_PolyCurve becomes invalid More...
bool  | Evaluate (double, int, int, double *, int=0, int *=0) const override
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | Extend (const ON_Interval &domain) override
int  | FindNextGap (int segment_index0) const
ON_Curve *  | FirstSegmentCurve () const
returns nullptr if count = 0 More...
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetCurveParameterFromNurbFormParameter (double, double *) const override
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override More...
bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
int  | GetNurbForm (ON_NurbsCurve &, double=0.0, const ON_Interval *=nullptr) const override
bool  | GetNurbFormParameterFromCurveParameter (double, double *) const override
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override More...
bool  | GetSpanVector (double *) const override
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override More...
ON_Curve *  | HarvestSegment (int)
bool  | HasGapAt (int segment_index) const
int  | HasNurbForm () const override
bool  | HasSynchronizedSegmentDomains () const
bool  | Insert (int, ON_Curve *)
bool  | IsArc (const ON_Plane *=nullptr, ON_Arc *=nullptr, double=ON_ZERO_TOLERANCE) const override
bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
bool  | IsDeformable () const override
virtual ON_Geometry::IsDeformable() override More...
bool  | IsInPlane (const ON_Plane &, double=ON_ZERO_TOLERANCE) const override
bool  | IsLinear (double=ON_ZERO_TOLERANCE) const override
bool  | IsNested () const
bool  | IsPeriodic (void) const override
periodic.) More...
bool  | IsPlanar (ON_Plane *=nullptr, double=ON_ZERO_TOLERANCE) const override
int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const override
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
bool  | IsValid (bool bAllowGaps, ON_TextLog *text_log) const
ON_Curve *  | LastSegmentCurve () const
returns nullptr if count = 0 More...
bool  | MakeDeformable () override
virtual ON_Geometry::MakeDeformable() override More...
ON_DEPRECATED_MSG ("Replace calls to HasGap() with FindNextGap(0)") int HasGap() const
ON_DEPRECATED_MSG ("Use RemoveNesting(). RemoveNestingEx() will be removed in the next release.") bool RemoveNestingEx()
ON_PolyCurve &  | operator= (const ON_PolyCurve &)
ON_Curve *  | operator[] (int) const
These operator[] functions return nullptr if index is out of range. More...
bool  | ParameterSearch (double t, int &index, bool bEnableSnap) const
double  | PolyCurveParameter (int segment_index, double segmentcurve_parameter) const
bool  | Prepend (ON_Curve *)
Prepend curve. More...
bool  | PrependAndMatch (ON_Curve *)
Prepend and match end of curve to start of polycurve. More...
bool  | Read (ON_BinaryArchive &) override
bool  | Remove ()
delete last segment and reduce count by 1 More...
bool  | Remove (int)
delete specified segment and reduce count by 1 More...
bool  | RemoveNesting ()
void  | Reserve (int)
make sure capacity is at least the specified count More...
bool  | Reverse () override
ON_Curve *  | SegmentCurve (int segment_index) const
double  | SegmentCurveParameter (double polycurve_parameter) const
const ON_CurveArray &  | SegmentCurves () const
ON_Interval  | SegmentDomain (int segment_index) const
int  | SegmentIndex (double polycurve_parameter) const
int  | SegmentIndex (ON_Interval sub_domain, int *segment_index0, int *segment_index1) const
const ON_SimpleArray< double > &  | SegmentParameters () const
bool  | SetDomain (double t0, double t1) override
bool  | SetParameterization (const double *t)
void  | SetSegment (int index, ON_Curve *crv)
unsigned int  | SizeOf () const override
ON_Object overrides. More...
int  | SpanCount () const override
number of smooth spans in curve More...
bool  | Split (double t, ON_Curve *&left_side, ON_Curve *&right_side) const override
bool  | SwapCoordinates (int, int) override
bool  | SynchronizeSegmentDomains ()
bool  | Transform (const ON_Xform &) override
bool  | Trim (const ON_Interval &domain) override
bool  | Write (ON_BinaryArchive &) const override
 Public Member Functions inherited from ON_Curve
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
ON_3dVector  | CurvatureAt (double t) const
ON_3dVector  | DerivativeAt (double t) const
void  | DestroyCurveTree ()
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetParameterTolerance (double t, double *tminus, double *tplus) const
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
ON::object_type  | ObjectType () const override
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
ON_3dPoint  | PointAtEnd () const
ON_3dPoint  | PointAtStart () const
bool  | SetDomain (ON_Interval domain)
ON_3dVector  | TangentAt (double t) const
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
virtual bool  | HasBrepForm () const
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
void  | CopyUserData (const ON_Object &source_object)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
void  | MoveUserData (ON_Object &source_object)
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
 Protected Member Functions inherited from ON_Curve
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
Constructor & Destructor Documentation
◆ ON_PolyEdgeCurve()
 ON_PolyEdgeCurve::ON_PolyEdgeCurve  |  ( |   | )
◆ ~ON_PolyEdgeCurve()
 ON_PolyEdgeCurve::~ON_PolyEdgeCurve  |  ( |   | )
Member Function Documentation
◆ Append()
 bool ON_PolyEdgeCurve::Append  |  ( |  ON_PolyEdgeSegment *  |  new_segment | )
Append curve.
◆ AppendAndMatch()
 bool ON_PolyEdgeCurve::AppendAndMatch  |  ( |  ON_Curve *  |   | )
◆ BrepAt()
 const ON_Brep* ON_PolyEdgeCurve::BrepAt  |  ( |  double  |  t | ) |   const
◆ ChangeClosedCurveSeam()
 bool ON_PolyEdgeCurve::ChangeClosedCurveSeam  |  ( |  double  |  t | )
overridevirtual
Description: If this curve is closed, then modify it so that the start/end point is at curve parameter t. Parameters: t - [in] curve parameter of new start/end point. The returned curves domain will start at t. Returns: true if successful. Remarks: Overrides virtual ON_Curve::ChangeClosedCurveSeam
Reimplemented from ON_PolyCurve.
◆ ContainsAllEdges()
 bool ON_PolyEdgeCurve::ContainsAllEdges  |  ( |   | ) |   const
Test if all segments of the polyedge are surface edges.
◆ ContainsAnyEdges()
 bool ON_PolyEdgeCurve::ContainsAnyEdges  |  ( |   | ) |   const
Test if there are any surface edges in the polyedge.
◆ Create() [1/2]
 bool ON_PolyEdgeCurve::Create  |  ( |  const ON_BrepTrim *  |  trim,
|  const ON_UUID &  |  object_id
)
Description: Create a one segment ON_PolyEdgeCurve curve that uses a single edge.
◆ Create() [2/2]
 bool ON_PolyEdgeCurve::Create  |  ( |  const ON_Curve *  |  curve,
|  const ON_UUID &  |  object_id
)
Description: Create a one segment ON_PolyEdgeCurve curve that uses a single curve.
◆ DestroyRuntimeCache()
 void ON_PolyEdgeCurve::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
default copy constructor and operator= are fine.
virtual ON_Object::DestroyRuntimeCache override
Reimplemented from ON_PolyCurve.
◆ DuplicateCurve()
 ON_Curve* ON_PolyEdgeCurve::DuplicateCurve  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::DuplicateCurve override
Reimplemented from ON_PolyCurve.
◆ EdgeAt()
 const ON_BrepEdge* ON_PolyEdgeCurve::EdgeAt  |  ( |  double  |  t | ) |   const
if the segment is an edge, the following return non-nullptr pointers.
◆ EdgeParameter()
 double ON_PolyEdgeCurve::EdgeParameter  |  ( |  double  |  t | ) |   const
◆ FaceAt()
 const ON_BrepFace* ON_PolyEdgeCurve::FaceAt  |  ( |  double  |  t | ) |   const
◆ FindCurve()
 int ON_PolyEdgeCurve::FindCurve  |  ( |  const ON_Curve *  |  curve | ) |   const
Description: See if this polyedge has a wire curve as one of its segments Parameters: curve - [in] the curve to look for Returns: -1: trim is not in the polyedge >=0: index of first segment that uses the curve
◆ FindEdge()
 int ON_PolyEdgeCurve::FindEdge  |  ( |  const ON_BrepEdge *  |  edge | ) |   const
Description: See if this polyedge has an edge as one of its segments Parameters: edge - [in] the edge to look for Returns: -1: edge is not in the polyedge >=0: index of first segment that uses the edge
◆ FindTrim()
 int ON_PolyEdgeCurve::FindTrim  |  ( |  const ON_BrepTrim *  |  trim | ) |   const
Description: See if this polyedge has a trim as one of its segments Parameters: trim - [in] the trim to look for Returns: -1: trim is not in the polyedge >=0: index of first segment that uses the trim
◆ Insert()
 bool ON_PolyEdgeCurve::Insert  |  ( |  int  |  segment_index,
|  ON_PolyEdgeSegment *  |  new_segment
)
◆ IsClosed()
 bool ON_PolyEdgeCurve::IsClosed  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::IsClosed override
Reimplemented from ON_PolyCurve.
◆ IsoType()
 ON_Surface::ISO ON_PolyEdgeCurve::IsoType  |  ( |  double  |  t | ) |   const
◆ operator[]()
 ON_PolyEdgeSegment* ON_PolyEdgeCurve::operator[]  |  ( |  int  |   | ) |   const
◆ Prepend()
 bool ON_PolyEdgeCurve::Prepend  |  ( |  ON_PolyEdgeSegment *  |  new_segment | )
Prepend curve.
◆ PrependAndMatch()
 bool ON_PolyEdgeCurve::PrependAndMatch  |  ( |  ON_Curve *  |   | )
◆ Remove() [1/2]
 bool ON_PolyEdgeCurve::Remove  |  ( |   | )
remove last
7-1-03 lw added override to unset cached closed flag when a segment is removed
◆ Remove() [2/2]
 bool ON_PolyEdgeCurve::Remove  |  ( |  int  |  index | )
◆ SegmentCount()
 int ON_PolyEdgeCurve::SegmentCount  |  ( |   | ) |   const
◆ SegmentCurve()
 ON_PolyEdgeSegment* ON_PolyEdgeCurve::SegmentCurve  |  ( |  int  |  segment_index | ) |   const
◆ SetEndPoint()
 bool ON_PolyEdgeCurve::SetEndPoint  |  ( |  ON_3dPoint  |  end_point | )
overridevirtual
virtual
Description: Force the curve to end at a specified point. Parameters: end_point - [in] Returns: true if successful. Remarks: Some end points cannot be moved. Be sure to check return code. See Also: ON_Curve::SetStartPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
Reimplemented from ON_PolyCurve.
◆ SetStartPoint()
 bool ON_PolyEdgeCurve::SetStartPoint  |  ( |  ON_3dPoint  |  start_point | )
overridevirtual
OBSOLETE and unreliable. Use FindCurve, FindEdge, or FindTrim bool Contains( const ON_Curve* curve) const; virtual ON_Curve overrides do nothing to prevent changing edge
Reimplemented from ON_PolyCurve.
◆ SurfaceAt()
 const ON_Surface* ON_PolyEdgeCurve::SurfaceAt  |  ( |  double  |  t | ) |   const
◆ TrimAt()
 const ON_BrepTrim* ON_PolyEdgeCurve::TrimAt  |  ( |  double  |  t | ) |   const