Public Member Functions | Public Attributes | Protected Attributes | List of all members
ON_PlaneSurface Class Reference
#include <opennurbs_planesurface.h>
 Inheritance diagram for ON_PlaneSurface:
 Public Member Functions
ON_PlaneSurface ()
ON_PlaneSurface (const ON_PlaneSurface &)
ON_PlaneSurface (const ON_Plane &)
virtual  | ~ON_PlaneSurface ()
bool  | CreatePseudoInfinitePlane (ON_PlaneEquation plane_equation, const ON_BoundingBox &bbox, double padding=0.0625)
bool  | CreatePseudoInfinitePlane (const ON_Plane &plane, const ON_BoundingBox &bbox, double padding=0.0625)
bool  | CreatePseudoInfinitePlane (const ON_Plane &plane, int point_count, const ON_3dPoint *point_list, double padding=0.0625)
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree (int) const override
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain (int) const override
void  | Dump (ON_TextLog &) const override
for debugging More...
bool  | Evaluate (double, double, int, int, double *, int=0, int *=0) const override
work horse evaluator More...
bool  | Extend (int dir, const ON_Interval &domain) override
ON_Interval  | Extents (int dir) const
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetNextDiscontinuity (int dir, ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
int  | GetNurbForm (ON_NurbsSurface &, double=0.0) const override
bool  | GetParameterTolerance (int, double, double *, double *) const override
bool  | GetSpanVector (int, double *) const override
bool  | GetSurfaceSize (double *width, double *height) const override
int  | HasNurbForm () const override
bool  | IsClosed (int) const override
bool  | IsContinuous (ON::continuity c, double s, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
ON_Curve *  | IsoCurve (int dir, double c) const override
bool  | IsPeriodic (int) const override
bool  | IsPlanar (ON_Plane *plane=nullptr, double tolerance=ON_ZERO_TOLERANCE) const override
bool  | IsSingular (int) const override
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_PlaneSurface &  | operator= (const ON_PlaneSurface &)
ON_PlaneSurface &  | operator= (const ON_Plane &)
bool  | Read (ON_BinaryArchive &) override
bool  | Reverse (int) override
bool  | SetDomain (int dir, double t0, double t1) override
ON_Surface overrides. More...
bool  | SetExtents (int dir, ON_Interval extents, bool bSynchDomain=false)
unsigned int  | SizeOf () const override
ON_Object overrides. More...
int  | SpanCount (int) const override
number of smooth spans in curve More...
bool  | Split (int dir, double c, ON_Surface *&west_or_south_side, ON_Surface *&east_or_north_side) const override
bool  | Transform (const ON_Xform &) override
bool  | Transpose () override
transpose surface parameterization (swap "s" and "t") More...
bool  | Trim (int dir, const ON_Interval &domain) override
bool  | Write (ON_BinaryArchive &) const override
 Public Member Functions inherited from ON_Surface
ON_Surface ()
ON_Surface (const ON_Surface &)
virtual  | ~ON_Surface ()
ON_Brep *  | BrepForm (ON_Brep *brep=nullptr) const override
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
void  | DestroySurfaceTree ()
virtual ON_Surface *  | DuplicateSurface () const
bool  | Ev1Der (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, int quadrant=0, int *hint=0) const
bool  | Ev2Der (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, ON_3dVector &duu, ON_3dVector &duv, ON_3dVector &dvv, int quadrant=0, int *hint=0) const
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvNormal (double u, double v, ON_3dPoint &point, ON_3dVector &normal, int quadrant=0, int *hint=0) const
bool  | EvNormal (double u, double v, ON_3dVector &normal, int quadrant=0, int *hint=0) const
bool  | EvNormal (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, ON_3dVector &normal, int=0, int *=0) const
bool  | EvPoint (double u, double v, ON_3dPoint &point, int quadrant=0, int *hint=0) const
bool  | FrameAt (double u, double v, ON_Plane &frame) const
bool  | GetDomain (int dir, double *t0, double *t1) const
surface interface More...
virtual bool  | GetNurbFormParameterFromSurfaceParameter (double surface_s, double surface_t, double *nurbs_s, double *nurbs_t) const
virtual bool  | GetSpanVectorIndex (int dir, double t, int side, int *span_vector_index, ON_Interval *span_interval) const
virtual bool  | GetSurfaceParameterFromNurbFormParameter (double nurbs_s, double nurbs_t, double *surface_s, double *surface_t) const
bool  | HasBrepForm () const override
int  | IsAtSeam (double s, double t) const
bool  | IsAtSingularity (double s, double t, bool bExact=true) const
bool  | IsCone (ON_Cone *cone=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | IsCylinder (ON_Cylinder *cylinder=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
virtual ISO  | IsIsoparametric (const ON_Curve &curve, const ON_Interval *curve_domain=nullptr) const
virtual ISO  | IsIsoparametric (const ON_BoundingBox &bbox) const
bool  | IsSolid () const
bool  | IsSphere (ON_Sphere *sphere=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | IsTorus (ON_Torus *torus=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
ON_3dVector  | NormalAt (double, double) const
ON_NurbsSurface *  | NurbsSurface (ON_NurbsSurface *pNurbsSurface=nullptr, double tolerance=0.0, const ON_Interval *s_subdomain=nullptr, const ON_Interval *t_subdomain=nullptr) const
ON::object_type  | ObjectType () const override
override ON_Object::ObjectType() - returns ON::surface_object More...
ON_Surface &  | operator= (const ON_Surface &)
ON_3dPoint  | PointAt (double, double) const
simple evaluation interface - no error handling More...
bool  | SetDomain (int dir, ON_Interval domain)
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
virtual bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const
virtual bool  | IsDeformable () const
virtual bool  | MakeDeformable ()
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
virtual bool  | SwapCoordinates (int i, int j)
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
void  | CopyUserData (const ON_Object &source_object)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
void  | MoveUserData (ON_Object &source_object)
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Public Attributes
ON_Plane  | m_plane
 Protected Attributes
ON_Interval  | m_domain [2]
evaluation domain (always increasing) More...
ON_Interval  | m_extents [2]
rectangle extents (in m_plane x,y coordinates) More...
 Additional Inherited Members
 Public Types inherited from ON_Surface
enum  | ISO {
 not_iso = 0, x_iso = 1, y_iso = 2, W_iso = 3,
 S_iso = 4, E_iso = 5, N_iso = 6, iso_count = 7
 }
pure virtual class for surface objects More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
Constructor & Destructor Documentation
◆ ON_PlaneSurface() [1/3]
 ON_PlaneSurface::ON_PlaneSurface  |  ( |   | )
◆ ON_PlaneSurface() [2/3]
 ON_PlaneSurface::ON_PlaneSurface  |  ( |  const ON_PlaneSurface &  |   | )
◆ ON_PlaneSurface() [3/3]
 ON_PlaneSurface::ON_PlaneSurface  |  ( |  const ON_Plane &  |   | )
◆ ~ON_PlaneSurface()
 virtual ON_PlaneSurface::~ON_PlaneSurface  |  ( |   | )
virtual
Member Function Documentation
◆ CreatePseudoInfinitePlane() [1/3]
 bool ON_PlaneSurface::CreatePseudoInfinitePlane  |  ( |  ON_PlaneEquation  |  plane_equation,
|  const ON_BoundingBox &  |  bbox,
|  double  |  padding = 0.0625
)
Description: Create a plane that contains the projection of a bounding box. Parameters: plane_equation - [in] bbox - [in] padding - [in] amount of extra padding to add around the edges of the plane. Default is 0.0625 Returns: true if successful
◆ CreatePseudoInfinitePlane() [2/3]
 bool ON_PlaneSurface::CreatePseudoInfinitePlane  |  ( |  const ON_Plane &  |  plane,
|  const ON_BoundingBox &  |  bbox,
|  double  |  padding = 0.0625
)
Description: Create a plane that contains the projection of a bounding box. Parameters: plane - [in] bbox - [in] padding - [in] amount of extra padding to add around the edges of the plane. Default is 0.0625 Returns: true if successful
◆ CreatePseudoInfinitePlane() [3/3]
 bool ON_PlaneSurface::CreatePseudoInfinitePlane  |  ( |  const ON_Plane &  |  plane,
|  int  |  point_count,
|  const ON_3dPoint *  |  point_list,
|  double  |  padding = 0.0625
)
Description: Create a plane that contains the projection of a list of points. Parameters: plane - [in] point_count - [in] point_list - [in] padding - [in] amount of extra padding to add around the edges of the plane. Default is 0.0625 Returns: true if successful
◆ DataCRC()
 ON__UINT32 ON_PlaneSurface::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
virtual ON_Object::DataCRC override
Reimplemented from ON_Object.
Reimplemented in ON_ClippingPlaneSurface.
◆ Degree()
 int ON_PlaneSurface::Degree  |  ( |  int  |   | ) |   const
overridevirtual
Implements ON_Surface.
◆ Dimension()
 int ON_PlaneSurface::Dimension  |  ( |   | ) |   const
overridevirtual
ON_Geometry overrides.
Reimplemented from ON_Geometry.
◆ Domain()
 ON_Interval ON_PlaneSurface::Domain  |  ( |  int  |   | ) |   const
overridevirtual
Implements ON_Surface.
◆ Dump()
 void ON_PlaneSurface::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
for debugging
Reimplemented from ON_Object.
Reimplemented in ON_ClippingPlaneSurface.
◆ Evaluate()
 bool ON_PlaneSurface::Evaluate  |  ( |  double  |  u,
|  double  |  v,
|  int  |  num_der,
|  int  |  array_stride,
|  double *  |  der_array,
|  int  |  quadrant = 0,
|  int *  |  hint = 0
) |   |  const
overridevirtual
work horse evaluator
Parameters
u | returns false if unable to evaluate
v | evaluation parameters
num_der | number of derivatives (>=0)
array_stride | array stride (>=Dimension())
der_array | array of length stride*(ndir+1)*(ndir+2)/2
quadrant | optional - determines which quadrant to evaluate from 0 = default 1 from NE quadrant 2 from NW quadrant 3 from SW quadrant 4 from SE quadrant
hint | optional - evaluation hint (int[2]) used to speed repeated evaluations
Implements ON_Surface.
◆ Extend()
 bool ON_PlaneSurface::Extend  |  ( |  int  |  dir,
|  const ON_Interval &  |  domain
)
overridevirtual
Description: Where possible, analytically extends surface to include domain. Parameters: dir - [in] 0 new Domain(0) will include domain. (the first surface parameter). 1 new Domain(1) will include domain. (the second surface parameter). domain - [in] if domain is not included in surface domain, surface will be extended so that its domain includes domain.
 Will not work if surface is closed in direction dir. Original surface is identical to the restriction of the resulting surface to the original surface domain, Returns: true if successful.
Reimplemented from ON_Surface.
◆ Extents()
 ON_Interval ON_PlaneSurface::Extents  |  ( |  int  |  dir | ) |   const
Description: Gets the extents of the rectangle. Parameters: dir - [in] 0 gets plane's x coordinate extents 0 gets plane's y coordinate extents Returns: Increasing interval See Also: ON_PlaneSurface::Domain
◆ GetBBox()
 bool ON_PlaneSurface::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
virtual ON_Geometry GetBBox override
Reimplemented from ON_Geometry.
◆ GetNextDiscontinuity()
 bool ON_PlaneSurface::GetNextDiscontinuity  |  ( |  int  |  dir,
|  ON::continuity  |  c,
|  double  |  t0,
|  double  |  t1,
|  double *  |  t,
|  int *  |  hint = nullptr,
|  int *  |  dtype = nullptr,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Description: Search for a derivatitive, tangent, or curvature discontinuity. Parameters: dir - [in] If 0, then "u" parameter is checked. If 1, then the "v" parameter is checked. c - [in] type of continity to test for. t0 - [in] Search begins at t0. If there is a discontinuity at t0, it will be ignored. This makes it possible to repeatedly call GetNextDiscontinuity and step through the discontinuities. t1 - [in] (t0 != t1) If there is a discontinuity at t1 is will be ingored unless c is a locus discontinuity type and t1 is at the start or end of the curve. t - [out] if a discontinuity is found, then *t reports the parameter at the discontinuity. hint - [in/out] if GetNextDiscontinuity will be called repeatedly, passing a "hint" with initial value *hint=0 will increase the speed of the search.
 dtype - [out] if not nullptr, *dtype reports the kind of discontinuity found at *t. A value of 1 means the first derivative or unit tangent was discontinuous. A value of 2 means the second derivative or curvature was discontinuous. A value of 0 means teh curve is not closed, a locus discontinuity test was applied, and t1 is at the start of end of the curve. cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous. If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. Returns: Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
true if a parametric discontinuity was found strictly between t0 and t1. Note well that all curves are parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
true if a locus discontinuity was found strictly between t0 and t1 or at t1 is the at the end of a curve. Note well that all open curves (IsClosed()=false) are locus discontinuous at the ends of their domains. All closed curves (IsClosed()=true) are at least C0_locus_continuous at the ends of their domains.
Reimplemented from ON_Surface.
◆ GetNurbForm()
 int ON_PlaneSurface::GetNurbForm  |  ( |  ON_NurbsSurface &  |  nurbs_surface,
|  double  |  tolerance = 0.0
) |   |  const
overridevirtual
Description: Get a NURBS surface representation of this surface. Parameters: nurbs_surface - [out] NURBS representation returned here tolerance - [in] tolerance to use when creating NURBS representation. s_subdomain - [in] if not nullptr, then the NURBS representation for this portion of the surface is returned. t_subdomain - [in] if not nullptr, then the NURBS representation for this portion of the surface is returned. Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - returned NURBS parameterization matches the surface's to wthe desired accuracy 2 success - returned NURBS point locus matches the surface's to the desired accuracy and the domain of the NURBS surface is correct. On However, This surface's parameterization and the NURBS surface parameterization may not match to the desired accuracy. This situation happens when getting NURBS representations of surfaces that have a transendental parameterization like spheres, cylinders, and cones. Remarks: This is a low-level virtual function. If you do not need the parameterization information provided by the return code, then ON_Surface::NurbsSurface may be easier to use. See Also: ON_Surface::NurbsSurface
Parameters
nurbs_surface | returns 0: unable to create NURBS representation with desired accuracy. 1: success - returned NURBS parameterization matches the surface's to wthe desired accuracy 2: success - returned NURBS point locus matches the surfaces's to the desired accuracy but, on the interior of the surface's domain, the surface's parameterization and the NURBS parameterization may not match to the desired accuracy.
Reimplemented from ON_Surface.
◆ GetParameterTolerance()
 bool ON_PlaneSurface::GetParameterTolerance  |  ( |  int  |  ,
|  double  |  ,
|  double *  |  ,
|  double *
) |   |  const
overridevirtual
Reimplemented from ON_Surface.
◆ GetSpanVector()
 bool ON_PlaneSurface::GetSpanVector  |  ( |  int  |  ,
|  double *
) |   |  const
overridevirtual
Implements ON_Surface.
◆ GetSurfaceSize()
 bool ON_PlaneSurface::GetSurfaceSize  |  ( |  double *  |  width,
|  double *  |  height
) |   |  const
overridevirtual
Description: Get an estimate of the size of the rectangle that would be created if the 3d surface where flattened into a rectangle. Parameters: width - [out] (corresponds to the first surface parameter) height - [out] (corresponds to the first surface parameter) Remarks: overrides virtual ON_Surface::GetSurfaceSize Returns: true if successful.
Reimplemented from ON_Surface.
◆ HasNurbForm()
 int ON_PlaneSurface::HasNurbForm  |  ( |   | ) |   const
overridevirtual
Description: Is there a NURBS surface representation of this surface. Parameters: Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - NURBS parameterization matches the surface's 2 success - NURBS point locus matches the surface's and the domain of the NURBS surface is correct.
 However, This surface's parameterization and the NURBS surface parameterization may not match. This situation happens when getting NURBS representations of surfaces that have a transendental parameterization like spheres, cylinders, and cones. Remarks: This is a low-level virtual function. See Also: ON_Surface::GetNurbForm ON_Surface::NurbsSurface
Reimplemented from ON_Surface.
◆ IsClosed()
 bool ON_PlaneSurface::IsClosed  |  ( |  int  |   | ) |   const
overridevirtual
Reimplemented from ON_Surface.
◆ IsContinuous()
 bool ON_PlaneSurface::IsContinuous  |  ( |  ON::continuity  |  c,
|  double  |  s,
|  double  |  t,
|  int *  |  hint = nullptr,
|  double  |  point_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d1_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d2_tolerance = ON_ZERO_TOLERANCE,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Description: Test continuity at a surface parameter value. Parameters: c - [in] continuity to test for s - [in] surface parameter to test t - [in] surface parameter to test hint - [in] evaluation hint point_tolerance - [in] if the distance between two points is greater than point_tolerance, then the surface is not C0. d1_tolerance - [in] if the difference between two first derivatives is greater than d1_tolerance, then the surface is not C1. d2_tolerance - [in] if the difference between two second derivatives is greater than d2_tolerance, then the surface is not C2. cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two normal vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous. If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. Returns: true if the surface has at least the c type continuity at the parameter t. Remarks: Overrides virtual ON_Surface::IsContinuous
Reimplemented from ON_Surface.
◆ IsoCurve()
 ON_Curve* ON_PlaneSurface::IsoCurve  |  ( |  int  |  dir,
|  double  |  c
) |   |  const
overridevirtual
Description: Get isoparametric curve. Overrides virtual ON_Surface::IsoCurve. Parameters: dir - [in] 0 first parameter varies and second parameter is constant e.g., point on IsoCurve(0,c) at t is srf(t,c) 1 first parameter is constant and second parameter varies e.g., point on IsoCurve(1,c) at t is srf(c,t)
c - [in] value of constant parameter Returns: Isoparametric curve.
Reimplemented from ON_Surface.
◆ IsPeriodic()
 bool ON_PlaneSurface::IsPeriodic  |  ( |  int  |   | ) |   const
overridevirtual
Reimplemented from ON_Surface.
◆ IsPlanar()
 bool ON_PlaneSurface::IsPlanar  |  ( |  ON_Plane *  |  plane = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: Test a surface to see if it is planar. Parameters: plane - [out] if not nullptr and true is returned, the plane parameters are filled in. tolerance - [in] tolerance to use when checking Returns: true if there is a plane such that the maximum distance from the surface to the plane is <= tolerance. Remarks: Overrides virtual ON_Surface::IsPlanar.
Reimplemented from ON_Surface.
◆ IsSingular()
 bool ON_PlaneSurface::IsSingular  |  ( |  int  |   | ) |   const
overridevirtual
Reimplemented from ON_Surface.
◆ IsValid()
 bool ON_PlaneSurface::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Description: Tests an object to see if its data members are correctly initialized. Parameters: text_log - [in] if the object is not valid and text_log is not nullptr, then a brief englis description of the reason the object is not valid is appened to the log. The information appended to text_log is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Returns: table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Geometry.
◆ operator=() [1/2]
 ON_PlaneSurface& ON_PlaneSurface::operator=  |  ( |  const ON_PlaneSurface &  |   | )
◆ operator=() [2/2]
 ON_PlaneSurface& ON_PlaneSurface::operator=  |  ( |  const ON_Plane &  |   | )
◆ Read()
 bool ON_PlaneSurface::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::ReadObject(). Parameters: binary_archive - archive to read from Returns: Returns true if the read is successful. Remarks: Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Parameters
binary_archive | open binary file
Reimplemented from ON_Object.
Reimplemented in ON_ClippingPlaneSurface.
◆ Reverse()
 bool ON_PlaneSurface::Reverse  |  ( |  int  |   | )
overridevirtual
Implements ON_Surface.
◆ SetDomain()
 bool ON_PlaneSurface::SetDomain  |  ( |  int  |  dir,
|  double  |  t0,
|  double  |  t1
)
overridevirtual
ON_Surface overrides.
Description: Sets the evaluation domains. Does not change the geometry. Parameters: dir - [in] 0 sets first parameter's domain 1 sets second parameter's domain t0 - [in] t1 - [in] (t0 < t1) the interval (t0,t1) will be the new domain Returns: True if successful. See Also: ON_PlaneSurface::SetExtents
Reimplemented from ON_Surface.
◆ SetExtents()
 bool ON_PlaneSurface::SetExtents  |  ( |  int  |  dir,
|  ON_Interval  |  extents,
|  bool  |  bSynchDomain = false
)
Description: Sets the extents of then rectangle. Does not change the evaluation domain. Parameters: dir - [in] 0 sets plane's x coordinate extents 0 sets plane's y coordinate extents extents - [in] increasing interval bSynchDomain - [in] if true, the corresponding evaluation interval domain is set so that it matches the extents interval Returns: True if successful. See Also: ON_PlaneSurface::SetDomain
◆ SizeOf()
 unsigned int ON_PlaneSurface::SizeOf  |  ( |   | ) |   const
overridevirtual
ON_Object overrides.
virtual ON_Object::SizeOf override
Reimplemented from ON_Object.
Reimplemented in ON_ClippingPlaneSurface.
◆ SpanCount()
 int ON_PlaneSurface::SpanCount  |  ( |  int  |   | ) |   const
overridevirtual
number of smooth spans in curve
Implements ON_Surface.
◆ Split()
 bool ON_PlaneSurface::Split  |  ( |  int  |  dir,
|  double  |  c,
|  ON_Surface *&  |  west_or_south_side,
|  ON_Surface *&  |  east_or_north_side
) |   |  const
overridevirtual
Description: Splits (divides) the surface into two parts at the specified parameter. Overrides virtual ON_Surface::Split.
Parameters: dir - [in] 0 The surface is split vertically. The "west" side is returned in "west_or_south_side" and the "east" side is returned in "east_or_north_side". 1 The surface is split horizontally. The "south" side is returned in "west_or_south_side" and the "north" side is returned in "east_or_north_side". c - [in] value of constant parameter in interval returned by Domain(dir) west_or_south_side - [out] west/south portion of surface returned here east_or_north_side - [out] east/north portion of surface returned here
Example:
    ON_PlaneSurface srf = ...;
    int dir = 1;
    ON_PlaneSurface* south_side = 0;
    ON_PlaneSurface* north_side = 0;
    srf.Split( dir, srf.Domain(dir).Mid() south_side, north_side );
Reimplemented from ON_Surface.
◆ Transform()
 bool ON_PlaneSurface::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
Description: Transforms the object.
Parameters: xform - [in] transformation to apply to object. If xform.IsSimilarity() is zero, then you may want to call MakeSquishy() before calling Transform.
Remarks: When overriding this function, be sure to include a call to ON_Object::TransformUserData() which takes care of transforming any ON_UserData that may be attached to the object.
See Also: ON_Geometry::IsDeformable();
Remarks: Classes derived from ON_Geometry should call ON_Geometry::Transform() to handle user data transformations and then transform their definition.
Reimplemented from ON_Geometry.
◆ Transpose()
 bool ON_PlaneSurface::Transpose  |  ( |   | )
overridevirtual
transpose surface parameterization (swap "s" and "t")
Implements ON_Surface.
◆ Trim()
 bool ON_PlaneSurface::Trim  |  ( |  int  |  dir,
|  const ON_Interval &  |  domain
)
overridevirtual
Description: Removes the portions of the surface outside of the specified interval. Overrides virtual ON_Surface::Trim.
Parameters: dir - [in] 0 The domain specifies an sub-interval of Domain(0) (the first surface parameter). 1 The domain specifies an sub-interval of Domain(1) (the second surface parameter). domain - [in] interval of the surface to keep. If dir is 0, then the portions of the surface with parameters (s,t) satisfying s < Domain(0).Min() or s > Domain(0).Max() are trimmed away. If dir is 1, then the portions of the surface with parameters (s,t) satisfying t < Domain(1).Min() or t > Domain(1).Max() are trimmed away.
Reimplemented from ON_Surface.
◆ Write()
 bool ON_PlaneSurface::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::WriteObject(). Parameters: binary_archive - archive to write to Returns: Returns true if the write is successful. Remarks: Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
 The default implementation of this virtual function returns false and does nothing.
Parameters
binary_archive | open binary file
Reimplemented from ON_Object.
Reimplemented in ON_ClippingPlaneSurface.
Member Data Documentation
◆ m_domain
 ON_Interval ON_PlaneSurface::m_domain[2]
protected
evaluation domain (always increasing)
always increasing
◆ m_extents
 ON_Interval ON_PlaneSurface::m_extents[2]
protected
rectangle extents (in m_plane x,y coordinates)
◆ m_plane
 ON_Plane ON_PlaneSurface::m_plane
An ON_PlaneSurface is really a finite rectangle. m_plane defines the plane and m_extents[] stores the x and y intervals of the plane that define the rectangle. The m_domain[] intervals specify the evaluation domain. Changing the extents are domain are INDEPENDENT of each other. Use Domain() and SetDomain() to control the evluation domain. Use Extents() and SetExtents() to control the rectangle extents.