Public Member Functions | Public Attributes | Friends | List of all members
ON_PolyEdgeSegment Class Reference
#include <opennurbs_polyedgecurve.h>
 Inheritance diagram for ON_PolyEdgeSegment:
 Public Member Functions
ON_PolyEdgeSegment ()
construction More...
~ON_PolyEdgeSegment ()
const ON_Brep *  | Brep () const
const ON_BrepEdge *  | BrepEdge () const
const ON_BrepFace *  | BrepFace () const
const ON_BrepTrim *  | BrepTrim () const
bool  | Create (const ON_BrepTrim *trim, const ON_UUID &object_id)
bool  | Create (const ON_Curve *curve, const ON_UUID &object_id)
void  | DestroyRuntimeCache (bool bDelete=true) override
default copy constructor and operator= are fine. More...
ON_Curve *  | DuplicateCurve () const override
virtual ON_Curve::DuplicateCurve override More...
ON_Interval  | EdgeDomain () const
double  | EdgeParameter (double t) const
bool  | IsClosed () const override
virtual ON_Curve::IsClosed override More...
ON_Surface::ISO  | IsoType () const
bool  | Read (ON_BinaryArchive &) override
bool  | ReversedEdgeDir () const
bool  | ReversedTrimDir () const
const ON_Surface *  | Surface () const
ON_Interval  | TrimDomain () const
bool  | Write (ON_BinaryArchive &) const override
 Public Member Functions inherited from ON_CurveProxy
ON_CurveProxy () ON_NOEXCEPT
ON_CurveProxy (const ON_CurveProxy &)
ON_CurveProxy (const ON_Curve *)
ON_CurveProxy (const ON_Curve *, ON_Interval)
virtual  | ~ON_CurveProxy ()
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree () const override
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain () const override
ON_Curve overrides. More...
void  | Dump (ON_TextLog &) const override
for debugging More...
bool  | Evaluate (double, int, int, double *, int=0, int *=0) const override
Domain changes from [a,b] to [-b,-a]. More...
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetCurveParameterFromNurbFormParameter (double, double *) const override
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override More...
bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
int  | GetNurbForm (ON_NurbsCurve &, double=0.0, const ON_Interval *=nullptr) const override
bool  | GetNurbFormParameterFromCurveParameter (double, double *) const override
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override More...
bool  | GetParameterTolerance (double, double *, double *) const override
(optional - override if curve is piecewise smooth) More...
bool  | GetSpanVector (double *) const override
int  | HasNurbForm () const override
bool  | IsArc (const ON_Plane *=nullptr, ON_Arc *=nullptr, double=ON_ZERO_TOLERANCE) const override
bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
bool  | IsInPlane (const ON_Plane &, double=ON_ZERO_TOLERANCE) const override
bool  | IsLinear (double=ON_ZERO_TOLERANCE) const override
bool  | IsPeriodic (void) const override
periodic.) More...
bool  | IsPlanar (ON_Plane *=nullptr, double=ON_ZERO_TOLERANCE) const override
int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const override
virtual override of ON_Curve::IsPolyline More...
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_Object overrides. More...
ON_CurveProxy &  | operator= (const ON_CurveProxy &)
const ON_Curve *  | ProxyCurve () const
ON_Interval  | ProxyCurveDomain () const
bool  | ProxyCurveIsReversed () const
double  | RealCurveParameter (double t) const
bool  | Reverse () override
bool  | SetDomain (double t0, double t1) override
bool  | SetDomain (ON_Interval domain)
void  | SetProxyCurve (const ON_Curve *real_curve)
void  | SetProxyCurve (const ON_Curve *real_curve, ON_Interval real_curve_subdomain)
bool  | SetProxyCurveDomain (ON_Interval proxy_curve_subdomain)
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
int  | SpanCount () const override
number of smooth spans in curve More...
bool  | Split (double t, ON_Curve *&left_side, ON_Curve *&right_side) const override
override of virtual ON_Curve::Split More...
double  | ThisCurveParameter (double real_curve_parameter) const
bool  | Transform (const ON_Xform &) override
bool  | Trim (const ON_Interval &domain) override
override of virtual ON_Curve::Trim More...
 Public Member Functions inherited from ON_Curve
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
virtual bool  | ChangeClosedCurveSeam (double t)
virtual bool  | ChangeDimension (int desired_dimension)
ON_3dVector  | CurvatureAt (double t) const
ON_3dVector  | DerivativeAt (double t) const
void  | DestroyCurveTree ()
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
virtual bool  | Extend (const ON_Interval &domain)
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override More...
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
ON::object_type  | ObjectType () const override
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
ON_3dPoint  | PointAtEnd () const
ON_3dPoint  | PointAtStart () const
bool  | SetDomain (ON_Interval domain)
virtual bool  | SetEndPoint (ON_3dPoint end_point)
virtual bool  | SetStartPoint (ON_3dPoint start_point)
ON_3dVector  | TangentAt (double t) const
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
virtual bool  | HasBrepForm () const
virtual bool  | IsDeformable () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
virtual bool  | MakeDeformable ()
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
virtual bool  | SwapCoordinates (int i, int j)
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
void  | CopyUserData (const ON_Object &source_object)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
void  | MoveUserData (ON_Object &source_object)
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Public Attributes
const ON_Brep *  | m_brep
ON_COMPONENT_INDEX  | m_component_index
const ON_BrepEdge *  | m_edge
3d edge in m_brep More...
ON_Interval  | m_edge_domain = ON_Interval::EmptyInterval
corresponding domain of the edge - see note below More...
const ON_BrepFace *  | m_face
ON_UUID  | m_object_id
m_object_id = id of a brep or curve object in Rhino More...
const void *  | m_parent_object
Runtime helpers. More...
const ON_Surface *  | m_surface
const ON_BrepTrim *  | m_trim
2d trim in m_brep More...
ON_Interval  | m_trim_domain = ON_Interval::EmptyInterval
corresponding domain of the trim - see note below More...
 Friends
class  | ON_PolyEdgeCurve
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
 Protected Member Functions inherited from ON_CurveProxy
void  | SetProxyCurveIsReversed (bool bReversed)
 Protected Member Functions inherited from ON_Curve
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
Constructor & Destructor Documentation
◆ ON_PolyEdgeSegment()
 ON_PolyEdgeSegment::ON_PolyEdgeSegment  |  ( |   | )
construction
◆ ~ON_PolyEdgeSegment()
 ON_PolyEdgeSegment::~ON_PolyEdgeSegment  |  ( |   | )
Member Function Documentation
◆ Brep()
 const ON_Brep* ON_PolyEdgeSegment::Brep  |  ( |   | ) |   const
◆ BrepEdge()
 const ON_BrepEdge* ON_PolyEdgeSegment::BrepEdge  |  ( |   | ) |   const
◆ BrepFace()
 const ON_BrepFace* ON_PolyEdgeSegment::BrepFace  |  ( |   | ) |   const
◆ BrepTrim()
 const ON_BrepTrim* ON_PolyEdgeSegment::BrepTrim  |  ( |   | ) |   const
◆ Create() [1/2]
 bool ON_PolyEdgeSegment::Create  |  ( |  const ON_BrepTrim *  |  trim,
|  const ON_UUID &  |  object_id
)
Description: Creates a polyedge segment that uses the entire edge and has the same domain as the edge. Parameters: trim - [in] Returns: true if successful (edge was valid and trim_index was valid) Remarks: Use ON_Curve::SetDomain, ON_Curve::Trim, ON_Curve::Reverse, etc., to tweak the domain, support, direction etc.
◆ Create() [2/2]
 bool ON_PolyEdgeSegment::Create  |  ( |  const ON_Curve *  |  curve,
|  const ON_UUID &  |  object_id
)
Description: Creates a polyedge segment that uses the entire curve and has the same domain as the curve. Parameters: curve - [in] Remarks: Use ON_Curve::SetDomain, ON_Curve::Trim, ON_Curve::Reverse, etc., to tweak the domain, support, direction etc.
◆ DestroyRuntimeCache()
 void ON_PolyEdgeSegment::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
default copy constructor and operator= are fine.
virtual ON_Object::DestroyRuntimeCache override
Reimplemented from ON_CurveProxy.
◆ DuplicateCurve()
 ON_Curve* ON_PolyEdgeSegment::DuplicateCurve  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::DuplicateCurve override
Reimplemented from ON_CurveProxy.
◆ EdgeDomain()
 ON_Interval ON_PolyEdgeSegment::EdgeDomain  |  ( |   | ) |   const
Returns: subdomain of the edge that this segment uses. This can be different than the domain returned by this->Domain().
◆ EdgeParameter()
 double ON_PolyEdgeSegment::EdgeParameter  |  ( |  double  |  t | ) |   const
◆ IsClosed()
 bool ON_PolyEdgeSegment::IsClosed  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::IsClosed override
Reimplemented from ON_CurveProxy.
◆ IsoType()
 ON_Surface::ISO ON_PolyEdgeSegment::IsoType  |  ( |   | ) |   const
◆ Read()
 bool ON_PolyEdgeSegment::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::ReadObject(). Parameters: binary_archive - archive to read from Returns: Returns true if the read is successful. Remarks: Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_CurveProxy.
◆ ReversedEdgeDir()
 bool ON_PolyEdgeSegment::ReversedEdgeDir  |  ( |   | ) |   const
Returns: True if this segment has an ON_BrepEdge and the direction of the ON_BrepEdge is the reverse of the direction of the segment.
◆ ReversedTrimDir()
 bool ON_PolyEdgeSegment::ReversedTrimDir  |  ( |   | ) |   const
Returns: True if this segment has an ON_BrepTrim and the direction of the ON_BrepTrime is the reverse of the direction of the segment.
◆ Surface()
 const ON_Surface* ON_PolyEdgeSegment::Surface  |  ( |   | ) |   const
◆ TrimDomain()
 ON_Interval ON_PolyEdgeSegment::TrimDomain  |  ( |   | ) |   const
Returns: subdomain of the trim that this segment uses. This can be different than the domain returned by this->Domain().
◆ Write()
 bool ON_PolyEdgeSegment::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::WriteObject(). Parameters: binary_archive - archive to write to Returns: Returns true if the write is successful. Remarks: Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
 The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_CurveProxy.
Friends And Related Function Documentation
◆ ON_PolyEdgeCurve
 friend class ON_PolyEdgeCurve
friend
Member Data Documentation
◆ m_brep
 const ON_Brep* ON_PolyEdgeSegment::m_brep
◆ m_component_index
 ON_COMPONENT_INDEX ON_PolyEdgeSegment::m_component_index
When the Rhino object is a brep, m_component_index refers to either an edge or a trim.
◆ m_edge
 const ON_BrepEdge* ON_PolyEdgeSegment::m_edge
3d edge in m_brep
◆ m_edge_domain
 ON_Interval ON_PolyEdgeSegment::m_edge_domain = ON_Interval::EmptyInterval
corresponding domain of the edge - see note below
◆ m_face
 const ON_BrepFace* ON_PolyEdgeSegment::m_face
◆ m_object_id
 ON_UUID ON_PolyEdgeSegment::m_object_id
m_object_id = id of a brep or curve object in Rhino
◆ m_parent_object
 const void* ON_PolyEdgeSegment::m_parent_object
Runtime helpers.
When m_component_index refers to an ON_BrepTrim, there are four domains and 4 classes derived from ON_Curve that play a role in the polyedge segment. It is possible for all 4 of these domains to be different.
"this" ON_PolyEdgeSegment is an ON_ProxyCurve. The evaluation domain of "this" is = this->Domain() = ON_ProxyCurve::m_this_domain
ON_ProxyCurve::m_real_curve points to the curve in the c3 = ON_Brep::m_C3[edge.m_c3i]. "this" is a proxy for some sub-interval of c3. = this->ProxyCurveDomain() = ON_ProxyCurve::m_real_curve_domain
The edge, an ON_BrepEdge, is also a proxy based on c3, and the edge's evaluation domain is edge.m_this_domain.
 ON_PolyEdgeSegment::m_edge_domain records the increasing subinterval of edge.m_this_domain that corresponds to the portion of c3 "this" is using.
The trim, an ON_BrepTrim, is a proxy based on a curve in ON_Brep::m_C2[]. Some portion of the trim corresponds to the portion of the edge we are using. m_trim_domain is an increasing, possible subinterval, of the trim's domain ON_BrepTrim::m_this_domain.CRhinoBrepObject or CRhinoCurveObject
◆ m_surface
 const ON_Surface* ON_PolyEdgeSegment::m_surface
◆ m_trim
 const ON_BrepTrim* ON_PolyEdgeSegment::m_trim
2d trim in m_brep
◆ m_trim_domain
 ON_Interval ON_PolyEdgeSegment::m_trim_domain = ON_Interval::EmptyInterval
corresponding domain of the trim - see note below