Public Member Functions | Protected Member Functions | List of all members
ON_Curve Class Referenceabstract
#include <opennurbs_curve.h>
 Inheritance diagram for ON_Curve:
 Public Member Functions
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
virtual bool  | ChangeClosedCurveSeam (double t)
virtual bool  | ChangeDimension (int desired_dimension)
ON_3dVector  | CurvatureAt (double t) const
virtual int  | Degree () const =0
ON_3dVector  | DerivativeAt (double t) const
void  | DestroyCurveTree ()
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
virtual ON_Interval  | Domain () const =0
virtual ON_Curve *  | DuplicateCurve () const
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
virtual bool  | Evaluate (double t, int der_count, int v_stride, double *v, int side=0, int *hint=0) const =0
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
virtual bool  | Extend (const ON_Interval &domain)
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
virtual bool  | GetCurveParameterFromNurbFormParameter (double nurbs_t, double *curve_t) const
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const
virtual int  | GetNurbForm (ON_NurbsCurve &nurbs_curve, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
virtual bool  | GetNurbFormParameterFromCurveParameter (double curve_t, double *nurbs_t) const
virtual bool  | GetParameterTolerance (double t, double *tminus, double *tplus) const
virtual bool  | GetSpanVector (double *knots) const =0
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override More...
virtual int  | HasNurbForm () const
virtual bool  | IsArc (const ON_Plane *plane=nullptr, ON_Arc *arc=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
virtual bool  | IsClosed () const
virtual bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
virtual bool  | IsInPlane (const ON_Plane &test_plane, double tolerance=ON_ZERO_TOLERANCE) const =0
virtual bool  | IsLinear (double tolerance=ON_ZERO_TOLERANCE) const
virtual bool  | IsPeriodic () const
virtual bool  | IsPlanar (ON_Plane *plane=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
virtual int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
ON::object_type  | ObjectType () const override
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
ON_3dPoint  | PointAtEnd () const
ON_3dPoint  | PointAtStart () const
virtual bool  | Reverse ()=0
bool  | SetDomain (ON_Interval domain)
virtual bool  | SetDomain (double t0, double t1)
virtual bool  | SetEndPoint (ON_3dPoint end_point)
virtual bool  | SetStartPoint (ON_3dPoint start_point)
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
virtual int  | SpanCount () const =0
virtual bool  | Split (double t, ON_Curve *&left_side, ON_Curve *&right_side) const
ON_3dVector  | TangentAt (double t) const
bool  | Transform (const ON_Xform &xform) override
virtual bool  | Trim (const ON_Interval &domain)
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
virtual int  | Dimension () const
virtual bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
virtual bool  | HasBrepForm () const
virtual bool  | IsDeformable () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
virtual bool  | MakeDeformable ()
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
virtual bool  | SwapCoordinates (int i, int j)
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
void  | CopyUserData (const ON_Object &source_object)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
void  | MoveUserData (ON_Object &source_object)
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Protected Member Functions
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
Detailed Description
Description: ON_Curve is a pure virtual class for curve objects
Any class derived from ON_Curve should have a ON_OBJECT_DECLARE(ON_...); at the beginning of its class definition and a ON_OBJECT_IMPLEMENT( ON_..., ON_Curve ); in a .cpp file. Example:
See the definition of ON_NurbsCurve for an example.
Constructor & Destructor Documentation
◆ ON_Curve() [1/2]
 ON_Curve::ON_Curve  |  ( |   | )
◆ ~ON_Curve()
 virtual ON_Curve::~ON_Curve  |  ( |   | )
virtual
◆ ON_Curve() [2/2]
 ON_Curve::ON_Curve  |  ( |  const ON_Curve &  |   | )
Member Function Documentation
◆ ChangeClosedCurveSeam()
 virtual bool ON_Curve::ChangeClosedCurveSeam  |  ( |  double  |  t | )
virtual
Description: If this curve is closed, then modify it so that the start/end point is at curve parameter t. Parameters: t - [in] curve parameter of new start/end point. The returned curves domain will start at t. Returns: true if successful.
Reimplemented in ON_NurbsCurve, ON_PolyCurve, ON_PolylineCurve, ON_ArcCurve, and ON_PolyEdgeCurve.
◆ ChangeDimension()
 virtual bool ON_Curve::ChangeDimension  |  ( |  int  |  desired_dimension | )
virtual
Description: Change the dimension of a curve. Parameters: desired_dimension - [in] Returns: true if the curve's dimension was already desired_dimension or if the curve's dimension was successfully changed to desired_dimension.
Reimplemented in ON_NurbsCurve, ON_PolyCurve, ON_ArcCurve, ON_PolylineCurve, and ON_LineCurve.
◆ CurvatureAt()
 ON_3dVector ON_Curve::CurvatureAt  |  ( |  double  |  t | ) |   const
Description: Evaluate the curvature vector at a parameter. Parameters: t - [in] evaluation parameter Returns: curvature vector of the curve at the parameter t. Remarks: No error handling. See Also: ON_Curve::EvCurvature
◆ Degree()
 virtual int ON_Curve::Degree  |  ( |   | ) |   const
pure virtual
Description: Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. Returns: degree
Implemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ DerivativeAt()
 ON_3dVector ON_Curve::DerivativeAt  |  ( |  double  |  t | ) |   const
Description: Evaluate first derivative at a parameter. Parameters: t - [in] evaluation parameter Returns: First derivative of the curve at the parameter t. Remarks: No error handling. See Also: ON_Curve::Ev1Der
◆ DestroyCurveTree()
 void ON_Curve::DestroyCurveTree  |  ( |   | )
Description: Destroys the runtime curve tree used to speed closest point and intersection calcuations. Remarks: If the geometry of the curve is modified in any way, then call DestroyCurveTree(); The curve tree is created as needed.
◆ DestroyRuntimeCache()
 void ON_Curve::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
virtual ON_Object::DestroyRuntimeCache override
Reimplemented from ON_Object.
Reimplemented in ON_PolyEdgeSegment, ON_CurveProxy, ON_PolyCurve, and ON_PolyEdgeCurve.
◆ Domain()
 virtual ON_Interval ON_Curve::Domain  |  ( |   | ) |   const
pure virtual
Returns: domain of the curve.
Implemented in ON_NurbsCurve, ON_CurveProxy, ON_ArcCurve, ON_PolyCurve, ON_PolylineCurve, ON_CurveOnSurface, and ON_LineCurve.
◆ DuplicateCurve()
 virtual ON_Curve* ON_Curve::DuplicateCurve  |  ( |   | ) |   const
virtual
Description: Get a duplicate of the curve. Returns: A duplicate of the curve.
 Remarks: The caller must delete the returned curve. For non-ON_CurveProxy objects, this simply duplicates the curve using ON_Object::Duplicate. For ON_CurveProxy objects, this duplicates the actual proxy curve geometry and, if necessary, trims and reverse the result to that the returned curve's parameterization and locus match the proxy curve's.
Reimplemented in ON_CurveProxy, ON_PolyEdgeSegment, ON_PolyCurve, and ON_PolyEdgeCurve.
◆ Ev1Der()
 bool ON_Curve::Ev1Der  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  ON_3dVector &  |  first_derivative,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Description: Evaluate first derivative at a parameter with error checking. Parameters: t - [in] evaluation parameter point - [out] value of curve at t first_derivative - [out] value of first derivative at t side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::EvPoint ON_Curve::Ev2Der ON_Curve::EvTangent ON_Curve::Evaluate
◆ Ev2Der()
 bool ON_Curve::Ev2Der  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  ON_3dVector &  |  first_derivative,
|  ON_3dVector &  |  second_derivative,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Description: Evaluate second derivative at a parameter with error checking. Parameters: t - [in] evaluation parameter point - [out] value of curve at t first_derivative - [out] value of first derivative at t second_derivative - [out] value of second derivative at t side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::Ev1Der ON_Curve::EvCurvature ON_Curve::Evaluate
◆ Evaluate()
 virtual bool ON_Curve::Evaluate  |  ( |  double  |  t,
|  int  |  der_count,
|  int  |  v_stride,
|  double *  |  v,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
pure virtual
Description: This evaluator actually does all the work. The other ON_Curve evaluation tools call this virtual function. Parameters: t - [in] evaluation parameter ( usually in Domain() ). der_count - [in] (>=0) number of derivatives to evaluate v_stride - [in] (>=Dimension()) stride to use for the v[] array v - [out] array of length (der_count+1)*v_stride curve(t) is returned in (v[0],...,v[m_dim-1]), curve'(t) is retuned in (v[v_stride],...,v[v_stride+m_dim-1]), curve"(t) is retuned in (v[2*v_stride],...,v[2*v_stride+m_dim-1]), etc. side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::EvPoint ON_Curve::Ev1Der ON_Curve::Ev2Der
Implemented in ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ EvaluatePoint()
 bool ON_Curve::EvaluatePoint  |  ( |  const class ON_ObjRef &  |  objref,
|  ON_3dPoint &  |  P
) |   |  const
overridevirtual
virtual ON_Geometry override
Reimplemented from ON_Geometry.
Reimplemented in ON_PolyCurve.
◆ EvCurvature()
 bool ON_Curve::EvCurvature  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  ON_3dVector &  |  tangent,
|  ON_3dVector &  |  kappa,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Description: Evaluate unit tangent and curvature at a parameter with error checking. Parameters: t - [in] evaluation parameter point - [out] value of curve at t tangent - [out] value of unit tangent kappa - [out] value of curvature vector side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::CurvatureAt ON_Curve::Ev2Der ON_EvCurvature
◆ EvPoint()
 bool ON_Curve::EvPoint  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Description: Evaluate point at a parameter with error checking. Parameters: t - [in] evaluation parameter point - [out] value of curve at t side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::PointAt ON_Curve::EvTangent ON_Curve::Evaluate
◆ EvTangent()
 bool ON_Curve::EvTangent  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  ON_3dVector &  |  tangent,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Description: Evaluate unit tangent at a parameter with error checking. Parameters: t - [in] evaluation parameter point - [out] value of curve at t tangent - [out] value of unit tangent side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::TangentAt ON_Curve::Ev1Der
◆ Extend()
 virtual bool ON_Curve::Extend  |  ( |  const ON_Interval &  |  domain | )
virtual
Description: Pure virtual function. Default returns false. Where possible, analytically extends curve to include domain. Parameters: domain - [in] if domain is not included in curve domain, curve will be extended so that its domain includes domain.
 Will not work if curve is closed. Original curve is identical to the restriction of the resulting curve to the original curve domain, Returns: true if successful.
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, and ON_LineCurve.
◆ FirstSpanIsLinear() [1/2]
 bool ON_Curve::FirstSpanIsLinear  |  ( |  double  |  min_length,
|  double  |  tolerance
) |   |  const
Parameters: min_length -[in] minimum length of a linear span tolerance -[in] distance tolerance to use when checking linearity. Returns true if the span is a non-degenrate line. This means:
dimension = 2 or 3
The length of the the line segment from the span's initial point to the span's control point is >= min_length.
The maximum distance from the line segment to the span is <= tolerance and the span increases monotonically in the direction of the line segment.
◆ FirstSpanIsLinear() [2/2]
 bool ON_Curve::FirstSpanIsLinear  |  ( |  double  |  min_length,
|  double  |  tolerance,
|  ON_Line *  |  span_line
) |   |  const
◆ FrameAt()
 bool ON_Curve::FrameAt  |  ( |  double  |  t,
|  ON_Plane &  |  plane
) |   |  const
Description: Return a 3d frame at a parameter. Parameters: t - [in] evaluation parameter plane - [out] the frame is returned here Returns: true if successful See Also: ON_Curve::PointAt, ON_Curve::TangentAt, ON_Curve::Ev1Der, Ev2Der
◆ GetCurveParameterFromNurbFormParameter()
 virtual bool ON_Curve::GetCurveParameterFromNurbFormParameter  |  ( |  double  |  nurbs_t,
|  double *  |  curve_t
) |   |  const
virtual
Description: Convert a NURBS curve parameter to a curve parameter
Parameters: nurbs_t - [in] nurbs form parameter curve_t - [out] curve parameter
Remarks: If GetNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.
See Also: ON_Curve::GetNurbForm, ON_Curve::GetNurbFormParameterFromCurveParameter
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_LineCurve, and ON_ArcCurve.
◆ GetDomain()
 bool ON_Curve::GetDomain  |  ( |  double *  |  t0,
|  double *  |  t1
) |   |  const
curve interface
Description: Gets domain of the curve Parameters: t0 - [out] t1 - [out] domain is [*t0, *t1] Returns: true if successful.
◆ GetNextDiscontinuity()
 virtual bool ON_Curve::GetNextDiscontinuity  |  ( |  ON::continuity  |  c,
|  double  |  t0,
|  double  |  t1,
|  double *  |  t,
|  int *  |  hint = nullptr,
|  int *  |  dtype = nullptr,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
virtual
Description: Search for a derivatitive, tangent, or curvature discontinuity. Parameters: c - [in] type of continity to test for. t0 - [in] Search begins at t0. If there is a discontinuity at t0, it will be ignored. This makes it possible to repeatedly call GetNextDiscontinuity and step through the discontinuities. t1 - [in] (t0 != t1) If there is a discontinuity at t1 is will be ingored unless c is a locus discontinuity type and t1 is at the start or end of the curve. t - [out] if a discontinuity is found, then *t reports the parameter at the discontinuity. hint - [in/out] if GetNextDiscontinuity will be called repeatedly, passing a "hint" with initial value *hint=0 will increase the speed of the search.
 dtype - [out] if not nullptr, *dtype reports the kind of discontinuity found at *t. A value of 1 means the first derivative or unit tangent was discontinuous. A value of 2 means the second derivative or curvature was discontinuous. A value of 0 means teh curve is not closed, a locus discontinuity test was applied, and t1 is at the start of end of the curve. If 'c', the type of continuity to test for is ON::continuity::Gsmooth_continuous and the curvature changes from curved to 0 or 0 to curved and there is no tangency kink dtype is returns 3 cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous. If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. Returns: Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
true if a parametric discontinuity was found strictly between t0 and t1. Note well that all curves are parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
true if a locus discontinuity was found strictly between t0 and t1 or at t1 is the at the end of a curve. Note well that all open curves (IsClosed()=false) are locus discontinuous at the ends of their domains. All closed curves (IsClosed()=true) are at least C0_locus_continuous at the ends of their domains.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, and ON_PolyCurve.
◆ GetNurbForm()
 virtual int ON_Curve::GetNurbForm  |  ( |  ON_NurbsCurve &  |  nurbs_curve,
|  double  |  tolerance = 0.0,
|  const ON_Interval *  |  subdomain = nullptr
) |   |  const
virtual
Description: Get a NURBS curve representation of this curve. Parameters: nurbs_curve - [out] NURBS representation returned here tolerance - [in] tolerance to use when creating NURBS representation. subdomain - [in] if not nullptr, then the NURBS representation for this portion of the curve is returned. Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - returned NURBS parameterization matches the curve's to wthe desired accuracy 2 success - returned NURBS point locus matches the curve's to the desired accuracy and the domain of the NURBS curve is correct. On However, This curve's parameterization and the NURBS curve parameterization may not match to the desired accuracy. This situation happens when getting NURBS representations of curves that have a transendental parameterization like circles Remarks: This is a low-level virtual function. If you do not need the parameterization information provided by the return code, then ON_Curve::NurbsCurve may be easier to use. See Also: ON_Curve::NurbsCurve
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ GetNurbFormParameterFromCurveParameter()
 virtual bool ON_Curve::GetNurbFormParameterFromCurveParameter  |  ( |  double  |  curve_t,
|  double *  |  nurbs_t
) |   |  const
virtual
Description: Convert a curve parameter to a NURBS curve parameter.
Parameters: curve_t - [in] curve parameter nurbs_t - [out] nurbs form parameter
Remarks: If GetNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.
See Also: ON_Curve::GetNurbForm, ON_Curve::GetCurveParameterFromNurbFormParameter
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_LineCurve, and ON_ArcCurve.
◆ GetParameterTolerance()
 virtual bool ON_Curve::GetParameterTolerance  |  ( |  double  |  t,
|  double *  |  tminus,
|  double *  |  tplus
) |   |  const
virtual
Description: Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. Returns: degree
Parameters
t | returns tminus < tplus: parameters tminus <= s <= tplus [IN] t = parameter in domain
[out] | tminus | tminus
[out] | tplus | tplus
Reimplemented in ON_NurbsCurve, ON_CurveProxy, and ON_CurveOnSurface.
◆ GetSpanVector()
 virtual bool ON_Curve::GetSpanVector  |  ( |  double *  |  knots | ) |   const
pure virtual
Description: Get number of parameters of "knots". Parameters: knots - [out] an array of length SpanCount()+1 is filled in with the parameters where the curve is not smooth (C-infinity). Returns: true if successful
Implemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ GetSpanVectorIndex()
 virtual bool ON_Curve::GetSpanVectorIndex  |  ( |  double  |  t,
|  int  |  side,
|  int *  |  span_vector_index,
|  ON_Interval *  |  span_domain
) |   |  const
virtual
If t is in the domain of the curve, GetSpanVectorIndex() returns the span vector index "i" such that span_vector[i] <= t <= span_vector[i+1]. The "side" parameter determines which span is selected when t is at the end of a span.
Parameters
[in] | t | t = evaluation parameter
[in] | side | side 0 = default, -1 = from below, +1 = from above
[out] | span_vector_index | span vector index
[out] | span_domain | domain of the span containing "t"
◆ GetTightBoundingBox()
 bool ON_Curve::GetTightBoundingBox  |  ( |  class ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const class ON_Xform *  |  xform = nullptr
) |   |  const
overridevirtual
virtual ON_Geometry GetTightBoundingBox override
Reimplemented from ON_Geometry.
Reimplemented in ON_PolyCurve, ON_PolylineCurve, and ON_LineCurve.
◆ HasNurbForm()
 virtual int ON_Curve::HasNurbForm  |  ( |   | ) |   const
virtual
Description: Does a NURBS curve representation of this curve. Parameters: Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - NURBS parameterization matches the curve's to wthe desired accuracy 2 success - NURBS point locus matches the curve's and the domain of the NURBS curve is correct.
 However, This curve's parameterization and the NURBS curve parameterization may not match. This situation happens when getting NURBS representations of curves that have a transendental parameterization like circles Remarks: This is a low-level virtual function.
 See Also: ON_Curve::GetNurbForm ON_Curve::NurbsCurve
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_LineCurve, and ON_ArcCurve.
◆ IsArc()
 virtual bool ON_Curve::IsArc  |  ( |  const ON_Plane *  |  plane = nullptr,
|  ON_Arc *  |  arc = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
virtual
Description: Test a curve to see if the locus if its points is an arc or circle. Parameters: plane - [in] if not nullptr, test is performed in this plane arc - [out] if not nullptr and true is returned, then arc parameters are filled in tolerance - [in] tolerance to use when checking Returns: ON_Arc.m_angle > 0 if curve locus is an arc between specified points. If ON_Arc.m_angle is 2.0*ON_PI, then the curve is a circle.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ IsArcAt()
 bool ON_Curve::IsArcAt  |  ( |  double  |  t,
|  const ON_Plane *  |  plane = 0,
|  ON_Arc *  |  arc = 0,
|  double  |  tolerance = ON_ZERO_TOLERANCE,
|  double *  |  t0 = 0,
|  double *  |  t1 = 0
) |   |  const
Description: Parameters: t - [in] curve parameter plane - [in] if not nullptr, test is performed in this plane arc - [out] if not nullptr and true is returned, then arc parameters are filled in tolerance - [in] tolerance to use when checking t0 - [out] if not nullptr, and then *t0 is set to the parameter at the start of the G2 curve segment that was tested. t1 - [out] if not nullptr, and then *t0 is set to the parameter at the start of the G2 curve segment that was tested. Returns: True if the paramter t is on a arc segment of the curve.
◆ IsClosable()
 bool ON_Curve::IsClosable  |  ( |  double  |  tolerance,
|  double  |  min_abs_size = 0.0,
|  double  |  min_rel_size = 10.0
) |   |  const
Description: Decide if it makes sense to close off this curve by moving the endpoint to the start based on start-end gap size and length of curve as approximated by chord defined by 6 points. Parameters: tolerance - [in] maximum allowable distance between start and end. if start - end gap is greater than tolerance, returns false min_abs_size - [in] if greater than 0.0 and none of the interior sampled points are at least min_abs_size from start, returns false. min_rel_size - [in] if greater than 1.0 and chord length is less than min_rel_size*gap, returns false. Returns: true if start and end points are close enough based on above conditions.
◆ IsClosed()
 virtual bool ON_Curve::IsClosed  |  ( |   | ) |   const
virtual
Description: Test a curve to see if it is closed. Returns: true if the curve is closed.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_BrepEdge, ON_ArcCurve, ON_LineCurve, ON_PolyEdgeSegment, ON_CurveOnSurface, and ON_PolyEdgeCurve.
◆ IsContinuous()
 virtual bool ON_Curve::IsContinuous  |  ( |  ON::continuity  |  c,
|  double  |  t,
|  int *  |  hint = nullptr,
|  double  |  point_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d1_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d2_tolerance = ON_ZERO_TOLERANCE,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
virtual
Description: Test continuity at a curve parameter value. Parameters: c - [in] type of continuity to test for. Read ON::continuity comments for details. t - [in] parameter to test hint - [in] evaluation hint point_tolerance - [in] if the distance between two points is greater than point_tolerance, then the curve is not C0. d1_tolerance - [in] if the difference between two first derivatives is greater than d1_tolerance, then the curve is not C1. d2_tolerance - [in] if the difference between two second derivatives is greater than d2_tolerance, then the curve is not C2. cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous or ON::continuity::Gsmooth_continuous.
 ON::continuity::G2_continuous: If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. ON::continuity::Gsmooth_continuous: If K0 and K1 are curvatures evaluated from above and below and the angle between K0 and K1 is at least twice angle tolerance or ||K0| - |K1|| > (max(|K0|,|K1|) > curvature_tolerance, then a curvature discontinuity is reported. Returns: true if the curve has at least the c type continuity at the parameter t.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, and ON_ArcCurve.
◆ IsEllipse()
 virtual bool ON_Curve::IsEllipse  |  ( |  const ON_Plane *  |  plane = nullptr,
|  ON_Ellipse *  |  ellipse = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
virtual
◆ IsInPlane()
 virtual bool ON_Curve::IsInPlane  |  ( |  const ON_Plane &  |  test_plane,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
pure virtual
Description: Test a curve to see if it lies in a specific plane. Parameters: test_plane - [in] tolerance - [in] tolerance to use when checking Returns: true if the maximum distance from the curve to the test_plane is <= tolerance.
Implemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ IsLinear()
 virtual bool ON_Curve::IsLinear  |  ( |  double  |  tolerance = ON_ZERO_TOLERANCE | ) |   const
virtual
Description: Test a curve to see if the locus if its points is a line segment. Parameters: tolerance - [in] ///< tolerance to use when checking linearity Returns: true if the ends of the curve are farther than tolerance apart and the maximum distance from any point on the curve to the line segment connecting the curve's ends is <= tolerance.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ IsPeriodic()
 virtual bool ON_Curve::IsPeriodic  |  ( |   | ) |   const
virtual
Description: Test a curve to see if it is periodic. Returns: true if the curve is closed and at least C2 at the start/end.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ IsPlanar()
 virtual bool ON_Curve::IsPlanar  |  ( |  ON_Plane *  |  plane = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
virtual
Description: Test a curve to see if it is planar. Parameters: plane - [out] if not nullptr and true is returned, the plane parameters are filled in. tolerance - [in] tolerance to use when checking Returns: true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ IsPolyline()
 virtual int ON_Curve::IsPolyline  |  ( |  ON_SimpleArray< ON_3dPoint > *  |  pline_points = nullptr,
|  ON_SimpleArray< double > *  |  pline_t = nullptr
) |   |  const
virtual
Description: Several types of ON_Curve can have the form of a polyline including a degree 1 ON_NurbsCurve, an ON_PolylineCurve, and an ON_PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline. Parameters: pline_points - [out] if not nullptr and true is returned, then the points of the polyline form are returned here. t - [out] if not nullptr and true is returned, then the parameters of the polyline points are returned here. Returns: table 0 curve is not some form of a polyline >=2 number of points in polyline form
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, and ON_LineCurve.
◆ LastSpanIsLinear() [1/2]
 bool ON_Curve::LastSpanIsLinear  |  ( |  double  |  min_length,
|  double  |  tolerance
) |   |  const
◆ LastSpanIsLinear() [2/2]
 bool ON_Curve::LastSpanIsLinear  |  ( |  double  |  min_length,
|  double  |  tolerance,
|  ON_Line *  |  span_line
) |   |  const
◆ NurbsCurve()
 ON_NurbsCurve* ON_Curve::NurbsCurve  |  ( |  ON_NurbsCurve *  |  pNurbsCurve = nullptr,
|  double  |  tolerance = 0.0,
|  const ON_Interval *  |  subdomain = nullptr
) |   |  const
Description: Get a NURBS curve representation of this curve. Parameters: pNurbsCurve - [in/out] if not nullptr, this ON_NurbsCurve will be used to store the NURBS representation of the curve will be returned. tolerance - [in] tolerance to use when creating NURBS representation. subdomain - [in] if not nullptr, then the NURBS representation for this portion of the curve is returned. Returns: nullptr or a NURBS representation of the curve. Remarks: See ON_Surface::GetNurbForm for important details about the NURBS surface parameterization. See Also: ON_Curve::GetNurbForm
◆ ObjectType()
 ON::object_type ON_Curve::ObjectType  |  ( |   | ) |   const
overridevirtual
Description: overrides virtual ON_Object::ObjectType. Returns: ON::curve_object
Reimplemented from ON_Object.
◆ operator=()
 ON_Curve& ON_Curve::operator=  |  ( |  const ON_Curve &  |   | )
◆ ParameterSearch()
 bool ON_Curve::ParameterSearch  |  ( |  double  |  t,
|  int &  |  index,
|  bool  |  bEnableSnap,
|  const ON_SimpleArray< double > &  |  m_t,
|  double  |  RelTol = ON_SQRT_EPSILON
) |   |  const
protected
Description: Lookup a parameter in the m_t array, optionally using a built in snap tolerance to snap a parameter value to an element of m_t. This function is used by some types derived from ON_Curve to snap parameter values Parameters: t - [in] parameter index -[out] index into m_t such that if function returns false then
 @table
 value                  condition
-1                                   t<m_t[0] or m_t is empty
    0<=i<=m_t.Count()-2     m_t[i] < t < m_t[i+1]
    m_t.Count()-1                   t>m_t[ m_t.Count()-1]
if the function returns true then t is equal to, or is closest to and
within  tolerance of m_t[index].
bEnableSnap-[in] enable snapping m_t -[in] Array of parameter values to snap to RelTol -[in] tolerance used in snapping
Returns:
 true if the t is exactly equal to (bEnableSnap==false), or within tolerance of (bEnableSnap==true) m_t[index].
◆ PointAt()
 ON_3dPoint ON_Curve::PointAt  |  ( |  double  |  t | ) |   const
Description: Evaluate point at a parameter. Parameters: t - [in] evaluation parameter Returns: Point (location of curve at the parameter t). Remarks: No error handling. See Also: ON_Curve::EvPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
◆ PointAtEnd()
 ON_3dPoint ON_Curve::PointAtEnd  |  ( |   | ) |   const
Description: Evaluate point at the end of the curve. Parameters: t - [in] evaluation parameter Returns: Point (location of the end of the curve.) Remarks: No error handling. See Also: ON_Curve::PointAt
◆ PointAtStart()
 ON_3dPoint ON_Curve::PointAtStart  |  ( |   | ) |   const
Description: Evaluate point at the start of the curve. Parameters: t - [in] evaluation parameter Returns: Point (location of the start of the curve.) Remarks: No error handling. See Also: ON_Curve::PointAt
◆ Reverse()
 virtual bool ON_Curve::Reverse  |  ( |   | )
pure virtual
Description: Reverse the direction of the curve. Returns: true if curve was reversed. Remarks: If reveresed, the domain changes from [a,b] to [-b,-a]
Implemented in ON_NurbsCurve, ON_BrepTrim, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_BrepEdge, ON_LineCurve, ON_ArcCurve, and ON_CurveOnSurface.
◆ SetDomain() [1/2]
 bool ON_Curve::SetDomain  |  ( |  ON_Interval  |  domain | )
Description: Set the domain of the curve. Parameters: domain - [in] increasing interval Returns: true if successful.
◆ SetDomain() [2/2]
 virtual bool ON_Curve::SetDomain  |  ( |  double  |  t0,
|  double  |  t1
)
virtual
Description: Set the domain of the curve Parameters: t0 - [in] t1 - [in] new domain will be [t0,t1] Returns: true if successful.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, ON_PolylineCurve, and ON_LineCurve.
◆ SetEndPoint()
 virtual bool ON_Curve::SetEndPoint  |  ( |  ON_3dPoint  |  end_point | )
virtual
Description: Force the curve to end at a specified point. Parameters: end_point - [in] Returns: true if successful. Remarks: Some end points cannot be moved. Be sure to check return code. ON_Curve::SetEndPoint() returns true if end_point is the same as the end of the curve, false otherwise. See Also: ON_Curve::SetStartPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_PolyEdgeCurve.
◆ SetStartPoint()
 virtual bool ON_Curve::SetStartPoint  |  ( |  ON_3dPoint  |  start_point | )
virtual
Description: Force the curve to start at a specified point. Parameters: start_point - [in] Returns: true if successful. Remarks: Some end points cannot be moved. Be sure to check return code. ON_Curve::SetStartPoint() returns true if start_point is the same as the start of the curve, false otherwise. See Also: ON_Curve::SetEndPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_PolyEdgeCurve.
◆ SizeOf()
 unsigned int ON_Curve::SizeOf  |  ( |   | ) |   const
overridevirtual
virtual ON_Object::SizeOf override
Reimplemented from ON_Object.
Reimplemented in ON_NurbsCurve, ON_PolyCurve, ON_CurveProxy, ON_CurveOnSurface, ON_LineCurve, and ON_PolylineCurve.
◆ SpanCount()
 virtual int ON_Curve::SpanCount  |  ( |   | ) |   const
pure virtual
Description: Get number of nonempty smooth (c-infinity) spans in curve Returns: Number of nonempty smooth (c-infinity) spans.
Implemented in ON_NurbsCurve, ON_CurveProxy, ON_PolyCurve, ON_PolylineCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ Split()
 virtual bool ON_Curve::Split  |  ( |  double  |  t,
|  ON_Curve *&  |  left_side,
|  ON_Curve *&  |  right_side
) |   |  const
virtual
Description: Splits (divides) the curve at the specified parameter.
 The parameter must be in the interior of the curve's domain. The pointers passed to Split must either be nullptr or point to an ON_Curve object of the same type. If the pointer is nullptr, then a curve will be created in Split(). You may pass "this" as left_side or right_side. Parameters: t - [in] parameter to split the curve at in the interval returned by Domain(). left_side - [out] left portion of curve returned here right_side - [out] right portion of curve returned here Returns: true - The curve was split into two pieces.
 false - The curve could not be split. For example if the parameter is too close to an endpoint.
Example: For example, if crv were an ON_NurbsCurve, then
  ON_NurbsCurve right_side;
  crv.Split( crv.Domain().Mid() &crv, &right_side );
would split crv at the parametric midpoint, put the left side in crv, and return the right side in right_side.
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_ArcCurve, and ON_LineCurve.
◆ TangentAt()
 ON_3dVector ON_Curve::TangentAt  |  ( |  double  |  t | ) |   const
Description: Evaluate unit tangent vector at a parameter. Parameters: t - [in] evaluation parameter Returns: Unit tangent vector of the curve at the parameter t. Remarks: No error handling. See Also: ON_Curve::EvTangent
◆ Transform()
 bool ON_Curve::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
Description: overrides virtual ON_Geometry::Transform(). ON_Curve::Transform() calls ON_Geometry::Transform(xform), which calls ON_Object::TransformUserData(xform), and then calls this->DestroyCurveTree(). Parameters: xform - [in] transformation to apply to object. Remarks: Classes derived from ON_Curve should call ON_Curve::Transform() to handle user data transformations and curve tree destruction and then transform their definition.
Reimplemented from ON_Geometry.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolyCurve, ON_PolylineCurve, ON_CurveOnSurface, and ON_LineCurve.
◆ Trim()
 virtual bool ON_Curve::Trim  |  ( |  const ON_Interval &  |  domain | )
virtual
Description: Removes portions of the curve outside the specified interval. Parameters: domain - [in] interval of the curve to keep. Portions of the curve before curve(domain[0]) and after curve(domain[1]) are removed. Returns: true if successful.
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, and ON_LineCurve.