Public Member Functions | Public Attributes | List of all members
ON_ObsoleteUserData Class Reference
#include <opennurbs_userdata.h>
 Inheritance diagram for ON_ObsoleteUserData:
 Public Member Functions
ON_ObsoleteUserData ()
ON_ObsoleteUserData (const ON_ObsoleteUserData &)
virtual  | ~ON_ObsoleteUserData ()
ON_ObsoleteUserData &  | operator= (const ON_ObsoleteUserData &)
 Public Member Functions inherited from ON_UserData
ON_UserData ()
ON_UserData (const ON_UserData &)
~ON_UserData ()
virtual bool  | Archive () const
virtual bool  | DeleteAfterRead (const class ON_BinaryArchive &archive, class ON_Object *parent_object) const
virtual bool  | DeleteAfterWrite (const class ON_BinaryArchive &archive, const class ON_Object *parent_object) const
void  | Dump (ON_TextLog &text_log) const override
virtual bool  | GetDescription (ON_wString &description)
bool  | IsUnknownUserData () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_UserData *  | Next () const
ON_UserData &  | operator= (const ON_UserData &)
ON_Object *  | Owner () const
Returns object that owns the user data. More...
unsigned int  | SizeOf () const override
virtual bool  | Transform (const ON_Xform &)
ON_UUID  | UserDataClassUuid () const
virtual bool  | WriteToArchive (const class ON_BinaryArchive &archive, const class ON_Object *parent_object) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
void  | CopyUserData (const ON_Object &source_object)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
void  | MoveUserData (ON_Object &source_object)
virtual ON::object_type  | ObjectType () const
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Public Attributes
ON_UUID  | m_archive_class_uuid
This is the user data class id that will be saved in the 3dm archive. More...
 Public Attributes inherited from ON_UserData
ON_UUID  | m_application_uuid
unsigned int  | m_userdata_copycount
ON_UUID  | m_userdata_uuid
ON_Xform  | m_userdata_xform
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
Constructor & Destructor Documentation
◆ ON_ObsoleteUserData() [1/2]
 ON_ObsoleteUserData::ON_ObsoleteUserData  |  ( |   | )
used to write obsolete user data when earlier versions of 3dm archives are written and the class id for the earlier version of the user data is still in use in the current version of opennurbs.
◆ ~ON_ObsoleteUserData()
 virtual ON_ObsoleteUserData::~ON_ObsoleteUserData  |  ( |   | )
virtual
◆ ON_ObsoleteUserData() [2/2]
 ON_ObsoleteUserData::ON_ObsoleteUserData  |  ( |  const ON_ObsoleteUserData &  |   | )
Member Function Documentation
◆ operator=()
 ON_ObsoleteUserData& ON_ObsoleteUserData::operator=  |  ( |  const ON_ObsoleteUserData &  |   | )
Member Data Documentation
◆ m_archive_class_uuid
 ON_UUID ON_ObsoleteUserData::m_archive_class_uuid
This is the user data class id that will be saved in the 3dm archive.