Public Member Functions | Public Attributes | List of all members
ON_ClippingPlaneSurface Class Reference
#include <opennurbs_planesurface.h>
 Inheritance diagram for ON_ClippingPlaneSurface:
 Public Member Functions
ON_ClippingPlaneSurface ()
ON_ClippingPlaneSurface (const ON_Plane &src)
ON_ClippingPlaneSurface (const ON_PlaneSurface &src)
~ON_ClippingPlaneSurface ()
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
void  | Default ()
void  | Dump (ON_TextLog &) const override
virtual ON_Object::Dump override More...
ON::object_type  | ObjectType () const override
override ON_Object::ObjectType() - returns ON::clipplane_object More...
ON_ClippingPlaneSurface &  | operator= (const ON_Plane &src)
ON_ClippingPlaneSurface &  | operator= (const ON_PlaneSurface &src)
bool  | Read (ON_BinaryArchive &) override
virtual ON_Object::Read override More...
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
bool  | Write (ON_BinaryArchive &) const override
virtual ON_Object::Write override More...
 Public Member Functions inherited from ON_PlaneSurface
ON_PlaneSurface ()
ON_PlaneSurface (const ON_PlaneSurface &)
ON_PlaneSurface (const ON_Plane &)
virtual  | ~ON_PlaneSurface ()
bool  | CreatePseudoInfinitePlane (ON_PlaneEquation plane_equation, const ON_BoundingBox &bbox, double padding=0.0625)
bool  | CreatePseudoInfinitePlane (const ON_Plane &plane, const ON_BoundingBox &bbox, double padding=0.0625)
bool  | CreatePseudoInfinitePlane (const ON_Plane &plane, int point_count, const ON_3dPoint *point_list, double padding=0.0625)
int  | Degree (int) const override
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain (int) const override
bool  | Evaluate (double, double, int, int, double *, int=0, int *=0) const override
work horse evaluator More...
bool  | Extend (int dir, const ON_Interval &domain) override
ON_Interval  | Extents (int dir) const
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetNextDiscontinuity (int dir, ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
int  | GetNurbForm (ON_NurbsSurface &, double=0.0) const override
bool  | GetParameterTolerance (int, double, double *, double *) const override
bool  | GetSpanVector (int, double *) const override
bool  | GetSurfaceSize (double *width, double *height) const override
int  | HasNurbForm () const override
bool  | IsClosed (int) const override
bool  | IsContinuous (ON::continuity c, double s, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
ON_Curve *  | IsoCurve (int dir, double c) const override
bool  | IsPeriodic (int) const override
bool  | IsPlanar (ON_Plane *plane=nullptr, double tolerance=ON_ZERO_TOLERANCE) const override
bool  | IsSingular (int) const override
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_PlaneSurface &  | operator= (const ON_PlaneSurface &)
ON_PlaneSurface &  | operator= (const ON_Plane &)
bool  | Reverse (int) override
bool  | SetDomain (int dir, double t0, double t1) override
ON_Surface overrides. More...
bool  | SetExtents (int dir, ON_Interval extents, bool bSynchDomain=false)
int  | SpanCount (int) const override
number of smooth spans in curve More...
bool  | Split (int dir, double c, ON_Surface *&west_or_south_side, ON_Surface *&east_or_north_side) const override
bool  | Transform (const ON_Xform &) override
bool  | Transpose () override
transpose surface parameterization (swap "s" and "t") More...
bool  | Trim (int dir, const ON_Interval &domain) override
 Public Member Functions inherited from ON_Surface
ON_Surface ()
ON_Surface (const ON_Surface &)
virtual  | ~ON_Surface ()
ON_Brep *  | BrepForm (ON_Brep *brep=nullptr) const override
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
void  | DestroySurfaceTree ()
virtual ON_Surface *  | DuplicateSurface () const
bool  | Ev1Der (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, int quadrant=0, int *hint=0) const
bool  | Ev2Der (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, ON_3dVector &duu, ON_3dVector &duv, ON_3dVector &dvv, int quadrant=0, int *hint=0) const
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvNormal (double u, double v, ON_3dPoint &point, ON_3dVector &normal, int quadrant=0, int *hint=0) const
bool  | EvNormal (double u, double v, ON_3dVector &normal, int quadrant=0, int *hint=0) const
bool  | EvNormal (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, ON_3dVector &normal, int=0, int *=0) const
bool  | EvPoint (double u, double v, ON_3dPoint &point, int quadrant=0, int *hint=0) const
bool  | FrameAt (double u, double v, ON_Plane &frame) const
bool  | GetDomain (int dir, double *t0, double *t1) const
surface interface More...
virtual bool  | GetNurbFormParameterFromSurfaceParameter (double surface_s, double surface_t, double *nurbs_s, double *nurbs_t) const
virtual bool  | GetSpanVectorIndex (int dir, double t, int side, int *span_vector_index, ON_Interval *span_interval) const
virtual bool  | GetSurfaceParameterFromNurbFormParameter (double nurbs_s, double nurbs_t, double *surface_s, double *surface_t) const
bool  | HasBrepForm () const override
int  | IsAtSeam (double s, double t) const
bool  | IsAtSingularity (double s, double t, bool bExact=true) const
bool  | IsCone (ON_Cone *cone=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | IsCylinder (ON_Cylinder *cylinder=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
virtual ISO  | IsIsoparametric (const ON_Curve &curve, const ON_Interval *curve_domain=nullptr) const
virtual ISO  | IsIsoparametric (const ON_BoundingBox &bbox) const
bool  | IsSolid () const
bool  | IsSphere (ON_Sphere *sphere=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | IsTorus (ON_Torus *torus=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
ON_3dVector  | NormalAt (double, double) const
ON_NurbsSurface *  | NurbsSurface (ON_NurbsSurface *pNurbsSurface=nullptr, double tolerance=0.0, const ON_Interval *s_subdomain=nullptr, const ON_Interval *t_subdomain=nullptr) const
ON::object_type  | ObjectType () const override
override ON_Object::ObjectType() - returns ON::surface_object More...
ON_Surface &  | operator= (const ON_Surface &)
ON_3dPoint  | PointAt (double, double) const
simple evaluation interface - no error handling More...
bool  | SetDomain (int dir, ON_Interval domain)
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
virtual bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const
virtual bool  | IsDeformable () const
virtual bool  | MakeDeformable ()
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
virtual bool  | SwapCoordinates (int i, int j)
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
void  | CopyUserData (const ON_Object &source_object)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
void  | MoveUserData (ON_Object &source_object)
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Public Attributes
ON_ClippingPlane  | m_clipping_plane
 Public Attributes inherited from ON_PlaneSurface
ON_Plane  | m_plane
 Additional Inherited Members
 Public Types inherited from ON_Surface
enum  | ISO {
 not_iso = 0, x_iso = 1, y_iso = 2, W_iso = 3,
 S_iso = 4, E_iso = 5, N_iso = 6, iso_count = 7
 }
pure virtual class for surface objects More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
 Protected Attributes inherited from ON_PlaneSurface
ON_Interval  | m_domain [2]
evaluation domain (always increasing) More...
ON_Interval  | m_extents [2]
rectangle extents (in m_plane x,y coordinates) More...
Constructor & Destructor Documentation
◆ ON_ClippingPlaneSurface() [1/3]
 ON_ClippingPlaneSurface::ON_ClippingPlaneSurface  |  ( |   | )
◆ ON_ClippingPlaneSurface() [2/3]
 ON_ClippingPlaneSurface::ON_ClippingPlaneSurface  |  ( |  const ON_Plane &  |  src | )
◆ ON_ClippingPlaneSurface() [3/3]
 ON_ClippingPlaneSurface::ON_ClippingPlaneSurface  |  ( |  const ON_PlaneSurface &  |  src | )
◆ ~ON_ClippingPlaneSurface()
 ON_ClippingPlaneSurface::~ON_ClippingPlaneSurface  |  ( |   | )
Member Function Documentation
◆ DataCRC()
 ON__UINT32 ON_ClippingPlaneSurface::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
virtual ON_Object::DataCRC override
Reimplemented from ON_PlaneSurface.
◆ Default()
 void ON_ClippingPlaneSurface::Default  |  ( |   | )
◆ Dump()
 void ON_ClippingPlaneSurface::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
virtual ON_Object::Dump override
for debugging
Reimplemented from ON_PlaneSurface.
◆ ObjectType()
 ON::object_type ON_ClippingPlaneSurface::ObjectType  |  ( |   | ) |   const
overridevirtual
override ON_Object::ObjectType() - returns ON::clipplane_object
Reimplemented from ON_Object.
◆ operator=() [1/2]
 ON_ClippingPlaneSurface& ON_ClippingPlaneSurface::operator=  |  ( |  const ON_Plane &  |  src | )
◆ operator=() [2/2]
 ON_ClippingPlaneSurface& ON_ClippingPlaneSurface::operator=  |  ( |  const ON_PlaneSurface &  |  src | )
◆ Read()
 bool ON_ClippingPlaneSurface::Read  |  ( |  ON_BinaryArchive &  |   | )
overridevirtual
virtual ON_Object::Read override
Reimplemented from ON_PlaneSurface.
◆ SizeOf()
 unsigned int ON_ClippingPlaneSurface::SizeOf  |  ( |   | ) |   const
overridevirtual
virtual ON_Object::SizeOf override
Reimplemented from ON_PlaneSurface.
◆ Write()
 bool ON_ClippingPlaneSurface::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
overridevirtual
virtual ON_Object::Write override
Reimplemented from ON_PlaneSurface.
Member Data Documentation
◆ m_clipping_plane
 ON_ClippingPlane ON_ClippingPlaneSurface::m_clipping_plane