Public Member Functions | List of all members
ON_PolyEdgeCurve Class Reference
#include <opennurbs_polyedgecurve.h>
 Inheritance diagram for ON_PolyEdgeCurve:
 Public Member Functions
ON_PolyEdgeCurve ()
~ON_PolyEdgeCurve ()
bool  | Append (ON_PolyEdgeSegment *new_segment)
bool  | AppendAndMatch (ON_Curve *)
const ON_Brep *  | BrepAt (double t) const
bool  | ChangeClosedCurveSeam (double t) override
If this curve is closed, then modify it so that the start/end point is at curve parameter t. More...
bool  | ContainsAllEdges () const
Test if all segments of the polyedge are surface edges. More...
bool  | ContainsAnyEdges () const
Test if there are any surface edges in the polyedge. More...
bool  | Create (const ON_BrepTrim *trim, const ON_UUID &object_id)
Create a one segment ON_PolyEdgeCurve curve that uses a single edge. More...
bool  | Create (const ON_Curve *curve, const ON_UUID &object_id)
Create a one segment ON_PolyEdgeCurve curve that uses a single curve. More...
void  | DestroyRuntimeCache (bool bDelete=true) override
default copy constructor and operator= are fine. More...
ON_Curve *  | DuplicateCurve () const override
virtual ON_Curve::DuplicateCurve override More...
const ON_BrepEdge *  | EdgeAt (double t) const
double  | EdgeParameter (double t) const
const ON_BrepFace *  | FaceAt (double t) const
int  | FindCurve (const ON_Curve *curve) const
See if this polyedge has a wire curve as one of its segments More...
int  | FindEdge (const ON_BrepEdge *edge) const
See if this polyedge has an edge as one of its segments More...
int  | FindTrim (const ON_BrepTrim *trim) const
See if this polyedge has a trim as one of its segments More...
bool  | Insert (int segment_index, ON_PolyEdgeSegment *new_segment)
bool  | IsClosed () const override
virtual ON_Curve::IsClosed override More...
ON_Surface::ISO  | IsoType (double t) const
ON_PolyEdgeSegment *  | operator[] (int) const
bool  | Prepend (ON_PolyEdgeSegment *new_segment)
bool  | PrependAndMatch (ON_Curve *)
bool  | Remove ()
bool  | Remove (int index)
int  | SegmentCount () const
ON_PolyEdgeSegment *  | SegmentCurve (int segment_index) const
bool  | SetEndPoint (ON_3dPoint end_point) override
Force the curve to end at a specified point. More...
bool  | SetStartPoint (ON_3dPoint start_point) override
Force the curve to start at a specified point. More...
const ON_Surface *  | SurfaceAt (double t) const
const ON_BrepTrim *  | TrimAt (double t) const
 Public Member Functions inherited from ON_PolyCurve
ON_PolyCurve () ON_NOEXCEPT
ON_PolyCurve (const ON_PolyCurve &)
ON_PolyCurve (int)
virtual  | ~ON_PolyCurve ()
bool  | Append (ON_Curve *)
bool  | AppendAndMatch (ON_Curve *)
bool  | ChangeDimension (int desired_dimension) override
Change the dimension of a curve. More...
bool  | CloseGap (int gap_index, int segments_to_modify)
Modify the one or both locations at the end of segment[gap_index-1] and the start of segment[gap_index] so they are coindicent. More...
int  | CloseGaps ()
Searches for and closes all gaps that can be found. More...
int  | Count () const
Interface. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree () const override
Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. More...
void  | Destroy ()
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain () const override
void  | Dump (ON_TextLog &) const override
Creates a text dump of the object. More...
void  | EmergencyDestroy ()
bool  | Evaluate (double, int, int, double *, int=0, int *=0) const override
This evaluator actually does all the work. The other ON_Curve evaluation tools call this virtual function. More...
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | Extend (const ON_Interval &domain) override
Where possible, analytically extends curve to include domain. More...
int  | FindNextGap (int segment_index0) const
Search the curve for gaps between the sub curve segments. More...
ON_Curve *  | FirstSegmentCurve () const
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetCurveParameterFromNurbFormParameter (double, double *) const override
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override More...
bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
Search for a derivatitive, tangent, or curvature discontinuity. More...
int  | GetNurbForm (ON_NurbsCurve &, double=0.0, const ON_Interval *=nullptr) const override
Get a NURBS curve representation of this curve. More...
bool  | GetNurbFormParameterFromCurveParameter (double, double *) const override
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override More...
bool  | GetSpanVector (double *) const override
Get number of parameters of "knots". More...
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override More...
ON_Curve *  | HarvestSegment (int)
bool  | HasGapAt (int segment_index) const
Determine if there is a gap between the end of segment[segment_index] and the start of segment[segment_index+1]. More...
int  | HasNurbForm () const override
Does a NURBS curve representation of this curve. More...
bool  | HasSynchronizedSegmentDomains () const
bool  | Insert (int, ON_Curve *)
bool  | IsArc (const ON_Plane *=nullptr, ON_Arc *=nullptr, double=ON_ZERO_TOLERANCE) const override
Test a curve to see if the locus if its points is an arc or circle. More...
bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
Test continuity at a curve parameter value. More...
bool  | IsDeformable () const override
virtual ON_Geometry::IsDeformable() override More...
bool  | IsInPlane (const ON_Plane &, double=ON_ZERO_TOLERANCE) const override
Test a curve to see if it lies in a specific plane. More...
bool  | IsLinear (double=ON_ZERO_TOLERANCE) const override
Test a curve to see if the locus if its points is a line segment. More...
bool  | IsNested () const
bool  | IsPeriodic (void) const override
Test a curve to see if it is periodic. More...
bool  | IsPlanar (ON_Plane *=nullptr, double=ON_ZERO_TOLERANCE) const override
Test a curve to see if it is planar. More...
int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const override
Several types of ON_Curve can have the form of a polyline including a degree 1 ON_NurbsCurve, an ON_PolylineCurve, and an ON_PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline. More...
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
Tests an object to see if its data members are correctly initialized. More...
bool  | IsValid (bool bAllowGaps, ON_TextLog *text_log) const
Tests an object to see if its data members are correctly initialized. More...
ON_Curve *  | LastSegmentCurve () const
bool  | MakeDeformable () override
virtual ON_Geometry::MakeDeformable() override More...
ON_DEPRECATED_MSG ("Replace calls to HasGap() with FindNextGap(0)") int HasGap() const
ON_DEPRECATED_MSG ("Use RemoveNesting(). RemoveNestingEx() will be removed in the next release.") bool RemoveNestingEx()
ON_PolyCurve &  | operator= (const ON_PolyCurve &)
ON_Curve *  | operator[] (int) const
These operator[] functions return nullptr if index is out of range. More...
bool  | ParameterSearch (double t, int &index, bool bEnableSnap) const
Lookup a parameter in the m_t array, optionally using a built in snap tolerance to snap a parameter value to an element of m_t. More...
double  | PolyCurveParameter (int segment_index, double segmentcurve_parameter) const
Converts a segment curve parameter to a polycurve parameter. More...
bool  | Prepend (ON_Curve *)
bool  | PrependAndMatch (ON_Curve *)
bool  | Read (ON_BinaryArchive &) override
Low level archive writing tool used by ON_BinaryArchive::ReadObject(). More...
bool  | Remove ()
bool  | Remove (int)
bool  | RemoveNesting ()
Removes the nested of polycurves. The result will have not have an ON_PolyCurve as a segment but will have identical locus and parameterization. More...
void  | Reserve (int)
bool  | Reverse () override
Reverse the direction of the curve. More...
ON_Curve *  | SegmentCurve (int segment_index) const
Returns a pointer to a segment curve. More...
double  | SegmentCurveParameter (double polycurve_parameter) const
Converts a polycurve parameter to a segment curve parameter. More...
const ON_CurveArray &  | SegmentCurves () const
ON_Interval  | SegmentDomain (int segment_index) const
Returns the polycurve subdomain assigned to a segment curve. More...
int  | SegmentIndex (double polycurve_parameter) const
Find the segment used for evaluation at polycurve_parameter. More...
int  | SegmentIndex (ON_Interval sub_domain, int *segment_index0, int *segment_index1) const
Find the segments with support on sub_domain. More...
const ON_SimpleArray< double > &  | SegmentParameters () const
bool  | SetDomain (double t0, double t1) override
virtual ON_Curve::SetDomain override. Set the domain of the curve More...
bool  | SetParameterization (const double *t)
Expert user function to set the m_t[] array. More...
void  | SetSegment (int index, ON_Curve *crv)
unsigned int  | SizeOf () const override
ON_Object overrides. More...
int  | SpanCount () const override
Get number of nonempty smooth (c-infinity) spans in curve More...
bool  | Split (double t, ON_Curve *&left_side, ON_Curve *&right_side) const override
virtual ON_Curve::Split override. Divide the curve at the specified parameter. The parameter must be in the interior of the curve's domain. The pointers passed to Split must either be nullptr or point to an ON_Curve object of the same of the same type. If the pointer is nullptr, then a curve will be created in Split(). You may pass "this" as one of the pointers to Split(). More...
bool  | SwapCoordinates (int, int) override
Swaps object coordinate values with indices i and j. More...
bool  | SynchronizeSegmentDomains ()
Sets the domain of the curve int the m_segment[] array to exactly match the domain defined in the m_t[] array. This is not required, but can simplify some coding situations. More...
bool  | Transform (const ON_Xform &) override
overrides virtual ON_Geometry::Transform(). ON_Curve::Transform() calls ON_Geometry::Transform(xform), which calls ON_Object::TransformUserData(xform), and then calls this->DestroyCurveTree(). More...
bool  | Trim (const ON_Interval &domain) override
virtual ON_Curve::Trim override. Removes portions of the curve outside the specified interval. More...
bool  | Write (ON_BinaryArchive &) const override
Low level archive writing tool used by ON_BinaryArchive::WriteObject(). More...
 Public Member Functions inherited from ON_Curve
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
ON_3dVector  | CurvatureAt (double t) const
Evaluate the curvature vector at a parameter. More...
ON_3dVector  | DerivativeAt (double t) const
Evaluate first derivative at a parameter. More...
void  | DestroyCurveTree ()
Destroys the runtime curve tree used to speed closest point and intersection calcuations. More...
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
Evaluate first derivative at a parameter with error checking. More...
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
Evaluate second derivative at a parameter with error checking. More...
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
Evaluate unit tangent and curvature at a parameter with error checking. More...
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
Evaluate point at a parameter with error checking. More...
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
Evaluate unit tangent at a parameter with error checking. More...
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
Return a 3d frame at a parameter. More...
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetParameterTolerance (double t, double *tminus, double *tplus) const
Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. More...
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
Decide if it makes sense to close off this curve by moving the endpoint to the start based on start-end gap size and length of curve as approximated by chord defined by 6 points. More...
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
Get a NURBS curve representation of this curve. More...
ON::object_type  | ObjectType () const override
overrides virtual ON_Object::ObjectType. More...
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
Evaluate point at a parameter. More...
ON_3dPoint  | PointAtEnd () const
Evaluate point at the end of the curve. More...
ON_3dPoint  | PointAtStart () const
Evaluate point at the start of the curve. More...
bool  | SetDomain (ON_Interval domain)
Set the domain of the curve. More...
ON_3dVector  | TangentAt (double t) const
Evaluate unit tangent vector at a parameter. More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
Get object's 3d axis aligned bounding box. More...
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
If possible, BrepForm() creates a brep form of the ON_Geometry. More...
virtual void  | ClearBoundingBox ()
Some objects cache bounding box information. If you modify an object, then call ClearBoundingBox() to inform the object that any cached bounding boxes are invalid. More...
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
If this piece of geometry is a component in something larger, like an ON_BrepEdge in an ON_Brep, then this function returns the component index. More...
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
Get object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
Get corners of object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
virtual bool  | HasBrepForm () const
Query an object to see if it has an ON_Brep form. Result: Returns true if the virtual ON_Geometry::BrepForm can compute an ON_Brep representation of this object. More...
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Scale (double scale_factor)
Scales the object by the specified facotor. The scale is centered at the origin. More...
bool  | Translate (const ON_3dVector &translation_vector)
Translates the object along the specified vector. More...
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
bool  | AttachUserData (class ON_UserData *pUserData)
Attach user data to an object. More...
unsigned int  | ClearAllComponentStates () const
Set all active level component states to ON_ComponentStatus::NoneSet. More...
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
Clear the specified states on every component. More...
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
Clear states on an individual component. More...
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
Expert user tool that copies user data items with positive values of ON_UserData.m_userdata_copycount from source_object to "this. More...
void  | CopyUserData (const ON_Object &source_object)
Calls CopyUserData(source_object,ON_Object::UserDataConflictResolution::source_object). More...
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
Delete the portions of the object identified in ci_list[]. More...
bool  | DetachUserData (class ON_UserData *pUserData)
Remove user data from an object. More...
void  | EmergencyDestroy ()
Sets m_user_data_list = 0. More...
class ON_UserData *  | FirstUserData () const
User data is stored as a linked list of ON_UserData classes. FirstUserData gets the first item in the linked list. This is the most recent item attached using AttachUserData(). Remark: To iterate through all the user data on an object, call FirstUserData() and then use ON_UserData::Next() to traverse the list. More...
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
Get a pointer to user data. More...
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
Get user string from the object. More...
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
Get a list of all user string keys on the object. More...
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
Get a list of all user strings on the object. More...
bool  | IsKindOf (const ON_ClassId *pClassId) const
Low level tool to test if an object is derived from a specified class. More...
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
virtual void  | MemoryRelocate ()
The MemoryRelocate() function is called when an object's location in memory is changed. For example, if an object resides in a chunk of memory that is grown by calling a realloc that has to allocate a new chunk and copy the contents of the old chunk to the new chunk, then the location of the object's memory changes. In practice this happens when classes derived from ON_Object are stored in dynamic arrays, like the default implementation of ON_ObjectArray<>'s that use realloc to grow the dynamic array. More...
virtual ON_UUID  | ModelObjectId () const
All objects in an opennurbs model have an id ( ON_Layer.m_layer_id, ON_Font.m_font_id, ON_Material.m_material_id, ON_3dmObjectAttributes.m_uuid ). More...
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
Expert user tool that moves user data items from source_object to "this. More...
void  | MoveUserData (ON_Object &source_object)
Calls MoveUserData(source_object,ON_Object::UserDataConflictResolution::source_object,true). More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
PurgeUserData() removes all user data from object. More...
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
Set states on an individual component. More...
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
Copy status settings to an individual component. More...
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
Attach a user string to the object. This information will perisist through copy construction, operator=, and file IO. More...
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
Append entries to the user string list More...
void  | TransformUserData (const class ON_Xform &xform)
Objects derived from ON_Geometry must call TransformUserData() in their Transform() member function. More...
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. More...
int  | UserStringCount () const
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
When a userdata item is copied or moved from a source object to a destination object, the ON_Object::UserDataConflictResolution enum values specify how conficts are resolved. Remark: A userdata item "conflict" occurs when both the destination and source object have a user data item with the same value of ON_UserData::m_userdata_uuid. More...
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
 Protected Member Functions inherited from ON_Curve
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
Lookup a parameter in the m_t array, optionally using a built in snap tolerance to snap a parameter value to an element of m_t. This function is used by some types derived from ON_Curve to snap parameter values More...
Constructor & Destructor Documentation
◆ ON_PolyEdgeCurve()
 ON_PolyEdgeCurve::ON_PolyEdgeCurve  |  ( |   | )
◆ ~ON_PolyEdgeCurve()
 ON_PolyEdgeCurve::~ON_PolyEdgeCurve  |  ( |   | )
Member Function Documentation
◆ Append()
 bool ON_PolyEdgeCurve::Append  |  ( |  ON_PolyEdgeSegment *  |  new_segment | )
◆ AppendAndMatch()
 bool ON_PolyEdgeCurve::AppendAndMatch  |  ( |  ON_Curve *  |   | )
◆ BrepAt()
 const ON_Brep* ON_PolyEdgeCurve::BrepAt  |  ( |  double  |  t | ) |   const
◆ ChangeClosedCurveSeam()
 bool ON_PolyEdgeCurve::ChangeClosedCurveSeam  |  ( |  double  |  t | )
overridevirtual
If this curve is closed, then modify it so that the start/end point is at curve parameter t.
Parameters
t | [in] curve parameter of new start/end point. The returned curves domain will start at t.
Returns
true if successful.
Overrides virtual ON_Curve::ChangeClosedCurveSeam
Reimplemented from ON_PolyCurve.
◆ ContainsAllEdges()
 bool ON_PolyEdgeCurve::ContainsAllEdges  |  ( |   | ) |   const
Test if all segments of the polyedge are surface edges.
◆ ContainsAnyEdges()
 bool ON_PolyEdgeCurve::ContainsAnyEdges  |  ( |   | ) |   const
Test if there are any surface edges in the polyedge.
◆ Create() [1/2]
 bool ON_PolyEdgeCurve::Create  |  ( |  const ON_BrepTrim *  |  trim,
|  const ON_UUID &  |  object_id
)
Create a one segment ON_PolyEdgeCurve curve that uses a single edge.
◆ Create() [2/2]
 bool ON_PolyEdgeCurve::Create  |  ( |  const ON_Curve *  |  curve,
|  const ON_UUID &  |  object_id
)
Create a one segment ON_PolyEdgeCurve curve that uses a single curve.
◆ DestroyRuntimeCache()
 void ON_PolyEdgeCurve::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
default copy constructor and operator= are fine.
virtual ON_Object::DestroyRuntimeCache override
Reimplemented from ON_PolyCurve.
◆ DuplicateCurve()
 ON_Curve* ON_PolyEdgeCurve::DuplicateCurve  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::DuplicateCurve override
Reimplemented from ON_PolyCurve.
◆ EdgeAt()
 const ON_BrepEdge* ON_PolyEdgeCurve::EdgeAt  |  ( |  double  |  t | ) |   const
◆ EdgeParameter()
 double ON_PolyEdgeCurve::EdgeParameter  |  ( |  double  |  t | ) |   const
◆ FaceAt()
 const ON_BrepFace* ON_PolyEdgeCurve::FaceAt  |  ( |  double  |  t | ) |   const
◆ FindCurve()
 int ON_PolyEdgeCurve::FindCurve  |  ( |  const ON_Curve *  |  curve | ) |   const
See if this polyedge has a wire curve as one of its segments
Parameters
curve | [in] the curve to look for
Returns
-1: trim is not in the polyedge >=0: index of first segment that uses the curve
◆ FindEdge()
 int ON_PolyEdgeCurve::FindEdge  |  ( |  const ON_BrepEdge *  |  edge | ) |   const
See if this polyedge has an edge as one of its segments
Parameters
edge | [in] the edge to look for
Returns
-1: edge is not in the polyedge >=0: index of first segment that uses the edge
◆ FindTrim()
 int ON_PolyEdgeCurve::FindTrim  |  ( |  const ON_BrepTrim *  |  trim | ) |   const
See if this polyedge has a trim as one of its segments
Parameters
trim | [in] the trim to look for
Returns
-1: trim is not in the polyedge >=0: index of first segment that uses the trim
◆ Insert()
 bool ON_PolyEdgeCurve::Insert  |  ( |  int  |  segment_index,
|  ON_PolyEdgeSegment *  |  new_segment
)
◆ IsClosed()
 bool ON_PolyEdgeCurve::IsClosed  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::IsClosed override
Reimplemented from ON_PolyCurve.
◆ IsoType()
 ON_Surface::ISO ON_PolyEdgeCurve::IsoType  |  ( |  double  |  t | ) |   const
◆ operator[]()
 ON_PolyEdgeSegment* ON_PolyEdgeCurve::operator[]  |  ( |  int  |   | ) |   const
◆ Prepend()
 bool ON_PolyEdgeCurve::Prepend  |  ( |  ON_PolyEdgeSegment *  |  new_segment | )
◆ PrependAndMatch()
 bool ON_PolyEdgeCurve::PrependAndMatch  |  ( |  ON_Curve *  |   | )
◆ Remove() [1/2]
 bool ON_PolyEdgeCurve::Remove  |  ( |   | )
◆ Remove() [2/2]
 bool ON_PolyEdgeCurve::Remove  |  ( |  int  |  index | )
◆ SegmentCount()
 int ON_PolyEdgeCurve::SegmentCount  |  ( |   | ) |   const
◆ SegmentCurve()
 ON_PolyEdgeSegment* ON_PolyEdgeCurve::SegmentCurve  |  ( |  int  |  segment_index | ) |   const
◆ SetEndPoint()
 bool ON_PolyEdgeCurve::SetEndPoint  |  ( |  ON_3dPoint  |  end_point | )
overridevirtual
Force the curve to end at a specified point.
Parameters
end_point | [in]
Returns
true if successful.
Some end points cannot be moved. Be sure to check return code.
See also
ON_Curve::SetStartPoint, ON_Curve::PointAtStart, ON_Curve::PointAtEnd
virtual
Reimplemented from ON_PolyCurve.
◆ SetStartPoint()
 bool ON_PolyEdgeCurve::SetStartPoint  |  ( |  ON_3dPoint  |  start_point | )
overridevirtual
Force the curve to start at a specified point.
Parameters
start_point | [in]
Returns
true if successful.
Some start points cannot be moved. Be sure to check return code.
See also
ON_Curve::SetEndPoint, ON_Curve::PointAtStart, ON_Curve::PointAtEnd
virtual
Reimplemented from ON_PolyCurve.
◆ SurfaceAt()
 const ON_Surface* ON_PolyEdgeCurve::SurfaceAt  |  ( |  double  |  t | ) |   const
◆ TrimAt()
 const ON_BrepTrim* ON_PolyEdgeCurve::TrimAt  |  ( |  double  |  t | ) |   const