openNURBS SDK Help 6.0
 Public Member Functions | Static Public Attributes | List of all members
ON_AggregateComponentStatus Class Reference
#include <opennurbs_compstat.h>
 Public Member Functions
ON_AggregateComponentStatus ()=default
ON_AggregateComponentStatus (const ON_AggregateComponentStatus &)=default
~ON_AggregateComponentStatus ()=default
bool  | Add (ON_ComponentStatus component_status)
Add the status information in component_status to this aggregate status. More...
bool  | Add (const ON_AggregateComponentStatus &aggregate_status)
Add the status information in aggregate_status to this aggregate status. More...
ON_ComponentStatus  | AggregateStatus () const
bool  | ClearAggregateStatus (ON_ComponentStatus states_to_clear)
Sets all states specified by states_to_clear to clear. Does not change current mark. Does not change compoent count. Returns true if successful. false if information is not current and ClearAggregateStatus() failed. More...
bool  | ClearAllStates ()
Sets all states to clear. Marks status as current. Does not change compoent count Returns true if successful. false if information is not current and ClearAllStates() failed. More...
unsigned int  | ComponentCount () const
unsigned int  | DamagedCount () const
unsigned int  | HiddenCount () const
unsigned int  | HighlightedCount () const
bool  | IsCurrent () const
bool  | IsEmpty () const
unsigned int  | LockedCount () const
void  | MarkAsNotCurrent ()
Mark the information as not current. Erases all information. More...
ON_AggregateComponentStatus &  | operator= (const ON_AggregateComponentStatus &)=default
unsigned int  | SelectedCount () const
unsigned int  | SelectedPersistentCount () const
 Static Public Attributes
static const ON_AggregateComponentStatus  | Empty
static const ON_AggregateComponentStatus  | NotCurrent
Constructor & Destructor Documentation
◆ ON_AggregateComponentStatus() [1/2]
 ON_AggregateComponentStatus::ON_AggregateComponentStatus  |  ( |   | )
default
◆ ~ON_AggregateComponentStatus()
 ON_AggregateComponentStatus::~ON_AggregateComponentStatus  |  ( |   | )
default
◆ ON_AggregateComponentStatus() [2/2]
 ON_AggregateComponentStatus::ON_AggregateComponentStatus  |  ( |  const ON_AggregateComponentStatus &  |   | )
default
Member Function Documentation
◆ Add() [1/2]
 bool ON_AggregateComponentStatus::Add  |  ( |  ON_ComponentStatus  |  component_status | )
Add the status information in component_status to this aggregate status.
Parameters
component_status | [in]
Returns
true if successful. false if information is not current and Add failed.
◆ Add() [2/2]
 bool ON_AggregateComponentStatus::Add  |  ( |  const ON_AggregateComponentStatus &  |  aggregate_status | )
Add the status information in aggregate_status to this aggregate status.
Parameters
aggregate_status | [in]
Returns
true if successful. false if information is not current and Add failed.
◆ AggregateStatus()
 ON_ComponentStatus ON_AggregateComponentStatus::AggregateStatus  |  ( |   | ) |   const
◆ ClearAggregateStatus()
 bool ON_AggregateComponentStatus::ClearAggregateStatus  |  ( |  ON_ComponentStatus  |  states_to_clear | )
Sets all states specified by states_to_clear to clear. Does not change current mark. Does not change compoent count. Returns true if successful. false if information is not current and ClearAggregateStatus() failed.
◆ ClearAllStates()
 bool ON_AggregateComponentStatus::ClearAllStates  |  ( |   | )
Sets all states to clear. Marks status as current. Does not change compoent count Returns true if successful. false if information is not current and ClearAllStates() failed.
◆ ComponentCount()
 unsigned int ON_AggregateComponentStatus::ComponentCount  |  ( |   | ) |   const
◆ DamagedCount()
 unsigned int ON_AggregateComponentStatus::DamagedCount  |  ( |   | ) |   const
◆ HiddenCount()
 unsigned int ON_AggregateComponentStatus::HiddenCount  |  ( |   | ) |   const
◆ HighlightedCount()
 unsigned int ON_AggregateComponentStatus::HighlightedCount  |  ( |   | ) |   const
◆ IsCurrent()
 bool ON_AggregateComponentStatus::IsCurrent  |  ( |   | ) |   const
Returns
true if the information is current (valid, up to date, ...). false if the information is not current.
If the information is not current, all counts are zero and states are clear.
◆ IsEmpty()
 bool ON_AggregateComponentStatus::IsEmpty  |  ( |   | ) |   const
Returns
true if this is empty false if not empty.
◆ LockedCount()
 unsigned int ON_AggregateComponentStatus::LockedCount  |  ( |   | ) |   const
◆ MarkAsNotCurrent()
 void ON_AggregateComponentStatus::MarkAsNotCurrent  |  ( |   | )
Mark the information as not current. Erases all information.
◆ operator=()
 ON_AggregateComponentStatus& ON_AggregateComponentStatus::operator=  |  ( |  const ON_AggregateComponentStatus &  |   | )
default
◆ SelectedCount()
 unsigned int ON_AggregateComponentStatus::SelectedCount  |  ( |   | ) |   const
Returns
Number of compoents that are selected or persistently selected.
◆ SelectedPersistentCount()
 unsigned int ON_AggregateComponentStatus::SelectedPersistentCount  |  ( |   | ) |   const
Returns
Number of compoents that are persistently selected.
Member Data Documentation
◆ Empty
 const ON_AggregateComponentStatus ON_AggregateComponentStatus::Empty
static
◆ NotCurrent
 const ON_AggregateComponentStatus ON_AggregateComponentStatus::NotCurrent
static