Public Member Functions | Public Attributes | List of all members
ON_CurveProxyHistory Class Reference
#include <opennurbs_object_history.h>
 Public Member Functions
ON_CurveProxyHistory ()
~ON_CurveProxyHistory ()
void  | Destroy ()
void  | Dump (ON_TextLog &) const
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
bool  | m_bReversed
ON_ObjRef  | m_curve_ref
ON_Interval  | m_full_real_curve_domain
ON_Interval  | m_proxy_curve_domain
ON_Interval  | m_sub_real_curve_domain
Constructor & Destructor Documentation
◆ ON_CurveProxyHistory()
 ON_CurveProxyHistory::ON_CurveProxyHistory  |  ( |   | )
◆ ~ON_CurveProxyHistory()
 ON_CurveProxyHistory::~ON_CurveProxyHistory  |  ( |   | )
Member Function Documentation
◆ Destroy()
 void ON_CurveProxyHistory::Destroy  |  ( |   | )
◆ Dump()
 void ON_CurveProxyHistory::Dump  |  ( |  ON_TextLog &  |   | ) |   const
◆ Read()
 bool ON_CurveProxyHistory::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_CurveProxyHistory::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_bReversed
 bool ON_CurveProxyHistory::m_bReversed
◆ m_curve_ref
 ON_ObjRef ON_CurveProxyHistory::m_curve_ref
◆ m_full_real_curve_domain
 ON_Interval ON_CurveProxyHistory::m_full_real_curve_domain
◆ m_proxy_curve_domain
 ON_Interval ON_CurveProxyHistory::m_proxy_curve_domain
◆ m_sub_real_curve_domain
 ON_Interval ON_CurveProxyHistory::m_sub_real_curve_domain