Public Member Functions | Public Attributes | Friends | List of all members
ON_BrepFace Class Reference
#include <opennurbs_brep.h>
 Inheritance diagram for ON_BrepFace:
 Public Member Functions
ON_BrepFace ()
ON_BrepFace (int)
~ON_BrepFace ()
ON_Brep *  | Brep () const
bool  | ChangeSurface (int si)
Expert user tool that replaces the 3d surface geometry use by the face. Parameters; si - [in] brep surface index of new surface bTransformTrimCurves - [in] If unsure, then pass true. If the surface's domain has changed and you are certain its parameterization still jibes with the trim curve locations, then pass false. More...
bool  | ChangeSurface (int si, bool bTransformTrimCurves)
void  | ClearBoundingBox () override
virtual ON_Geometry::ClearBoundingBox() override More...
ON_COMPONENT_INDEX  | ComponentIndex () const override
virtual ON_Geometry::ComponentIndex() override More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
void  | DestroyMesh (ON::mesh_type mesh_type, bool bDeleteMesh=true)
Destroy meshes used to render and analyze surface and polysrf objects. More...
void  | DestroyRuntimeCache (bool bDelete=true) override
Expert user function. If you are using openNURBS in its default configuration to read and write 3dm archives, you never need to call this function. Many objects employ lazy creation of (runtime) caches that save information to help speed geometric calculations. This function will destroy all runtime information. More...
void  | Dump (ON_TextLog &) const override
Creates a text dump of the object. More...
class ON_BrepFaceSide *  | FaceSide (int dir) const
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
Tests an object to see if its data members are correctly initialized. More...
ON_BrepLoop *  | Loop (int fli) const
int  | LoopCount () const
const ON_Mesh *  | Mesh (ON::mesh_type mesh_type) const
ON_BrepFace &  | operator= (const ON_BrepFace &)
ON_BrepLoop *  | OuterLoop () const
bool  | Read (ON_BinaryArchive &) override
Low level archive writing tool used by ON_BinaryArchive::ReadObject(). More...
bool  | Reverse (int dir) override
This is an override of the virtual ON_Surface::Reverse function. It toggles the face's m_bRev flag so the abstract orientation of the face does not change. More...
bool  | SetDomain (int dir, double t0, double t1) override
This is an override of the virtual ON_Surface::SetDomain function. More...
bool  | SetDomain (ON_Interval udom, ON_Interval vdom)
bool  | SetMesh (ON::mesh_type, ON_Mesh *mesh)
If true is returne, then ~ON_BrepFace will delete mesh. More...
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
int  | SurfaceIndexOf () const
const ON_Surface *  | SurfaceOf () const
bool  | TransformTrim (const ON_Xform &xform)
"Expert" Interface More...
bool  | Transpose () override
This is an override of the virtual ON_Surface::Transpose function. It toggles the face's m_bRev flag so the abstract orientation of the face does not change. More...
bool  | Write (ON_BinaryArchive &) const override
Low level archive writing tool used by ON_BinaryArchive::WriteObject(). More...
 Public Member Functions inherited from ON_SurfaceProxy
ON_SurfaceProxy ()
ON_SurfaceProxy (const ON_Surface *)
ON_SurfaceProxy (const ON_SurfaceProxy &)
virtual  | ~ON_SurfaceProxy ()
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree (int) const override
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain (int) const override
ON_Surface overrides. More...
void  | Dump (ON_TextLog &) const override
Creates a text dump of the object. More...
ON_Surface *  | DuplicateSurface () const override
Get a duplicate of the surface. More...
bool  | Evaluate (double, double, int, int, double *, int=0, int *=0) const override
work horse evaluator More...
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetNextDiscontinuity (int dir, ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
Search for a derivatitive, tangent, or curvature discontinuity. More...
int  | GetNurbForm (ON_NurbsSurface &, double=0.0) const override
Get a NURBS surface representation of this surface. More...
bool  | GetNurbFormParameterFromSurfaceParameter (double surface_s, double surface_t, double *nurbs_s, double *nurbs_t) const override
bool  | GetParameterTolerance (int, double, double *, double *) const override
bool  | GetSpanVector (int, double *) const override
bool  | GetSurfaceParameterFromNurbFormParameter (double nurbs_s, double nurbs_t, double *surface_s, double *surface_t) const override
bool  | GetSurfaceSize (double *width, double *height) const override
Get an estimate of the size of the rectangle that would be created if the 3d surface where flattened into a rectangle. More...
int  | HasNurbForm () const override
Is there a NURBS surface representation of this surface. More...
bool  | IsClosed (int) const override
bool  | IsContinuous (ON::continuity c, double s, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
Test continuity at a surface parameter value. More...
ON_Surface::ISO  | IsIsoparametric (const ON_Curve &curve, const ON_Interval *curve_domain=nullptr) const override
override virtual ON_Surface::IsIsoparametric More...
ON_Surface::ISO  | IsIsoparametric (const ON_BoundingBox &bbox) const override
override virtual ON_Surface::IsIsoparametric More...
ON_Curve *  | IsoCurve (int dir, double c) const override
Get isoparametric curve. More...
bool  | IsPeriodic (int) const override
bool  | IsPlanar (ON_Plane *plane=nullptr, double tolerance=ON_ZERO_TOLERANCE) const override
Test a surface to see if it is planar. More...
bool  | IsSingular (int) const override
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
Tests an object to see if its data members are correctly initialized. More...
ON_SurfaceProxy &  | operator= (const ON_SurfaceProxy &)
const ON_Surface *  | ProxySurface () const
bool  | ProxySurfaceIsTransposed () const
bool  | Read (ON_BinaryArchive &) override
Low level archive writing tool used by ON_BinaryArchive::ReadObject(). More...
bool  | Reverse (int) override
void  | SetProxySurface (const ON_Surface *proxy_surface)
unsigned int  | SizeOf () const override
ON_Object overrides. More...
int  | SpanCount (int) const override
bool  | Transform (const ON_Xform &) override
Transforms the object. More...
bool  | Transpose () override
bool  | Write (ON_BinaryArchive &) const override
Low level archive writing tool used by ON_BinaryArchive::WriteObject(). More...
 Public Member Functions inherited from ON_Surface
ON_Surface ()
ON_Surface (const ON_Surface &)
virtual  | ~ON_Surface ()
ON_Brep *  | BrepForm (ON_Brep *brep=nullptr) const override
Overrides virtual ON_Geometry::HasBrepForm. Uses ON_Brep::Create( ON_Surface&* ) to create a brep form. The surface is copied for use in the returned brep. More...
void  | DestroySurfaceTree ()
bool  | Ev1Der (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, int quadrant=0, int *hint=0) const
bool  | Ev2Der (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, ON_3dVector &duu, ON_3dVector &duv, ON_3dVector &dvv, int quadrant=0, int *hint=0) const
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvNormal (double u, double v, ON_3dPoint &point, ON_3dVector &normal, int quadrant=0, int *hint=0) const
bool  | EvNormal (double u, double v, ON_3dVector &normal, int quadrant=0, int *hint=0) const
bool  | EvNormal (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, ON_3dVector &normal, int=0, int *=0) const
bool  | EvPoint (double u, double v, ON_3dPoint &point, int quadrant=0, int *hint=0) const
virtual bool  | Extend (int dir, const ON_Interval &domain)
Pure virtual function. Default returns false. Where possible, analytically extends surface to include domain. More...
bool  | FrameAt (double u, double v, ON_Plane &frame) const
bool  | GetDomain (int dir, double *t0, double *t1) const
surface interface More...
virtual bool  | GetSpanVectorIndex (int dir, double t, int side, int *span_vector_index, ON_Interval *span_interval) const
bool  | HasBrepForm () const override
Overrides virtual ON_Geometry::HasBrepForm and returns true. Result: Returns true. More...
int  | IsAtSeam (double s, double t) const
Test if a surface parameter value is at a seam. More...
bool  | IsAtSingularity (double s, double t, bool bExact=true) const
Test if a surface parameter value is at a singularity. More...
bool  | IsCone (ON_Cone *cone=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
Determine if the surface is a portion of a cone. More...
bool  | IsCylinder (ON_Cylinder *cylinder=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
Determine if the surface is a portion of a cylinder. More...
bool  | IsSolid () const
bool  | IsSphere (ON_Sphere *sphere=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
Determine if the surface is a portion of a sphere. More...
bool  | IsTorus (ON_Torus *torus=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
Determine if the surface is a portion of a torus. More...
ON_3dVector  | NormalAt (double, double) const
ON_NurbsSurface *  | NurbsSurface (ON_NurbsSurface *pNurbsSurface=nullptr, double tolerance=0.0, const ON_Interval *s_subdomain=nullptr, const ON_Interval *t_subdomain=nullptr) const
Get a NURBS surface representation of this surface. More...
ON::object_type  | ObjectType () const override
override ON_Object::ObjectType() - returns ON::surface_object More...
ON_Surface &  | operator= (const ON_Surface &)
ON_3dPoint  | PointAt (double, double) const
simple evaluation interface - no error handling More...
bool  | SetDomain (int dir, ON_Interval domain)
virtual bool  | Split (int dir, double c, ON_Surface *&west_or_south_side, ON_Surface *&east_or_north_side) const
Splits (divides) the surface into two parts at the specified parameter. More...
virtual bool  | Trim (int dir, const ON_Interval &domain)
Removes the portions of the surface outside of the specified interval. More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
Get object's 3d axis aligned bounding box. More...
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
Get object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
Get corners of object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
virtual bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const
Get tight bounding box. More...
virtual bool  | IsDeformable () const
virtual bool  | MakeDeformable ()
If possible, converts the object into a form that can be accuratly modified with "squishy" transformations like projections, shears, an non-uniform scaling. More...
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Scale (double scale_factor)
Scales the object by the specified facotor. The scale is centered at the origin. More...
virtual bool  | SwapCoordinates (int i, int j)
Swaps object coordinate values with indices i and j. More...
bool  | Translate (const ON_3dVector &translation_vector)
Translates the object along the specified vector. More...
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
bool  | AttachUserData (class ON_UserData *pUserData)
Attach user data to an object. More...
unsigned int  | ClearAllComponentStates () const
Set all active level component states to ON_ComponentStatus::NoneSet. More...
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
Clear the specified states on every component. More...
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
Clear states on an individual component. More...
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
Expert user tool that copies user data items with positive values of ON_UserData.m_userdata_copycount from source_object to "this. More...
void  | CopyUserData (const ON_Object &source_object)
Calls CopyUserData(source_object,ON_Object::UserDataConflictResolution::source_object). More...
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
Delete the portions of the object identified in ci_list[]. More...
bool  | DetachUserData (class ON_UserData *pUserData)
Remove user data from an object. More...
void  | EmergencyDestroy ()
Sets m_user_data_list = 0. More...
class ON_UserData *  | FirstUserData () const
User data is stored as a linked list of ON_UserData classes. FirstUserData gets the first item in the linked list. This is the most recent item attached using AttachUserData(). Remark: To iterate through all the user data on an object, call FirstUserData() and then use ON_UserData::Next() to traverse the list. More...
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
Get a pointer to user data. More...
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
Get user string from the object. More...
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
Get a list of all user string keys on the object. More...
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
Get a list of all user strings on the object. More...
bool  | IsKindOf (const ON_ClassId *pClassId) const
Low level tool to test if an object is derived from a specified class. More...
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
virtual void  | MemoryRelocate ()
The MemoryRelocate() function is called when an object's location in memory is changed. For example, if an object resides in a chunk of memory that is grown by calling a realloc that has to allocate a new chunk and copy the contents of the old chunk to the new chunk, then the location of the object's memory changes. In practice this happens when classes derived from ON_Object are stored in dynamic arrays, like the default implementation of ON_ObjectArray<>'s that use realloc to grow the dynamic array. More...
virtual ON_UUID  | ModelObjectId () const
All objects in an opennurbs model have an id ( ON_Layer.m_layer_id, ON_Font.m_font_id, ON_Material.m_material_id, ON_3dmObjectAttributes.m_uuid ). More...
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
Expert user tool that moves user data items from source_object to "this. More...
void  | MoveUserData (ON_Object &source_object)
Calls MoveUserData(source_object,ON_Object::UserDataConflictResolution::source_object,true). More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
PurgeUserData() removes all user data from object. More...
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
Set states on an individual component. More...
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
Copy status settings to an individual component. More...
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
Attach a user string to the object. This information will perisist through copy construction, operator=, and file IO. More...
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
Append entries to the user string list More...
void  | TransformUserData (const class ON_Xform &xform)
Objects derived from ON_Geometry must call TransformUserData() in their Transform() member function. More...
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. More...
int  | UserStringCount () const
 Public Attributes
bool  | m_bRev = false
int  | m_face_index = -1
int  | m_face_material_channel = 0
ON_U  | m_face_user
ON_UUID  | m_face_uuid = ON_nil_uuid
Persistent id for this face. Default is ON_nil_uuid. More...
ON_SimpleArray< int >  | m_li
int  | m_si = -1
ON_ComponentStatus  | m_status = ON_ComponentStatus::NoneSet
 Friends
class  | ON_Brep
 Additional Inherited Members
 Public Types inherited from ON_Surface
enum  | ISO {
 not_iso = 0, x_iso = 1, y_iso = 2, W_iso = 3,
 S_iso = 4, E_iso = 5, N_iso = 6, iso_count = 7
 }
pure virtual class for surface objects More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
When a userdata item is copied or moved from a source object to a destination object, the ON_Object::UserDataConflictResolution enum values specify how conficts are resolved. Remark: A userdata item "conflict" occurs when both the destination and source object have a user data item with the same value of ON_UserData::m_userdata_uuid. More...
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
Constructor & Destructor Documentation
◆ ON_BrepFace() [1/2]
 ON_BrepFace::ON_BrepFace  |  ( |   | )
◆ ~ON_BrepFace()
 ON_BrepFace::~ON_BrepFace  |  ( |   | )
◆ ON_BrepFace() [2/2]
 ON_BrepFace::ON_BrepFace  |  ( |  int  |   | )
Member Function Documentation
◆ Brep()
 ON_Brep* ON_BrepFace::Brep  |  ( |   | ) |   const
Returns
Brep that the face belongs to.
◆ ChangeSurface() [1/2]
 bool ON_BrepFace::ChangeSurface  |  ( |  int  |  si | )
Expert user tool that replaces the 3d surface geometry use by the face. Parameters; si - [in] brep surface index of new surface bTransformTrimCurves - [in] If unsure, then pass true. If the surface's domain has changed and you are certain its parameterization still jibes with the trim curve locations, then pass false.
Returns
True if successful.
If the face had a surface and new surface has a different shape, then you probably want to call something like ON_Brep::RebuildEdges() to move the 3d edge curves so they will lie on the new surface. This doesn't delete the old surface; call ON_Brep::CullUnusedSurfaces() or ON_Brep::Compact to remove unused surfaces.
@verbatim
 ON_Surface* pSurface = ...;
 int si = brep.AddSurface(pSurface);
 face.ChangeSurface(si);
@endverbatim
See also
ON_Brep::RebuildEdges, ON_Brep::CullUnusedSurfaces
◆ ChangeSurface() [2/2]
 bool ON_BrepFace::ChangeSurface  |  ( |  int  |  si,
|  bool  |  bTransformTrimCurves
)
◆ ClearBoundingBox()
 void ON_BrepFace::ClearBoundingBox  |  ( |   | )
overridevirtual
virtual ON_Geometry::ClearBoundingBox() override
Reimplemented from ON_Geometry.
◆ ComponentIndex()
 ON_COMPONENT_INDEX ON_BrepFace::ComponentIndex  |  ( |   | ) |   const
overridevirtual
virtual ON_Geometry::ComponentIndex() override
Reimplemented from ON_Geometry.
◆ DataCRC()
 ON__UINT32 ON_BrepFace::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
virtual ON_Object::DataCRC override
Reimplemented from ON_Object.
◆ DestroyMesh()
 void ON_BrepFace::DestroyMesh  |  ( |  ON::mesh_type  |  mesh_type,
|  bool  |  bDeleteMesh = true
)
Destroy meshes used to render and analyze surface and polysrf objects.
Parameters
mesh_type | [in] type of mesh to destroy
bDeleteMesh | [in] if true, cached mesh is deleted. If false, pointer to cached mesh is just set to nullptr.
See also
CRhinoObject::GetMeshes, CRhinoObject::MeshCount, CRhinoObject::IsMeshable
◆ DestroyRuntimeCache()
 void ON_BrepFace::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
Expert user function. If you are using openNURBS in its default configuration to read and write 3dm archives, you never need to call this function. Many objects employ lazy creation of (runtime) caches that save information to help speed geometric calculations. This function will destroy all runtime information.
Parameters
bDelete | [in] if true, any cached information is properly deleted. If false, any cached information is simply discarded. This is useful when the cached information may be in alternate memory pools that are managed in nonstandard ways.
Reimplemented from ON_Object.
◆ Dump()
 void ON_BrepFace::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
Creates a text dump of the object.
Dump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
The default implementations of this virtual function prints the class's name.
Reimplemented from ON_Object.
◆ FaceSide()
 class ON_BrepFaceSide* ON_BrepFace::FaceSide  |  ( |  int  |  dir | ) |   const
TODODOC: dir TODODOC: 1: side with underlying surface normal TODODOC: pointing into the topology region TODODOC: -1: side with underlying surface normal TODODOC: pointing out of the topology region
Returns
Brep region topology face side. If the region topology has not be created by calling ON_Brep::RegionToplogy(), then nullptr is returned.
◆ GetBBox()
 bool ON_BrepFace::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
virtual ON_Geometry GetBBox override
Reimplemented from ON_Geometry.
◆ IsValid()
 bool ON_BrepFace::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Tests an object to see if its data members are correctly initialized.
Parameters
text_log | [in] if the object is not valid and text_log is not nullptr, then a brief englis description of the reason the object is not valid is appened to the log. The information appended to text_log is suitable for
low | level debugging purposes by programmers and is not intended to be useful as a high level user interface tool.
Returns
table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Object.
◆ Loop()
 ON_BrepLoop* ON_BrepFace::Loop  |  ( |  int  |  fli | ) |   const
Parameters
fli | [in] index into the face's m_li[] array.
Returns
The loop brep.m_L[face.m_li[fli]];
◆ LoopCount()
 int ON_BrepFace::LoopCount  |  ( |   | ) |   const
Returns
Number of loops in this face.
◆ Mesh()
 const ON_Mesh* ON_BrepFace::Mesh  |  ( |  ON::mesh_type  |  mesh_type | ) |   const
◆ operator=()
 ON_BrepFace& ON_BrepFace::operator=  |  ( |  const ON_BrepFace &  |   | )
◆ OuterLoop()
 ON_BrepLoop* ON_BrepFace::OuterLoop  |  ( |   | ) |   const
Returns
Outer boundary loop for this face.
◆ Read()
 bool ON_BrepFace::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::ReadObject().
Parameters
binary_archive | archive to read from
Returns
Returns true if the read is successful.
Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ Reverse()
 bool ON_BrepFace::Reverse  |  ( |  int  |  dir | )
overridevirtual
This is an override of the virtual ON_Surface::Reverse function. It toggles the face's m_bRev flag so the abstract orientation of the face does not change.
Parameters
dir | [in] 0 = reverse "s" parameter, 1 = reverse "t" parameter The domain changes from [a,b] to [-a,-b]
Returns
True if successful.
The range of the face's trimming curves and the orientation direction of then loops are changed so that the resulting face is still valid.
Implements ON_Surface.
◆ SetDomain() [1/2]
 bool ON_BrepFace::SetDomain  |  ( |  int  |  dir,
|  double  |  t0,
|  double  |  t1
)
overridevirtual
This is an override of the virtual ON_Surface::SetDomain function.
Parameters
dir | [in] 0 = set "u" domain, 1 = set "v" domain.
t0 | [in]
t1 | [in] t0 < t1 The new domain is the interval (t0,t1)
Returns
True if successful.
Reimplemented from ON_Surface.
◆ SetDomain() [2/2]
 bool ON_BrepFace::SetDomain  |  ( |  ON_Interval  |  udom,
|  ON_Interval  |  vdom
)
◆ SetMesh()
 bool ON_BrepFace::SetMesh  |  ( |  ON::mesh_type  |  ,
|  ON_Mesh *  |  mesh
)
If true is returne, then ~ON_BrepFace will delete mesh.
◆ SizeOf()
 unsigned int ON_BrepFace::SizeOf  |  ( |   | ) |   const
overridevirtual
virtual ON_Object::SizeOf override
Reimplemented from ON_Object.
◆ SurfaceIndexOf()
 int ON_BrepFace::SurfaceIndexOf  |  ( |   | ) |   const
Returns
brep.m_S[] surface index of the 3d surface geometry used by this face or -1.
◆ SurfaceOf()
 const ON_Surface* ON_BrepFace::SurfaceOf  |  ( |   | ) |   const
Returns
Pointer to the surface geometry used by the face.
◆ TransformTrim()
 bool ON_BrepFace::TransformTrim  |  ( |  const ON_Xform &  |  xform | )
"Expert" Interface
Expert user tool that tranforms all the parameter space (2d) trimming curves on this face. Only 2d curve geometry is changed. The caller is responsible for reversing loops, toggle m_bRev, flags, etc.
Parameters
xform | [in] Transformation applied to 2d curve geometry. Returns True if successful. If false is returned, the brep may be invalid.
◆ Transpose()
 bool ON_BrepFace::Transpose  |  ( |   | )
overridevirtual
This is an override of the virtual ON_Surface::Transpose function. It toggles the face's m_bRev flag so the abstract orientation of the face does not change.
Returns
True if successful.
The range of the face's trimming curves and the orientation direction of then loops are changed so that the resulting face is still valid.
Implements ON_Surface.
◆ Write()
 bool ON_BrepFace::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::WriteObject().
Parameters
binary_archive | archive to write to
Returns
Returns true if the write is successful.
Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
Friends And Related Function Documentation
◆ ON_Brep
 friend class ON_Brep
friend
Member Data Documentation
◆ m_bRev
 bool ON_BrepFace::m_bRev = false
◆ m_face_index
 int ON_BrepFace::m_face_index = -1
◆ m_face_material_channel
 int ON_BrepFace::m_face_material_channel = 0
◆ m_face_user
 ON_U ON_BrepFace::m_face_user
mutable
◆ m_face_uuid
 ON_UUID ON_BrepFace::m_face_uuid = ON_nil_uuid
Persistent id for this face. Default is ON_nil_uuid.
◆ m_li
 ON_SimpleArray<int> ON_BrepFace::m_li
◆ m_si
 int ON_BrepFace::m_si = -1
◆ m_status
 ON_ComponentStatus ON_BrepFace::m_status = ON_ComponentStatus::NoneSet
mutable