Public Types | Public Member Functions | Public Attributes | Friends | List of all members
ON_BrepLoop Class Reference
#include <opennurbs_brep.h>
 Inheritance diagram for ON_BrepLoop:
 Public Types
enum  | TYPE {
 unknown = 0, outer = 1, inner = 2, slit = 3,
 crvonsrf = 4, ptonsrf = 5, type_count = 6
 }
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
When a userdata item is copied or moved from a source object to a destination object, the ON_Object::UserDataConflictResolution enum values specify how conficts are resolved. Remark: A userdata item "conflict" occurs when both the destination and source object have a user data item with the same value of ON_UserData::m_userdata_uuid. More...
 Public Member Functions
ON_BrepLoop ()
ON_BrepLoop (int)
ON_Brep *  | Brep () const
ON_COMPONENT_INDEX  | ComponentIndex () const override
virtual ON_Geometry::ComponentIndex() override More...
void  | DestroyRuntimeCache (bool bDelete=true) override
Expert user function. If you are using openNURBS in its default configuration to read and write 3dm archives, you never need to call this function. Many objects employ lazy creation of (runtime) caches that save information to help speed geometric calculations. This function will destroy all runtime information. More...
int  | Dimension () const override
virtual ON_Geometry::Dimension() override. More...
void  | Dump (ON_TextLog &) const override
Creates a text dump of the object. More...
ON_BrepFace *  | Face () const
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
int  | IndexOfTrim (const ON_BrepTrim &) const
Interface. More...
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
Tests an object to see if its data members are correctly initialized. More...
ON_BrepLoop &  | operator= (const ON_BrepLoop &)
bool  | Read (ON_BinaryArchive &) override
Low level archive writing tool used by ON_BinaryArchive::ReadObject(). More...
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
int  | SurfaceIndexOf () const
const ON_Surface *  | SurfaceOf () const
bool  | Transform (const ON_Xform &xform) override
virtual ON_Geometry::Transform() override. More...
bool  | TransformTrim (const ON_Xform &xform)
Expert user tool that tranforms all the parameter space (2d) trimming curves in this loop. Only 2d curve geometry is changed. The caller is responsible for reversing loops, toggle m_bRev, flags, etc. More...
ON_BrepTrim *  | Trim (int lti) const
int  | TrimCount () const
bool  | Write (ON_BinaryArchive &) const override
Low level archive writing tool used by ON_BinaryArchive::WriteObject(). More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
Get object's 3d axis aligned bounding box. More...
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
If possible, BrepForm() creates a brep form of the ON_Geometry. More...
virtual void  | ClearBoundingBox ()
Some objects cache bounding box information. If you modify an object, then call ClearBoundingBox() to inform the object that any cached bounding boxes are invalid. More...
virtual bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const
Evaluate the location of a point from the object reference. More...
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
Get object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
Get corners of object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
virtual bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const
Get tight bounding box. More...
virtual bool  | HasBrepForm () const
Query an object to see if it has an ON_Brep form. Result: Returns true if the virtual ON_Geometry::BrepForm can compute an ON_Brep representation of this object. More...
virtual bool  | IsDeformable () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
Tests an object to see if its data members are correctly initialized. More...
virtual bool  | MakeDeformable ()
If possible, converts the object into a form that can be accuratly modified with "squishy" transformations like projections, shears, an non-uniform scaling. More...
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Scale (double scale_factor)
Scales the object by the specified facotor. The scale is centered at the origin. More...
virtual bool  | SwapCoordinates (int i, int j)
Swaps object coordinate values with indices i and j. More...
bool  | Translate (const ON_3dVector &translation_vector)
Translates the object along the specified vector. More...
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
bool  | AttachUserData (class ON_UserData *pUserData)
Attach user data to an object. More...
unsigned int  | ClearAllComponentStates () const
Set all active level component states to ON_ComponentStatus::NoneSet. More...
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
Clear the specified states on every component. More...
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
Clear states on an individual component. More...
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
Expert user tool that copies user data items with positive values of ON_UserData.m_userdata_copycount from source_object to "this. More...
void  | CopyUserData (const ON_Object &source_object)
Calls CopyUserData(source_object,ON_Object::UserDataConflictResolution::source_object). More...
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
Returns a CRC calculated from the information that defines the object. This CRC can be used as a quick way to see if two objects are not identical. More...
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
Delete the portions of the object identified in ci_list[]. More...
bool  | DetachUserData (class ON_UserData *pUserData)
Remove user data from an object. More...
void  | EmergencyDestroy ()
Sets m_user_data_list = 0. More...
class ON_UserData *  | FirstUserData () const
User data is stored as a linked list of ON_UserData classes. FirstUserData gets the first item in the linked list. This is the most recent item attached using AttachUserData(). Remark: To iterate through all the user data on an object, call FirstUserData() and then use ON_UserData::Next() to traverse the list. More...
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
Get a pointer to user data. More...
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
Get user string from the object. More...
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
Get a list of all user string keys on the object. More...
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
Get a list of all user strings on the object. More...
bool  | IsKindOf (const ON_ClassId *pClassId) const
Low level tool to test if an object is derived from a specified class. More...
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
virtual void  | MemoryRelocate ()
The MemoryRelocate() function is called when an object's location in memory is changed. For example, if an object resides in a chunk of memory that is grown by calling a realloc that has to allocate a new chunk and copy the contents of the old chunk to the new chunk, then the location of the object's memory changes. In practice this happens when classes derived from ON_Object are stored in dynamic arrays, like the default implementation of ON_ObjectArray<>'s that use realloc to grow the dynamic array. More...
virtual ON_UUID  | ModelObjectId () const
All objects in an opennurbs model have an id ( ON_Layer.m_layer_id, ON_Font.m_font_id, ON_Material.m_material_id, ON_3dmObjectAttributes.m_uuid ). More...
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
Expert user tool that moves user data items from source_object to "this. More...
void  | MoveUserData (ON_Object &source_object)
Calls MoveUserData(source_object,ON_Object::UserDataConflictResolution::source_object,true). More...
virtual ON::object_type  | ObjectType () const
Useful for switch statements that need to differentiate between basic object types like points, curves, surfaces, and so on. More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
PurgeUserData() removes all user data from object. More...
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
Set states on an individual component. More...
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
Copy status settings to an individual component. More...
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
Attach a user string to the object. This information will perisist through copy construction, operator=, and file IO. More...
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
Append entries to the user string list More...
void  | TransformUserData (const class ON_Xform &xform)
Objects derived from ON_Geometry must call TransformUserData() in their Transform() member function. More...
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. More...
int  | UserStringCount () const
 Public Attributes
int  | m_fi = -1
int  | m_loop_index = -1
ON_U  | m_loop_user
ON_BoundingBox  | m_pbox
ON_ComponentStatus  | m_status = ON_ComponentStatus::NoneSet
ON_SimpleArray< int >  | m_ti
TYPE  | m_type = ON_BrepLoop::unknown
 Friends
class  | ON_Brep
 Additional Inherited Members
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
Member Enumeration Documentation
◆ TYPE
 enum ON_BrepLoop::TYPE
Enumerator
unknown
outer
inner
slit
crvonsrf
ptonsrf
type_count
Constructor & Destructor Documentation
◆ ON_BrepLoop() [1/2]
 ON_BrepLoop::ON_BrepLoop  |  ( |   | )
◆ ON_BrepLoop() [2/2]
 ON_BrepLoop::ON_BrepLoop  |  ( |  int  |   | )
Member Function Documentation
◆ Brep()
 ON_Brep* ON_BrepLoop::Brep  |  ( |   | ) |   const
Returns
Brep that the loop belongs to.
◆ ComponentIndex()
 ON_COMPONENT_INDEX ON_BrepLoop::ComponentIndex  |  ( |   | ) |   const
overridevirtual
virtual ON_Geometry::ComponentIndex() override
Reimplemented from ON_Geometry.
◆ DestroyRuntimeCache()
 void ON_BrepLoop::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
Expert user function. If you are using openNURBS in its default configuration to read and write 3dm archives, you never need to call this function. Many objects employ lazy creation of (runtime) caches that save information to help speed geometric calculations. This function will destroy all runtime information.
Parameters
bDelete | [in] if true, any cached information is properly deleted. If false, any cached information is simply discarded. This is useful when the cached information may be in alternate memory pools that are managed in nonstandard ways.
Reimplemented from ON_Object.
◆ Dimension()
 int ON_BrepLoop::Dimension  |  ( |   | ) |   const
overridevirtual
virtual ON_Geometry::Dimension() override.
Returns
2
Reimplemented from ON_Geometry.
◆ Dump()
 void ON_BrepLoop::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
Creates a text dump of the object.
Dump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
The default implementations of this virtual function prints the class's name.
Reimplemented from ON_Object.
◆ Face()
 ON_BrepFace* ON_BrepLoop::Face  |  ( |   | ) |   const
Returns
Brep face this loop belongs to.
◆ GetBBox()
 bool ON_BrepLoop::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
virtual ON_Geometry GetBBox override
Reimplemented from ON_Geometry.
◆ IndexOfTrim()
 int ON_BrepLoop::IndexOfTrim  |  ( |  const ON_BrepTrim &  |   | ) |   const
Interface.
◆ IsValid()
 bool ON_BrepLoop::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Tests an object to see if its data members are correctly initialized.
Parameters
text_log | [in] if the object is not valid and text_log is not nullptr, then a brief englis description of the reason the object is not valid is appened to the log. The information appended to text_log is suitable for
low | level debugging purposes by programmers and is not intended to be useful as a high level user interface tool.
Returns
table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Object.
◆ operator=()
 ON_BrepLoop& ON_BrepLoop::operator=  |  ( |  const ON_BrepLoop &  |   | )
◆ Read()
 bool ON_BrepLoop::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::ReadObject().
Parameters
binary_archive | archive to read from
Returns
Returns true if the read is successful.
Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ SizeOf()
 unsigned int ON_BrepLoop::SizeOf  |  ( |   | ) |   const
overridevirtual
virtual ON_Object::SizeOf override
Reimplemented from ON_Object.
◆ SurfaceIndexOf()
 int ON_BrepLoop::SurfaceIndexOf  |  ( |   | ) |   const
Returns
brep.m_S[] surface index of the 3d surface geometry used by this loop or -1.
◆ SurfaceOf()
 const ON_Surface* ON_BrepLoop::SurfaceOf  |  ( |   | ) |   const
Returns
Pointer to the surface geometry used by the loop.
◆ Transform()
 bool ON_BrepLoop::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
virtual ON_Geometry::Transform() override.
Reimplemented from ON_Geometry.
◆ TransformTrim()
 bool ON_BrepLoop::TransformTrim  |  ( |  const ON_Xform &  |  xform | )
Expert user tool that tranforms all the parameter space (2d) trimming curves in this loop. Only 2d curve geometry is changed. The caller is responsible for reversing loops, toggle m_bRev, flags, etc.
Parameters
xform | [in] Transformation applied to 2d curve geometry. Returns True if successful. If false is returned, the brep may be invalid.
◆ Trim()
 ON_BrepTrim* ON_BrepLoop::Trim  |  ( |  int  |  lti | ) |   const
Parameters
lti | [in] index into the loop's m_ti[] array.
Returns
The trim brep.m_T[loop.m_ti[lti]];
◆ TrimCount()
 int ON_BrepLoop::TrimCount  |  ( |   | ) |   const
Returns
Number of trims in this loop.
◆ Write()
 bool ON_BrepLoop::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::WriteObject().
Parameters
binary_archive | archive to write to
Returns
Returns true if the write is successful.
Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
Friends And Related Function Documentation
◆ ON_Brep
 friend class ON_Brep
friend
Member Data Documentation
◆ m_fi
 int ON_BrepLoop::m_fi = -1
◆ m_loop_index
 int ON_BrepLoop::m_loop_index = -1
◆ m_loop_user
 ON_U ON_BrepLoop::m_loop_user
mutable
◆ m_pbox
 ON_BoundingBox ON_BrepLoop::m_pbox
◆ m_status
 ON_ComponentStatus ON_BrepLoop::m_status = ON_ComponentStatus::NoneSet
mutable
◆ m_ti
 ON_SimpleArray<int> ON_BrepLoop::m_ti
◆ m_type
 TYPE ON_BrepLoop::m_type = ON_BrepLoop::unknown