openNURBS SDK Help 6.0
 Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_ModelGeometryComponent Class Reference
Used to store geometry table object definition and attributes in an ONX_Model. More...
#include <opennurbs_model_geometry.h>
 Inheritance diagram for ON_ModelGeometryComponent:
 Public Member Functions
ON_ModelGeometryComponent () ON_NOEXCEPT
ON_ModelGeometryComponent (ON_ModelComponent::Type type) ON_NOEXCEPT
ON_ModelGeometryComponent (const ON_ModelGeometryComponent &)
~ON_ModelGeometryComponent ()
const ON_3dmObjectAttributes *  | Attributes (const ON_3dmObjectAttributes *no_attributes_return_value) const
void  | Dump (ON_TextLog &text_log) const override
Creates a text dump of the object. More...
const class ON_Geometry *  | Geometry (const class ON_Geometry *no_geometry_return_value) const
bool  | IsEmpty () const
bool  | IsInstanceDefinitionGeometry () const
ON_ModelGeometryComponent &  | operator= (const ON_ModelGeometryComponent &)
bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map) override
Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. More...
 Public Member Functions inherited from ON_ModelComponent
ON_ModelComponent () ON_NOEXCEPT
ON_ModelComponent (const ON_ModelComponent &source)
ON_ModelComponent (ON_ModelComponent::Type component_type) ON_NOEXCEPT
Sets and locks the component type attribute. More...
ON_ModelComponent (ON_ModelComponent::Type component_type, const ON_ModelComponent &source) ON_NOEXCEPT
Locked status of source attributes is not copied to permit copy and modify operations. More...
~ON_ModelComponent ()=default
bool  | ChangeName (const wchar_t *new_name, class ON_ComponentManifest *manifest)
Change the name of a component and optionally update a manifest. More...
bool  | ClearComponentType ()
Set the model serial number value to the ON_ModelComponent::Unset.Type() and change the state so TypeIsSet() returns false. More...
bool  | ClearId ()
Set the component id value to the ON_ModelComponent::Unset.ModelComponentId() and change the state so ModelComponentIdIsSet() returns false. More...
bool  | ClearIndex ()
Set the component index value to the ON_ModelComponent::Unset.ModelComponentIndex() and change the state so ModelComponentIndexIsSet() returns false. More...
unsigned int  | ClearModelComponentAttributes (unsigned int attributes_filter)
Writes the attributes identified by the component_filter parameter. More...
bool  | ClearModelComponentStatus ()
bool  | ClearModelSerialNumber ()
Sets the model serial number, reference model serial number and instance definition model serial number values to 0 and flags these values as unset. More...
bool  | ClearName ()
Set the component name value to the ON_ModelComponent::Unset.Name() and change the state so NameIsSet() and DeletedNameIsSet() both return false. More...
bool  | ClearParentId ()
int  | CompareName (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareName (const wchar_t *other_name) const
int  | CompareNameExact (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareNameExact (const wchar_t *other_name) const
ON_ModelComponent::Type  | ComponentType () const
bool  | ComponentTypeIsLocked () const
bool  | ComponentTypeIsSet () const
ON__UINT64  | ContentVersionNumber () const
Whenever an attribute is changed, the content version number is incremented. The ContentVersionNumber() is commonly used by consumers of the model component attributes to trigger updates when needed. More...
unsigned int  | CopyFrom (const ON_ModelComponent &src, unsigned int attributes_filter)
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
Returns a CRC calculated from the information that defines the object. This CRC can be used as a quick way to see if two objects are not identical. More...
const ON_wString  | DeletedName () const
const ON_NameHash &  | DeletedNameHash () const
bool  | DeletedNameIsSet () const
bool  | DeleteName ()
If NameIsSet() is true, then the name is deleted in a waty that can be undone by calling UndeleteName() and the DeletedNameIsSet() property is changed to true. More...
bool  | EraseIdentification (bool bIgnoreLocks)
const wchar_t *  | GetName (ON_wString &component_name) const
const ON_UUID &  | Id () const
bool  | IdIsLocked () const
bool  | IdIsNil () const
bool  | IdIsNotNil () const
bool  | IdIsSet () const
const ON_UUID &  | IfIdIsNilSetId ()
If the it is nil, call SetId(). More...
int  | Index () const
int  | Index (int unset_index_value) const
bool  | IndexIsLocked () const
bool  | IndexIsSet () const
unsigned int  | InstanceDefinitionModelSerialNumber () const
bool  | IsDeleted () const
bool  | IsHidden () const
bool  | IsLocked () const
bool  | IsReferenceComponent () const
bool  | IsSystemComponent () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
Tests an object to see if its data members are correctly initialized. More...
void  | LockAllSettingsExceptName ()
void  | LockComponentType ()
Calling LockType() will prhibit future changes to the Type attribute. More...
void  | LockId ()
Calling LockModelComponentId() will prhibit future changes to the ModelComponentId attribute. More...
void  | LockIndex ()
Calling LockModelComponentIndex() will prhibit future changes to the ModelComponentIndex attribute. More...
void  | LockModelComponentStatus ()
void  | LockModelSerialNumber ()
Calling LockModelSerialNumber() will prohibit future changes to the ModelSerialNumber(), ReferenceModelSerialNumber(), and InstanceDefinitionModelSerialNumber() attributes. More...
void  | LockName ()
Calling LockName() will prohibit future changes to the Name attribute. More...
void  | LockParentId ()
ON_ComponentStatus  | ModelComponentStatus () const
bool  | ModelComponentStatusIsLocked () const
bool  | ModelComponentStatusIsSet () const
ON_UUID  | ModelObjectId () const override
All objects in an opennurbs model have an id ( ON_Layer.m_layer_id, ON_Font.m_font_id, ON_Material.m_material_id, ON_3dmObjectAttributes.m_uuid ). More...
unsigned int  | ModelSerialNumber () const
bool  | ModelSerialNumberIsLocked () const
bool  | ModelSerialNumberIsSet () const
const ON_wString  | Name () const
const wchar_t *  | NameAsPointer () const
Expert user function that gets a pointer to the name. More...
const ON_NameHash &  | NameHash () const
Get a platform independent hash of the name suitable for equality testing and binary searching. When testing for equality or doing binary searches, using ON_NameHash values is faster than using the CompareName or ON_wString::CompareAttributeName. More...
bool  | NameIsEmpty () const
bool  | NameIsLocked () const
bool  | NameIsNotEmpty () const
bool  | NameIsSet () const
const ON_NameHash  | NewNameHash (const wchar_t *new_name) const
ON_ModelComponent &  | operator= (const ON_ModelComponent &source)
const ON_UUID &  | ParentId () const
bool  | ParentIdIsLocked () const
bool  | ParentIdIsNil () const
bool  | ParentIdIsNotNil () const
bool  | ParentIdIsSet () const
bool  | ReadModelComponentAttributes (class ON_BinaryArchive &archive)
unsigned int  | ReferenceModelSerialNumber () const
ON__UINT64  | RuntimeSerialNumber () const
const ON_UUID &  | SetAndLockId ()
Sets the id to a new value created by ON_CreateUuid() and locks the id attribute so it cannot be changed. More...
bool  | SetAsSystemComponent ()
bool  | SetAsUnsetSystemComponent ()
bool  | SetComponentType (ON_ModelComponent::Type component_component_type)
bool  | SetDeletedModelComponentState (bool bDeleted, class ON_ComponentManifest *manifest)
void  | SetHiddenModelComponentState (bool bHidden)
bool  | SetId (const ON_UUID &component_id)
const ON_UUID &  | SetId ()
Sets the id to a new value created by ON_CreateUuid(). More...
bool  | SetIdentification (const class ON_ComponentManifestItem &manifest_item, const wchar_t *manifest_name, bool bSetId, bool bParentId, bool bSetName, bool bSetIndex)
Set a component's id, name and index to the manifest_item values. More...
bool  | SetIndex (int component_index)
bool  | SetLocalizedSystemComponentName (const wchar_t *system_component_localized_name)
void  | SetLockedModelComponentState (bool bLocked)
bool  | SetModelComponentStatus (ON_ComponentStatus component_status)
bool  | SetModelSerialNumber (unsigned int model_serial_number)
Specify the model that is managing this component. More...
bool  | SetModelSerialNumber (unsigned int model_serial_number, unsigned int reference_model_serial_number, unsigned int instance_definition_model_serial_number)
Specify the model that is managing this component. More...
bool  | SetName (const wchar_t *component_name)
bool  | SetParentId (const ON_UUID &parent_id)
unsigned int  | SizeOf () const override
bool  | UndeleteName ()
bool  | WriteModelComponentAttributes (class ON_BinaryArchive &archive, unsigned int attributes_filter) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
bool  | AttachUserData (class ON_UserData *pUserData)
Attach user data to an object. More...
unsigned int  | ClearAllComponentStates () const
Set all active level component states to ON_ComponentStatus::NoneSet. More...
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
Clear the specified states on every component. More...
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
Clear states on an individual component. More...
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
Expert user tool that copies user data items with positive values of ON_UserData.m_userdata_copycount from source_object to "this. More...
void  | CopyUserData (const ON_Object &source_object)
Calls CopyUserData(source_object,ON_Object::UserDataConflictResolution::source_object). More...
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
Delete the portions of the object identified in ci_list[]. More...
virtual void  | DestroyRuntimeCache (bool bDelete=true)
Expert user function. If you are using openNURBS in its default configuration to read and write 3dm archives, you never need to call this function. Many objects employ lazy creation of (runtime) caches that save information to help speed geometric calculations. This function will destroy all runtime information. More...
bool  | DetachUserData (class ON_UserData *pUserData)
Remove user data from an object. More...
void  | EmergencyDestroy ()
Sets m_user_data_list = 0. More...
class ON_UserData *  | FirstUserData () const
User data is stored as a linked list of ON_UserData classes. FirstUserData gets the first item in the linked list. This is the most recent item attached using AttachUserData(). Remark: To iterate through all the user data on an object, call FirstUserData() and then use ON_UserData::Next() to traverse the list. More...
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
Get a pointer to user data. More...
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
Get user string from the object. More...
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
Get a list of all user string keys on the object. More...
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
Get a list of all user strings on the object. More...
bool  | IsKindOf (const ON_ClassId *pClassId) const
Low level tool to test if an object is derived from a specified class. More...
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
virtual void  | MemoryRelocate ()
The MemoryRelocate() function is called when an object's location in memory is changed. For example, if an object resides in a chunk of memory that is grown by calling a realloc that has to allocate a new chunk and copy the contents of the old chunk to the new chunk, then the location of the object's memory changes. In practice this happens when classes derived from ON_Object are stored in dynamic arrays, like the default implementation of ON_ObjectArray<>'s that use realloc to grow the dynamic array. More...
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
Expert user tool that moves user data items from source_object to "this. More...
void  | MoveUserData (ON_Object &source_object)
Calls MoveUserData(source_object,ON_Object::UserDataConflictResolution::source_object,true). More...
virtual ON::object_type  | ObjectType () const
Useful for switch statements that need to differentiate between basic object types like points, curves, surfaces, and so on. More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
PurgeUserData() removes all user data from object. More...
virtual bool  | Read (ON_BinaryArchive &binary_archive)
Low level archive writing tool used by ON_BinaryArchive::ReadObject(). More...
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
Set states on an individual component. More...
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
Copy status settings to an individual component. More...
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
Attach a user string to the object. This information will perisist through copy construction, operator=, and file IO. More...
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
Append entries to the user string list More...
void  | TransformUserData (const class ON_Xform &xform)
Objects derived from ON_Geometry must call TransformUserData() in their Transform() member function. More...
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
Low level archive writing tool used by ON_BinaryArchive::WriteObject(). More...
 Static Public Member Functions
static ON_ModelGeometryComponent *  | Create (const class ON_Object &model_geometry, const class ON_3dmObjectAttributes *attributes, ON_ModelGeometryComponent *model_geometry_component)
static ON_ModelGeometryComponent *  | CreateForExperts (bool bManageGeometry, class ON_Object *geometry_object, bool bManageAttributes, class ON_3dmObjectAttributes *attributes, ON_ModelGeometryComponent *model_geometry_component)
static ON_ModelGeometryComponent *  | CreateManaged (class ON_Object *geometry_object, class ON_3dmObjectAttributes *attributes, ON_ModelGeometryComponent *model_geometry_component)
static const ON_ModelGeometryComponent *  | FromModelComponentRef (const class ON_ModelComponentReference &model_component_reference, const ON_ModelGeometryComponent *none_return_value)
 Static Public Member Functions inherited from ON_ModelComponent
static int  | CompareId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareIdAndName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameAndId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameExact (const ON_ModelComponent &a, const ON_ModelComponent &b)
static ON_ModelComponent::Type  | ComponentTypeFromUnsigned (unsigned int component_type_as_unsigned)
static bool  | ComponentTypeIsValid (ON_ModelComponent::Type component_type)
static bool  | ComponentTypeIsValidAndNotMixed (ON_ModelComponent::Type component_type)
static const ON_wString  | ComponentTypeToString (ON_ModelComponent::Type)
static bool  | IndexRequired (ON_ModelComponent::Type component_type)
static unsigned int  | Internal_SystemComponentHelper ()
For internal use. Never call this function. More...
static const wchar_t *  | IsNamePathSeparator (const wchar_t *s)
Test a string to see if its beginning matches the string returned by ON_ModelComponent::NamePathSeparator. More...
*</code > *</example > *static const wchar_t *  | IsReferencePrefixDelimiter (const wchar_t *s)
Test a string to see if its beginning matches the string returned by ON_ModelComponent::NameReferenceDelimiter. More...
static const wchar_t *  | IsReferencePrefixSeparator (const wchar_t *s)
Test a string to see if its beginning matches the string returned by ON_ModelComponent::NameReferenceSeparator. More...
static bool  | IsValidComponentName (const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (const ON_wString &candidate_component_name)
static bool  | IsValidComponentName (size_t length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (const class ON_ComponentManifest &model_manfest, const ON_ModelComponent &model_component, bool bPermitReferencePrefix, ON_wString &valid_name)
static bool  | IsValidComponentNameFirstCodePoint (ON__UINT32 unicode_code_point)
static bool  | IsValidComponentNameFirstCodePoint (int length, const wchar_t *candidate_component_name)
static const ON_wString  | NameLeaf (const wchar_t *name)
static const ON_wString  | NameParent (const wchar_t *name, bool bIncludeReference)
static const ON_wString  | NameReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveAllReferencePrefixDelimiters (const wchar_t *name)
Remove all occurances of ON::NameReferenceDelimiter() from name. More...
static const ON_wString  | RemoveReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveTrailingNamePathSeparator (const wchar_t *name)
Remove any trailing occurance of ON_ModelComponent::NamePathSeparator from name. More...
static const ON_wString  | RemoveTrailingReferencePrefixDelimiter (const wchar_t *name)
Remove any trailing occurance of ON_ModelComponent::NameReferenceDelimiter from name. More...
static const ON_wString  | RemoveTrailingReferencePrefixSeparator (const wchar_t *name)
Remove any trailing occurance of ON_ModelComponent::NameReferenceSeparator from name. More...
static void  | SplitName (const wchar_t *name, ON_wString &reference_prefix, ON_wString &name_parent, ON_wString &name_leaf)
static bool  | UniqueNameIgnoresCase (ON_ModelComponent::Type component_type)
static bool  | UniqueNameIncludesParent (ON_ModelComponent::Type component_type)
static bool  | UniqueNameRequired (ON_ModelComponent::Type component_type)
 Static Public Attributes
static const ON_ModelGeometryComponent  | Unset
 Static Public Attributes inherited from ON_ModelComponent
static const ON_wString  | NamePathSeparator
Returns the string "::". This is the string Rhino uses in layer full path names to separate the names of individual layers. More...
static const ON_wString  | ReferencePrefixDelimiter
Returns the string " : ". This is the string Rhino uses to separate the reference file names from and model component names read from those files. More...
static const ON_wString  | ReferencePrefixSeparator
Returns the string ">". This is the string Rhino uses to separate the block definition name and linked file name in grandparent layers. More...
static const ON_ModelComponent  | Unset
*static const ON_wString WorksessionReferencePrefix *const  | wchar_t
 Additional Inherited Members
 Public Types inherited from ON_ModelComponent
enum  | Attributes : unsigned int {
 NoAttributes = 0U, ComponentSerialNumberAttribute = 0x0001U, TypeAttribute = 0x0002U, ModelSerialNumberAttribute = 0x0004U,
 IdAttribute = 0x0008U, IndexAttribute = 0x0010U, NameAttribute = 0x0020U, ParentIdAttribute = 0x0040U,
 DeletedNameAttribute = 0x0080U, ComponentStatusAttribute = 0x0100U, BinaryArchiveAttributes = 0x78U, AllAttributes = 0x1FFU,
 SystemComponentAttribute = 0x8000U
 }
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Image = 1, Type::TextureMapping = 2, Type::RenderMaterial = 3,
 Type::LinePattern = 4, Type::Layer = 5, Type::Group = 6, Type::TextStyle = 7,
 Type::DimStyle = 8, Type::RenderLight = 9, Type::HatchPattern = 10, Type::InstanceDefinition = 11,
 Type::ModelGeometry = 12, Type::HistoryRecord = 13, Type::Mixed = 0xFE
 }
The ON_ModelComponent::Type enum has a value for each explicit component type and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator instance to iterate over the ON_ModelComponent::Type values. More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
When a userdata item is copied or moved from a source object to a destination object, the ON_Object::UserDataConflictResolution enum values specify how conficts are resolved. Remark: A userdata item "conflict" occurs when both the destination and source object have a user data item with the same value of ON_UserData::m_userdata_uuid. More...
 Protected Member Functions inherited from ON_ModelComponent
void  | IncrementContentVersionNumber () const
Detailed Description
Used to store geometry table object definition and attributes in an ONX_Model.
Constructor & Destructor Documentation
◆ ON_ModelGeometryComponent() [1/3]
 ON_ModelGeometryComponent::ON_ModelGeometryComponent  |  ( |   | )
◆ ON_ModelGeometryComponent() [2/3]
 ON_ModelGeometryComponent::ON_ModelGeometryComponent  |  ( |  ON_ModelComponent::Type  |  type | )
◆ ~ON_ModelGeometryComponent()
 ON_ModelGeometryComponent::~ON_ModelGeometryComponent  |  ( |   | )
◆ ON_ModelGeometryComponent() [3/3]
 ON_ModelGeometryComponent::ON_ModelGeometryComponent  |  ( |  const ON_ModelGeometryComponent &  |   | )
Member Function Documentation
◆ Attributes()
 const ON_3dmObjectAttributes* ON_ModelGeometryComponent::Attributes  |  ( |  const ON_3dmObjectAttributes *  |  no_attributes_return_value | ) |   const
Parameters
no_attributes_return_value | [in] This value is returned if no attributes have been set. A good choices for this parameter's value depends on the context. Common options are nullptr, &ON_3dmObjectAttributes::Unset, &ON_3dmObjectAttributes::Default, or the model's current default attributes.
Returns
The layer, rendering and other attributes for this element, or no_attributes_return_value if the attributes have not been set.
◆ Create()
 static ON_ModelGeometryComponent* ON_ModelGeometryComponent::Create  |  ( |  const class ON_Object &  |  model_geometry,
|  const class ON_3dmObjectAttributes *  |  attributes,
|  ON_ModelGeometryComponent *  |  model_geometry_component
)
static
Parameters
geometry | [in] ON_Curve, ON_Surface, ON_Brep, ON_Mesh, ON_Light, annotation, detail, ... A new copy of the geometry is managed by the ON_ModelGeometryComponent class.
attributes | [in] nullptr if not available. A new copy of the attributes is managed by the ON_ModelGeometryComponent class.
model_geometry_component | [in] If not nullptr, this class is set. Otherwise operator new allocates an ON_ModelGeometryComponent class.
The returned ON_ModelGeometryComponent manages geometry and attributes and will eventually delete them.
◆ CreateForExperts()
 static ON_ModelGeometryComponent* ON_ModelGeometryComponent::CreateForExperts  |  ( |  bool  |  bManageGeometry,
|  class ON_Object *  |  geometry_object,
|  bool  |  bManageAttributes,
|  class ON_3dmObjectAttributes *  |  attributes,
|  ON_ModelGeometryComponent *  |  model_geometry_component
)
static
Parameters
bManageGeometry | [in] If true, geometry_object was created on the heap using operator new and the ON_ModelGeometryComponent destructor will delete geometry_object. Othewise the expert caller is carefully managing the geometry_object instance and memory.
geometry_object | [in] ON_Curve, ON_Surface, ON_Brep, ON_Mesh, ON_Light, annotation, detail, ...
bManageAttributes | [in] If true, attributes is nullptr or was created on the heap using operator new and the ON_ModelGeometryComponent destructor will delete attributes. Othewise the expert caller is carefully managing the attributes instance and memory.
attributes | [in] nullptr if not available
model_geometry_component | [in] If not nullptr, this class is set. Otherwise operator new allocates an ON_ModelGeometryComponent class.
◆ CreateManaged()
 static ON_ModelGeometryComponent* ON_ModelGeometryComponent::CreateManaged  |  ( |  class ON_Object *  |  geometry_object,
|  class ON_3dmObjectAttributes *  |  attributes,
|  ON_ModelGeometryComponent *  |  model_geometry_component
)
static
Parameters
geometry_object | [in] ON_Curve, ON_Surface, ON_Brep, ON_Mesh, ON_Light, annotation, detail, ... geometry_object was created on the heap using operator new and the ON_ModelGeometryComponent destructor will delete geometry_object.
attributes | [in] attributes is nullptr or was created on the heap using operator new and the ON_ModelGeometryComponent destructor will delete attributes.
model_geometry | [in] If not nullptr, this class is set. Otherwise operator new allocates an ON_ModelGeometryComponent class.
The returned ON_ModelGeometryComponent manages geometry_object and attributes and will eventually delete them.
◆ Dump()
 void ON_ModelGeometryComponent::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
Creates a text dump of the object.
Dump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
The default implementations of this virtual function prints the class's name.
Reimplemented from ON_ModelComponent.
◆ FromModelComponentRef()
 static const ON_ModelGeometryComponent* ON_ModelGeometryComponent::FromModelComponentRef  |  ( |  const class ON_ModelComponentReference &  |  model_component_reference,
|  const ON_ModelGeometryComponent *  |  none_return_value
)
static
◆ Geometry()
 const class ON_Geometry* ON_ModelGeometryComponent::Geometry  |  ( |  const class ON_Geometry *  |  no_geometry_return_value | ) |   const
Parameters
no_geometry_return_value | [in] This value is returned if no geometric object has been set. A good choices for this parameter's value depends on the context. Common options are nullptr.
Returns
The curve, surface, annotation, detail, light, ... geometry, or no_geometry_return_value if the geometry has not been set. If the geometry is a light, then ComponentType() will return ON_ModelComponent::Type::RenderLight. If the geometry is set and something besides light, then ComponentType() will return ON_ModelComponent::Type::ModelGeometry. Otherwise, ComponentType() will return ON_ModelComponent::Type::ModelGeometry::Unset.
◆ IsEmpty()
 bool ON_ModelGeometryComponent::IsEmpty  |  ( |   | ) |   const
◆ IsInstanceDefinitionGeometry()
 bool ON_ModelGeometryComponent::IsInstanceDefinitionGeometry  |  ( |   | ) |   const
◆ operator=()
 ON_ModelGeometryComponent& ON_ModelGeometryComponent::operator=  |  ( |  const ON_ModelGeometryComponent &  |   | )
◆ UpdateReferencedComponents()
 bool ON_ModelGeometryComponent::UpdateReferencedComponents  |  ( |  const class ON_ComponentManifest &  |  source_manifest,
|  const class ON_ComponentManifest &  |  destination_manifest,
|  const class ON_ManifestMap &  |  manifest_map
)
overridevirtual
Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion.
Parameters
source_manifest | [in] A manifest of the source context with indices and ids corresponding to the current component references. If this manifest is not available, pass ON_ComponentManifest::Empty.
destination_manifest | [in] A manifest of the destination context with indices and ids corresponding to the desired component references. If this manifest is not available, pass ON_ComponentManifest::Empty.
manifest_map | [in] A map from the source (current) referenced component index/id values to the destination (desired) component index/id values.
Returns
True if successful. False indicates a referenced component was not found in the manifest and the reference was changed to a default value.
If this object is an ON_Layer, the line pattern and render material references
are updated.
If this object is an ON_DimStyle, the text style reference is updated.
If this object is an ON_3dmObjectAttributes, the layer,
material, line pattern, and group references are updated.
Reimplemented from ON_Object.
Member Data Documentation
◆ Unset
 const ON_ModelGeometryComponent ON_ModelGeometryComponent::Unset
static