openNURBS SDK Help 6.0
 Public Member Functions | Protected Member Functions | List of all members
ON_Curve Class Referenceabstract
ON_Curve is a pure virtual class for curve objects More...
#include <opennurbs_curve.h>
 Inheritance diagram for ON_Curve:
 Public Member Functions
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
virtual bool  | ChangeClosedCurveSeam (double t)
If this curve is closed, then modify it so that the start/end point is at curve parameter t. More...
virtual bool  | ChangeDimension (int desired_dimension)
Change the dimension of a curve. More...
ON_3dVector  | CurvatureAt (double t) const
Evaluate the curvature vector at a parameter. More...
virtual int  | Degree () const =0
Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. More...
ON_3dVector  | DerivativeAt (double t) const
Evaluate first derivative at a parameter. More...
void  | DestroyCurveTree ()
Destroys the runtime curve tree used to speed closest point and intersection calcuations. More...
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
virtual ON_Interval  | Domain () const =0
virtual ON_Curve *  | DuplicateCurve () const
Get a duplicate of the curve. More...
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
Evaluate first derivative at a parameter with error checking. More...
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
Evaluate second derivative at a parameter with error checking. More...
virtual bool  | Evaluate (double t, int der_count, int v_stride, double *v, int side=0, int *hint=0) const =0
This evaluator actually does all the work. The other ON_Curve evaluation tools call this virtual function. More...
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
Evaluate unit tangent and curvature at a parameter with error checking. More...
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
Evaluate point at a parameter with error checking. More...
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
Evaluate unit tangent at a parameter with error checking. More...
virtual bool  | Extend (const ON_Interval &domain)
Pure virtual function. Default returns false. Where possible, analytically extends curve to include domain. More...
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
Return a 3d frame at a parameter. More...
virtual bool  | GetCurveParameterFromNurbFormParameter (double nurbs_t, double *curve_t) const
Convert a NURBS curve parameter to a curve parameter More...
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const
Search for a derivatitive, tangent, or curvature discontinuity. More...
virtual int  | GetNurbForm (ON_NurbsCurve &nurbs_curve, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
Get a NURBS curve representation of this curve. More...
virtual bool  | GetNurbFormParameterFromCurveParameter (double curve_t, double *nurbs_t) const
Convert a curve parameter to a NURBS curve parameter. More...
virtual bool  | GetParameterTolerance (double t, double *tminus, double *tplus) const
Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. More...
virtual bool  | GetSpanVector (double *knots) const =0
Get number of parameters of "knots". More...
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override More...
virtual int  | HasNurbForm () const
Does a NURBS curve representation of this curve. More...
virtual bool  | IsArc (const ON_Plane *plane=nullptr, ON_Arc *arc=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
Test a curve to see if the locus if its points is an arc or circle. More...
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
Decide if it makes sense to close off this curve by moving the endpoint to the start based on start-end gap size and length of curve as approximated by chord defined by 6 points. More...
virtual bool  | IsClosed () const
Test a curve to see if it is closed. More...
virtual bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const
Test continuity at a curve parameter value. More...
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
virtual bool  | IsInPlane (const ON_Plane &test_plane, double tolerance=ON_ZERO_TOLERANCE) const =0
Test a curve to see if it lies in a specific plane. More...
virtual bool  | IsLinear (double tolerance=ON_ZERO_TOLERANCE) const
Test a curve to see if the locus if its points is a line segment. More...
virtual bool  | IsPeriodic () const
Test a curve to see if it is periodic. More...
virtual bool  | IsPlanar (ON_Plane *plane=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
Test a curve to see if it is planar. More...
virtual int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const
Several types of ON_Curve can have the form of a polyline including a degree 1 ON_NurbsCurve, an ON_PolylineCurve, and an ON_PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline. More...
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
Get a NURBS curve representation of this curve. More...
ON::object_type  | ObjectType () const override
overrides virtual ON_Object::ObjectType. More...
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
Evaluate point at a parameter. More...
ON_3dPoint  | PointAtEnd () const
Evaluate point at the end of the curve. More...
ON_3dPoint  | PointAtStart () const
Evaluate point at the start of the curve. More...
virtual bool  | Reverse ()=0
Reverse the direction of the curve. More...
bool  | SetDomain (ON_Interval domain)
Set the domain of the curve. More...
virtual bool  | SetDomain (double t0, double t1)
Set the domain of the curve More...
virtual bool  | SetEndPoint (ON_3dPoint end_point)
Force the curve to end at a specified point. More...
virtual bool  | SetStartPoint (ON_3dPoint start_point)
Force the curve to start at a specified point. More...
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
virtual int  | SpanCount () const =0
Get number of nonempty smooth (c-infinity) spans in curve More...
virtual bool  | Split (double t, ON_Curve *&left_side, ON_Curve *&right_side) const
Splits (divides) the curve at the specified parameter. The parameter must be in the interior of the curve's domain. The pointers passed to Split must either be nullptr or point to an ON_Curve object of the same type. If the pointer is nullptr, then a curve will be created in Split(). You may pass "this" as left_side or right_side. More...
ON_3dVector  | TangentAt (double t) const
Evaluate unit tangent vector at a parameter. More...
bool  | Transform (const ON_Xform &xform) override
overrides virtual ON_Geometry::Transform(). ON_Curve::Transform() calls ON_Geometry::Transform(xform), which calls ON_Object::TransformUserData(xform), and then calls this->DestroyCurveTree(). More...
virtual bool  | Trim (const ON_Interval &domain)
Removes portions of the curve outside the specified interval. More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
Get object's 3d axis aligned bounding box. More...
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
If possible, BrepForm() creates a brep form of the ON_Geometry. More...
virtual void  | ClearBoundingBox ()
Some objects cache bounding box information. If you modify an object, then call ClearBoundingBox() to inform the object that any cached bounding boxes are invalid. More...
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
If this piece of geometry is a component in something larger, like an ON_BrepEdge in an ON_Brep, then this function returns the component index. More...
virtual int  | Dimension () const
Dimension of the object. More...
virtual bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const
This is the virtual function that actually calculates axis aligned bounding boxes. More...
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
Get object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
Get corners of object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
virtual bool  | HasBrepForm () const
Query an object to see if it has an ON_Brep form. Result: Returns true if the virtual ON_Geometry::BrepForm can compute an ON_Brep representation of this object. More...
virtual bool  | IsDeformable () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
Tests an object to see if its data members are correctly initialized. More...
virtual bool  | MakeDeformable ()
If possible, converts the object into a form that can be accuratly modified with "squishy" transformations like projections, shears, an non-uniform scaling. More...
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Scale (double scale_factor)
Scales the object by the specified facotor. The scale is centered at the origin. More...
virtual bool  | SwapCoordinates (int i, int j)
Swaps object coordinate values with indices i and j. More...
bool  | Translate (const ON_3dVector &translation_vector)
Translates the object along the specified vector. More...
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
bool  | AttachUserData (class ON_UserData *pUserData)
Attach user data to an object. More...
unsigned int  | ClearAllComponentStates () const
Set all active level component states to ON_ComponentStatus::NoneSet. More...
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
Clear the specified states on every component. More...
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
Clear states on an individual component. More...
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
Expert user tool that copies user data items with positive values of ON_UserData.m_userdata_copycount from source_object to "this. More...
void  | CopyUserData (const ON_Object &source_object)
Calls CopyUserData(source_object,ON_Object::UserDataConflictResolution::source_object). More...
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
Returns a CRC calculated from the information that defines the object. This CRC can be used as a quick way to see if two objects are not identical. More...
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
Delete the portions of the object identified in ci_list[]. More...
bool  | DetachUserData (class ON_UserData *pUserData)
Remove user data from an object. More...
virtual void  | Dump (ON_TextLog &) const
Creates a text dump of the object. More...
void  | EmergencyDestroy ()
Sets m_user_data_list = 0. More...
class ON_UserData *  | FirstUserData () const
User data is stored as a linked list of ON_UserData classes. FirstUserData gets the first item in the linked list. This is the most recent item attached using AttachUserData(). Remark: To iterate through all the user data on an object, call FirstUserData() and then use ON_UserData::Next() to traverse the list. More...
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
Get a pointer to user data. More...
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
Get user string from the object. More...
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
Get a list of all user string keys on the object. More...
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
Get a list of all user strings on the object. More...
bool  | IsKindOf (const ON_ClassId *pClassId) const
Low level tool to test if an object is derived from a specified class. More...
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
virtual void  | MemoryRelocate ()
The MemoryRelocate() function is called when an object's location in memory is changed. For example, if an object resides in a chunk of memory that is grown by calling a realloc that has to allocate a new chunk and copy the contents of the old chunk to the new chunk, then the location of the object's memory changes. In practice this happens when classes derived from ON_Object are stored in dynamic arrays, like the default implementation of ON_ObjectArray<>'s that use realloc to grow the dynamic array. More...
virtual ON_UUID  | ModelObjectId () const
All objects in an opennurbs model have an id ( ON_Layer.m_layer_id, ON_Font.m_font_id, ON_Material.m_material_id, ON_3dmObjectAttributes.m_uuid ). More...
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
Expert user tool that moves user data items from source_object to "this. More...
void  | MoveUserData (ON_Object &source_object)
Calls MoveUserData(source_object,ON_Object::UserDataConflictResolution::source_object,true). More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
PurgeUserData() removes all user data from object. More...
virtual bool  | Read (ON_BinaryArchive &binary_archive)
Low level archive writing tool used by ON_BinaryArchive::ReadObject(). More...
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
Set states on an individual component. More...
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
Copy status settings to an individual component. More...
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
Attach a user string to the object. This information will perisist through copy construction, operator=, and file IO. More...
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
Append entries to the user string list More...
void  | TransformUserData (const class ON_Xform &xform)
Objects derived from ON_Geometry must call TransformUserData() in their Transform() member function. More...
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. More...
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
Low level archive writing tool used by ON_BinaryArchive::WriteObject(). More...
 Protected Member Functions
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
Lookup a parameter in the m_t array, optionally using a built in snap tolerance to snap a parameter value to an element of m_t. This function is used by some types derived from ON_Curve to snap parameter values More...
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
When a userdata item is copied or moved from a source object to a destination object, the ON_Object::UserDataConflictResolution enum values specify how conficts are resolved. Remark: A userdata item "conflict" occurs when both the destination and source object have a user data item with the same value of ON_UserData::m_userdata_uuid. More...
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
Detailed Description
ON_Curve is a pure virtual class for curve objects
Any class derived from ON_Curve should have a ON_OBJECT_DECLARE(ON_...); at the beginning of its class definition and a ON_OBJECT_IMPLEMENT( ON_..., ON_Curve ); in a .cpp file.
- See the definition of ON_NurbsCurve for an example.
Constructor & Destructor Documentation
◆ ON_Curve() [1/2]
 ON_Curve::ON_Curve  |  ( |   | )
◆ ~ON_Curve()
 virtual ON_Curve::~ON_Curve  |  ( |   | )
virtual
◆ ON_Curve() [2/2]
 ON_Curve::ON_Curve  |  ( |  const ON_Curve &  |   | )
Member Function Documentation
◆ ChangeClosedCurveSeam()
 virtual bool ON_Curve::ChangeClosedCurveSeam  |  ( |  double  |  t | )
virtual
If this curve is closed, then modify it so that the start/end point is at curve parameter t.
Parameters
t | [in] curve parameter of new start/end point. The returned curves domain will start at t.
Returns
true if successful.
Reimplemented in ON_NurbsCurve, ON_PolyCurve, ON_PolylineCurve, ON_ArcCurve, and ON_PolyEdgeCurve.
◆ ChangeDimension()
 virtual bool ON_Curve::ChangeDimension  |  ( |  int  |  desired_dimension | )
virtual
Change the dimension of a curve.
Parameters
desired_dimension | [in]
Returns
true if the curve's dimension was already desired_dimension or if the curve's dimension was successfully changed to desired_dimension.
Reimplemented in ON_NurbsCurve, ON_PolyCurve, ON_PolylineCurve, ON_ArcCurve, and ON_LineCurve.
◆ CurvatureAt()
 ON_3dVector ON_Curve::CurvatureAt  |  ( |  double  |  t | ) |   const
Evaluate the curvature vector at a parameter.
Parameters
t | [in] evaluation parameter
Returns
curvature vector of the curve at the parameter t.
No error handling.
See also
ON_Curve::EvCurvature
◆ Degree()
 virtual int ON_Curve::Degree  |  ( |   | ) |   const
pure virtual
Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic.
Returns
degree
Implemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ DerivativeAt()
 ON_3dVector ON_Curve::DerivativeAt  |  ( |  double  |  t | ) |   const
Evaluate first derivative at a parameter.
Parameters
t | [in] evaluation parameter
Returns
First derivative of the curve at the parameter t.
No error handling.
See also
ON_Curve::Ev1Der
◆ DestroyCurveTree()
 void ON_Curve::DestroyCurveTree  |  ( |   | )
Destroys the runtime curve tree used to speed closest point and intersection calcuations.
If the geometry of the curve is modified in any way, then call DestroyCurveTree(); The curve tree is created as needed.
◆ DestroyRuntimeCache()
 void ON_Curve::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
virtual ON_Object::DestroyRuntimeCache override
Reimplemented from ON_Object.
Reimplemented in ON_PolyEdgeSegment, ON_CurveProxy, ON_PolyCurve, and ON_PolyEdgeCurve.
◆ Domain()
 virtual ON_Interval ON_Curve::Domain  |  ( |   | ) |   const
pure virtual
Returns
domain of the curve.
Implemented in ON_NurbsCurve, ON_CurveProxy, ON_ArcCurve, ON_PolyCurve, ON_PolylineCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ DuplicateCurve()
 virtual ON_Curve* ON_Curve::DuplicateCurve  |  ( |   | ) |   const
virtual
Get a duplicate of the curve.
Returns
A duplicate of the curve.
The caller must delete the returned curve. For non-ON_CurveProxy objects, this simply duplicates the curve using ON_Object::Duplicate. For ON_CurveProxy objects, this duplicates the actual proxy curve geometry and, if necessary, trims and reverse the result to that the returned curve's parameterization and locus match the proxy curve's.
Reimplemented in ON_CurveProxy, ON_PolyEdgeSegment, ON_PolyCurve, and ON_PolyEdgeCurve.
◆ Ev1Der()
 bool ON_Curve::Ev1Der  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  ON_3dVector &  |  first_derivative,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Evaluate first derivative at a parameter with error checking.
Parameters
t | [in] evaluation parameter
point | [out] value of curve at t
first_derivative | [out] value of first derivative at t
side | [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above
hint | [in/out] optional evaluation hint used to speed repeated evaluations
Returns
false if unable to evaluate.
See also
ON_Curve::EvPoint, ON_Curve::Ev2Der, ON_Curve::EvTangent, ON_Curve::Evaluate
◆ Ev2Der()
 bool ON_Curve::Ev2Der  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  ON_3dVector &  |  first_derivative,
|  ON_3dVector &  |  second_derivative,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Evaluate second derivative at a parameter with error checking.
Parameters
t | [in] evaluation parameter
point | [out] value of curve at t
first_derivative | [out] value of first derivative at t
second_derivative | [out] value of second derivative at t
side | [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above
hint | [in/out] optional evaluation hint used to speed repeated evaluations
Returns
false if unable to evaluate.
See also
ON_Curve::Ev1Der, ON_Curve::EvCurvature, ON_Curve::Evaluate
◆ Evaluate()
 virtual bool ON_Curve::Evaluate  |  ( |  double  |  t,
|  int  |  der_count,
|  int  |  v_stride,
|  double *  |  v,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
pure virtual
This evaluator actually does all the work. The other ON_Curve evaluation tools call this virtual function.
Parameters
t | [in] evaluation parameter ( usually in Domain() ).
der_count | [in] (>=0) number of derivatives to evaluate
v_stride | [in] (>=Dimension()) stride to use for the v[] array
v | [out] array of length (der_count+1)*v_stride curve(t) is returned in (v[0],...,v[m_dim-1]), curve'(t) is retuned in (v[v_stride],...,v[v_stride+m_dim-1]), curve"(t) is retuned in (v[2*v_stride],...,v[2*v_stride+m_dim-1]), etc.
side | [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above
hint | [in/out] optional evaluation hint used to speed repeated evaluations
Returns
false if unable to evaluate.
See also
ON_Curve::EvPoint, ON_Curve::Ev1Der, ON_Curve::Ev2Der
Implemented in ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ EvaluatePoint()
 bool ON_Curve::EvaluatePoint  |  ( |  const class ON_ObjRef &  |  objref,
|  ON_3dPoint &  |  P
) |   |  const
overridevirtual
virtual ON_Geometry override
Reimplemented from ON_Geometry.
Reimplemented in ON_PolyCurve.
◆ EvCurvature()
 bool ON_Curve::EvCurvature  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  ON_3dVector &  |  tangent,
|  ON_3dVector &  |  kappa,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Evaluate unit tangent and curvature at a parameter with error checking.
Parameters
t | [in] evaluation parameter
point | [out] value of curve at t
tangent | [out] value of unit tangent
kappa | [out] value of curvature vector
side | [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above
hint | [in/out] optional evaluation hint used to speed repeated evaluations
Returns
false if unable to evaluate.
See also
ON_Curve::CurvatureAt, ON_Curve::Ev2Der, ON_EvCurvature
◆ EvPoint()
 bool ON_Curve::EvPoint  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Evaluate point at a parameter with error checking.
Parameters
t | [in] evaluation parameter
point | [out] value of curve at t
side | [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above
hint | [in/out] optional evaluation hint used to speed repeated evaluations
Returns
false if unable to evaluate.
See also
ON_Curve::PointAt, ON_Curve::EvTangent, ON_Curve::Evaluate
◆ EvTangent()
 bool ON_Curve::EvTangent  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  ON_3dVector &  |  tangent,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Evaluate unit tangent at a parameter with error checking.
Parameters
t | [in] evaluation parameter
point | [out] value of curve at t
tangent | [out] value of unit tangent
side | [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above
hint | [in/out] optional evaluation hint used to speed repeated evaluations
Returns
false if unable to evaluate.
See also
ON_Curve::TangentAt, ON_Curve::Ev1Der
◆ Extend()
 virtual bool ON_Curve::Extend  |  ( |  const ON_Interval &  |  domain | )
virtual
Pure virtual function. Default returns false. Where possible, analytically extends curve to include domain.
Parameters
domain | [in] if domain is not included in curve domain, curve will be extended so that its domain includes domain. Will not work if curve is closed. Original curve is identical to the restriction of the resulting curve to the original curve domain,
Returns
true if successful.
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, and ON_LineCurve.
◆ FirstSpanIsLinear() [1/2]
 bool ON_Curve::FirstSpanIsLinear  |  ( |  double  |  min_length,
|  double  |  tolerance
) |   |  const
Parameters
min_length | [in] minimum length of a linear span
tolerance | [in] distance tolerance to use when checking linearity. Returns true if the span is a non-degenrate line. This means:
dimension = 2 or 3
The length of the the line segment from the span's initial point to the span's control point is >= min_length.
The maximum distance from the line segment to the span is <= tolerance and the span increases monotonically in the direction of the line segment.
◆ FirstSpanIsLinear() [2/2]
 bool ON_Curve::FirstSpanIsLinear  |  ( |  double  |  min_length,
|  double  |  tolerance,
|  ON_Line *  |  span_line
) |   |  const
◆ FrameAt()
 bool ON_Curve::FrameAt  |  ( |  double  |  t,
|  ON_Plane &  |  plane
) |   |  const
Return a 3d frame at a parameter.
Parameters
t | [in] evaluation parameter
plane | [out] the frame is returned here
Returns
true if successful
See also
ON_Curve::PointAt, ON_Curve::TangentAt,, ON_Curve::Ev1Der, Ev2Der
◆ GetCurveParameterFromNurbFormParameter()
 virtual bool ON_Curve::GetCurveParameterFromNurbFormParameter  |  ( |  double  |  nurbs_t,
|  double *  |  curve_t
) |   |  const
virtual
Convert a NURBS curve parameter to a curve parameter
Parameters
nurbs_t | [in] nurbs form parameter
curve_t | [out] curve parameter
If GetNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.
See also
ON_Curve::GetNurbForm, ON_Curve::GetNurbFormParameterFromCurveParameter
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_LineCurve, and ON_ArcCurve.
◆ GetDomain()
 bool ON_Curve::GetDomain  |  ( |  double *  |  t0,
|  double *  |  t1
) |   |  const
curve interface
Gets domain of the curve
Parameters
t0 | [out]
t1 | [out] domain is [*t0, *t1]
Returns
true if successful.
◆ GetNextDiscontinuity()
 virtual bool ON_Curve::GetNextDiscontinuity  |  ( |  ON::continuity  |  c,
|  double  |  t0,
|  double  |  t1,
|  double *  |  t,
|  int *  |  hint = nullptr,
|  int *  |  dtype = nullptr,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
virtual
Search for a derivatitive, tangent, or curvature discontinuity.
Parameters
c | [in] type of continity to test for.
t0 | [in] Search begins at t0. If there is a discontinuity at t0, it will be ignored. This makes it possible to repeatedly call GetNextDiscontinuity and step through the discontinuities.
t1 | [in] (t0 != t1) If there is a discontinuity at t1 is will be ingored unless c is a locus discontinuity type and t1 is at the start or end of the curve.
t | [out] if a discontinuity is found, then *t reports the parameter at the discontinuity.
hint | [in/out] if GetNextDiscontinuity will be called repeatedly, passing a "hint" with initial value *hint=0 will increase the speed of the search.
dtype | [out] if not nullptr, *dtype reports the kind of discontinuity found at *t. A value of 1 means the first derivative or unit tangent was discontinuous. A value of 2 means the second derivative or curvature was discontinuous. A value of 0 means teh curve is not closed, a locus discontinuity test was applied, and t1 is at the start of end of the curve. If 'c', the type of continuity to test for is ON::continuity::Gsmooth_continuous and the curvature changes from curved to 0 or 0 to curved and there is no tangency kink dtype is returns 3
cos_angle_tolerance | [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported.
curvature_tolerance | [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous. If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported.
Returns
Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
true if a parametric discontinuity was found strictly
between t0 and t1. Note well that all curves are
parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
true if a locus discontinuity was found strictly between
t0 and t1 or at t1 is the at the end of a curve.
Note well that all open curves (IsClosed()=false) are locus
discontinuous at the ends of their domains.  All closed
curves (IsClosed()=true) are at least C0_locus_continuous at
the ends of their domains.
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, and ON_PolyCurve.
◆ GetNurbForm()
 virtual int ON_Curve::GetNurbForm  |  ( |  ON_NurbsCurve &  |  nurbs_curve,
|  double  |  tolerance = 0.0,
|  const ON_Interval *  |  subdomain = nullptr
) |   |  const
virtual
Get a NURBS curve representation of this curve.
Parameters
nurbs_curve | [out] NURBS representation returned here
tolerance | [in] tolerance to use when creating NURBS representation.
subdomain | [in] if not nullptr, then the NURBS representation for this portion of the curve is returned.
Returns
0 unable to create NURBS representation with desired accuracy. 1 success - returned NURBS parameterization matches the curve's to wthe desired accuracy 2 success - returned NURBS point locus matches the curve's to the desired accuracy and the domain of the NURBS curve is correct. On However, This curve's parameterization and the NURBS curve parameterization may not match to the desired accuracy. This situation happens when getting NURBS representations of curves that have a transendental parameterization like circles
This is a low-level virtual function. If you do not need the parameterization information provided by the return code, then ON_Curve::NurbsCurve may be easier to use.
See also
ON_Curve::NurbsCurve
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_LineCurve, ON_ArcCurve, and ON_CurveOnSurface.
◆ GetNurbFormParameterFromCurveParameter()
 virtual bool ON_Curve::GetNurbFormParameterFromCurveParameter  |  ( |  double  |  curve_t,
|  double *  |  nurbs_t
) |   |  const
virtual
Convert a curve parameter to a NURBS curve parameter.
Parameters
curve_t | [in] curve parameter
nurbs_t | [out] nurbs form parameter
If GetNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.
See also
ON_Curve::GetNurbForm, ON_Curve::GetCurveParameterFromNurbFormParameter
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_LineCurve, and ON_ArcCurve.
◆ GetParameterTolerance()
 virtual bool ON_Curve::GetParameterTolerance  |  ( |  double  |  t,
|  double *  |  tminus,
|  double *  |  tplus
) |   |  const
virtual
Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic.
Returns
degree
Reimplemented in ON_NurbsCurve, ON_CurveProxy, and ON_CurveOnSurface.
◆ GetSpanVector()
 virtual bool ON_Curve::GetSpanVector  |  ( |  double *  |  knots | ) |   const
pure virtual
Get number of parameters of "knots".
Parameters
knots | [out] an array of length SpanCount()+1 is filled in with the parameters where the curve is not smooth (C-infinity).
Returns
true if successful
Implemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ GetSpanVectorIndex()
 virtual bool ON_Curve::GetSpanVectorIndex  |  ( |  double  |  t,
|  int  |  side,
|  int *  |  span_vector_index,
|  ON_Interval *  |  span_domain
) |   |  const
virtual
◆ GetTightBoundingBox()
 bool ON_Curve::GetTightBoundingBox  |  ( |  class ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const class ON_Xform *  |  xform = nullptr
) |   |  const
overridevirtual
virtual ON_Geometry GetTightBoundingBox override
Reimplemented from ON_Geometry.
Reimplemented in ON_PolyCurve, ON_PolylineCurve, and ON_LineCurve.
◆ HasNurbForm()
 virtual int ON_Curve::HasNurbForm  |  ( |   | ) |   const
virtual
Does a NURBS curve representation of this curve.
Returns
0 unable to create NURBS representation with desired accuracy. 1 success - NURBS parameterization matches the curve's to wthe desired accuracy 2 success - NURBS point locus matches the curve's and the domain of the NURBS curve is correct. However, This curve's parameterization and the NURBS curve parameterization may not match. This situation happens when getting NURBS representations of curves that have a transendental parameterization like circles
This is a low-level virtual function.
See also
ON_Curve::GetNurbForm, ON_Curve::NurbsCurve
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_LineCurve, and ON_ArcCurve.
◆ IsArc()
 virtual bool ON_Curve::IsArc  |  ( |  const ON_Plane *  |  plane = nullptr,
|  ON_Arc *  |  arc = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
virtual
Test a curve to see if the locus if its points is an arc or circle.
Parameters
plane | [in] if not nullptr, test is performed in this plane
arc | [out] if not nullptr and true is returned, then arc parameters are filled in
tolerance | [in] tolerance to use when checking
Returns
ON_Arc.m_angle > 0 if curve locus is an arc between specified points. If ON_Arc.m_angle is 2.0*ON_PI, then the curve is a circle.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ IsArcAt()
 bool ON_Curve::IsArcAt  |  ( |  double  |  t,
|  const ON_Plane *  |  plane = 0,
|  ON_Arc *  |  arc = 0,
|  double  |  tolerance = ON_ZERO_TOLERANCE,
|  double *  |  t0 = 0,
|  double *  |  t1 = 0
) |   |  const
Parameters
t | [in] curve parameter
plane | [in] if not nullptr, test is performed in this plane
arc | [out] if not nullptr and true is returned, then arc parameters are filled in
tolerance | [in] tolerance to use when checking
t0 | [out] if not nullptr, and then *t0 is set to the parameter at the start of the G2 curve segment that was tested.
t1 | [out] if not nullptr, and then *t0 is set to the parameter at the start of the G2 curve segment that was tested.
Returns
True if the paramter t is on a arc segment of the curve.
◆ IsClosable()
 bool ON_Curve::IsClosable  |  ( |  double  |  tolerance,
|  double  |  min_abs_size = 0.0,
|  double  |  min_rel_size = 10.0
) |   |  const
Decide if it makes sense to close off this curve by moving the endpoint to the start based on start-end gap size and length of curve as approximated by chord defined by 6 points.
Parameters
tolerance | [in] maximum allowable distance between start and end. if start - end gap is greater than tolerance, returns false
min_abs_size | [in] if greater than 0.0 and none of the interior sampled points are at least min_abs_size from start, returns false.
min_rel_size | [in] if greater than 1.0 and chord length is less than min_rel_size*gap, returns false.
Returns
true if start and end points are close enough based on above conditions.
◆ IsClosed()
 virtual bool ON_Curve::IsClosed  |  ( |   | ) |   const
virtual
Test a curve to see if it is closed.
Returns
true if the curve is closed.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_BrepEdge, ON_ArcCurve, ON_LineCurve, ON_PolyEdgeSegment, ON_CurveOnSurface, and ON_PolyEdgeCurve.
◆ IsContinuous()
 virtual bool ON_Curve::IsContinuous  |  ( |  ON::continuity  |  c,
|  double  |  t,
|  int *  |  hint = nullptr,
|  double  |  point_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d1_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d2_tolerance = ON_ZERO_TOLERANCE,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
virtual
Test continuity at a curve parameter value.
Parameters
c | [in] type of continuity to test for. Read ON::continuity comments for details.
t | [in] parameter to test
hint | [in] evaluation hint
point_tolerance | [in] if the distance between two points is greater than point_tolerance, then the curve is not C0.
d1_tolerance | [in] if the difference between two first derivatives is greater than d1_tolerance, then the curve is not C1.
d2_tolerance | [in] if the difference between two second derivatives is greater than d2_tolerance, then the curve is not C2.
cos_angle_tolerance | [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported.
curvature_tolerance | [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous or ON::continuity::Gsmooth_continuous. ON::continuity::G2_continuous: If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. ON::continuity::Gsmooth_continuous: If K0 and K1 are curvatures evaluated from above and below and the angle between K0 and K1 is at least twice angle tolerance or ||K0| - |K1|| > (max(|K0|,|K1|) > curvature_tolerance, then a curvature discontinuity is reported.
Returns
true if the curve has at least the c type continuity at the parameter t.
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, and ON_ArcCurve.
◆ IsEllipse()
 virtual bool ON_Curve::IsEllipse  |  ( |  const ON_Plane *  |  plane = nullptr,
|  ON_Ellipse *  |  ellipse = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
virtual
◆ IsInPlane()
 virtual bool ON_Curve::IsInPlane  |  ( |  const ON_Plane &  |  test_plane,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
pure virtual
Test a curve to see if it lies in a specific plane.
Parameters
test_plane | [in]
tolerance | [in] tolerance to use when checking
Returns
true if the maximum distance from the curve to the test_plane is <= tolerance.
Implemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ IsLinear()
 virtual bool ON_Curve::IsLinear  |  ( |  double  |  tolerance = ON_ZERO_TOLERANCE | ) |   const
virtual
Test a curve to see if the locus if its points is a line segment.
Parameters
tolerance | [in] // tolerance to use when checking linearity
Returns
true if the ends of the curve are farther than tolerance apart and the maximum distance from any point on the curve to the line segment connecting the curve's ends is <= tolerance.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ IsPeriodic()
 virtual bool ON_Curve::IsPeriodic  |  ( |   | ) |   const
virtual
Test a curve to see if it is periodic.
Returns
true if the curve is closed and at least C2 at the start/end.
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ IsPlanar()
 virtual bool ON_Curve::IsPlanar  |  ( |  ON_Plane *  |  plane = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
virtual
Test a curve to see if it is planar.
Parameters
plane | [out] if not nullptr and true is returned, the plane parameters are filled in.
tolerance | [in] tolerance to use when checking
Returns
true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ IsPolyline()
 virtual int ON_Curve::IsPolyline  |  ( |  ON_SimpleArray< ON_3dPoint > *  |  pline_points = nullptr,
|  ON_SimpleArray< double > *  |  pline_t = nullptr
) |   |  const
virtual
Several types of ON_Curve can have the form of a polyline including a degree 1 ON_NurbsCurve, an ON_PolylineCurve, and an ON_PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline.
Parameters
pline_points | [out] if not nullptr and true is returned, then the points of the polyline form are returned here.
t | [out] if not nullptr and true is returned, then the parameters of the polyline points are returned here.
Returns
table 0 curve is not some form of a polyline >=2 number of points in polyline form
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, and ON_LineCurve.
◆ LastSpanIsLinear() [1/2]
 bool ON_Curve::LastSpanIsLinear  |  ( |  double  |  min_length,
|  double  |  tolerance
) |   |  const
◆ LastSpanIsLinear() [2/2]
 bool ON_Curve::LastSpanIsLinear  |  ( |  double  |  min_length,
|  double  |  tolerance,
|  ON_Line *  |  span_line
) |   |  const
◆ NurbsCurve()
 ON_NurbsCurve* ON_Curve::NurbsCurve  |  ( |  ON_NurbsCurve *  |  pNurbsCurve = nullptr,
|  double  |  tolerance = 0.0,
|  const ON_Interval *  |  subdomain = nullptr
) |   |  const
Get a NURBS curve representation of this curve.
Parameters
pNurbsCurve | [in/out] if not nullptr, this ON_NurbsCurve will be used to store the NURBS representation of the curve will be returned.
tolerance | [in] tolerance to use when creating NURBS representation.
subdomain | [in] if not nullptr, then the NURBS representation for this portion of the curve is returned.
Returns
nullptr or a NURBS representation of the curve.
See ON_Surface::GetNurbForm for important details about the NURBS surface parameterization.
See also
ON_Curve::GetNurbForm
◆ ObjectType()
 ON::object_type ON_Curve::ObjectType  |  ( |   | ) |   const
overridevirtual
overrides virtual ON_Object::ObjectType.
Returns
ON::curve_object
Reimplemented from ON_Object.
◆ operator=()
 ON_Curve& ON_Curve::operator=  |  ( |  const ON_Curve &  |   | )
◆ ParameterSearch()
 bool ON_Curve::ParameterSearch  |  ( |  double  |  t,
|  int &  |  index,
|  bool  |  bEnableSnap,
|  const ON_SimpleArray< double > &  |  m_t,
|  double  |  RelTol = ON_SQRT_EPSILON
) |   |  const
protected
Lookup a parameter in the m_t array, optionally using a built in snap tolerance to snap a parameter value to an element of m_t. This function is used by some types derived from ON_Curve to snap parameter values
Parameters
t | [in] parameter
index | [out] index into m_t such that if function returns false then
value condition -1 t<m_t[0] or m_t is empty 0<=i<=m_t.Count()-2 m_t[i] < t < m_t[i+1] m_t.Count()-1 t>m_t[ m_t.Count()-1]
if the function returns true then t is equal to, or is closest to and within tolerance of m_t[index].
Parameters
bEnableSnap | [in] enable snapping
m_t | [in] Array of parameter values to snap to
RelTol | [in] tolerance used in snapping
Returns
true if the t is exactly equal to (bEnableSnap==false), or within tolerance of (bEnableSnap==true) m_t[index].
◆ PointAt()
 ON_3dPoint ON_Curve::PointAt  |  ( |  double  |  t | ) |   const
Evaluate point at a parameter.
Parameters
t | [in] evaluation parameter
Returns
Point (location of curve at the parameter t).
No error handling.
See also
ON_Curve::EvPoint, ON_Curve::PointAtStart, ON_Curve::PointAtEnd
◆ PointAtEnd()
 ON_3dPoint ON_Curve::PointAtEnd  |  ( |   | ) |   const
Evaluate point at the end of the curve.
Parameters
t | [in] evaluation parameter
Returns
Point (location of the end of the curve.)
No error handling.
See also
ON_Curve::PointAt
◆ PointAtStart()
 ON_3dPoint ON_Curve::PointAtStart  |  ( |   | ) |   const
Evaluate point at the start of the curve.
Parameters
t | [in] evaluation parameter
Returns
Point (location of the start of the curve.)
No error handling.
See also
ON_Curve::PointAt
◆ Reverse()
 virtual bool ON_Curve::Reverse  |  ( |   | )
pure virtual
Reverse the direction of the curve.
Returns
true if curve was reversed.
If reveresed, the domain changes from [a,b] to [-b,-a]
Implemented in ON_NurbsCurve, ON_BrepTrim, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_BrepEdge, ON_LineCurve, ON_ArcCurve, and ON_CurveOnSurface.
◆ SetDomain() [1/2]
 bool ON_Curve::SetDomain  |  ( |  ON_Interval  |  domain | )
Set the domain of the curve.
Parameters
domain | [in] increasing interval
Returns
true if successful.
◆ SetDomain() [2/2]
 virtual bool ON_Curve::SetDomain  |  ( |  double  |  t0,
|  double  |  t1
)
virtual
Set the domain of the curve
Parameters
t0 | [in]
t1 | [in] new domain will be [t0,t1]
Returns
true if successful.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolyCurve, ON_PolylineCurve, ON_ArcCurve, and ON_LineCurve.
◆ SetEndPoint()
 virtual bool ON_Curve::SetEndPoint  |  ( |  ON_3dPoint  |  end_point | )
virtual
Force the curve to end at a specified point.
Parameters
end_point | [in]
Returns
true if successful.
Some end points cannot be moved. Be sure to check return code. ON_Curve::SetEndPoint() returns true if end_point is the same as the end of the curve, false otherwise.
See also
ON_Curve::SetStartPoint, ON_Curve::PointAtStart, ON_Curve::PointAtEnd
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_PolyEdgeCurve.
◆ SetStartPoint()
 virtual bool ON_Curve::SetStartPoint  |  ( |  ON_3dPoint  |  start_point | )
virtual
Force the curve to start at a specified point.
Parameters
start_point | [in]
Returns
true if successful.
Some end points cannot be moved. Be sure to check return code. ON_Curve::SetStartPoint() returns true if start_point is the same as the start of the curve, false otherwise.
See also
ON_Curve::SetEndPoint, ON_Curve::PointAtStart, ON_Curve::PointAtEnd
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_PolyEdgeCurve.
◆ SizeOf()
 unsigned int ON_Curve::SizeOf  |  ( |   | ) |   const
overridevirtual
virtual ON_Object::SizeOf override
Reimplemented from ON_Object.
Reimplemented in ON_NurbsCurve, ON_PolyCurve, ON_CurveProxy, ON_CurveOnSurface, ON_PolylineCurve, and ON_LineCurve.
◆ SpanCount()
 virtual int ON_Curve::SpanCount  |  ( |   | ) |   const
pure virtual
Get number of nonempty smooth (c-infinity) spans in curve
Returns
Number of nonempty smooth (c-infinity) spans.
Implemented in ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ Split()
 virtual bool ON_Curve::Split  |  ( |  double  |  t,
|  ON_Curve *&  |  left_side,
|  ON_Curve *&  |  right_side
) |   |  const
virtual
Splits (divides) the curve at the specified parameter. The parameter must be in the interior of the curve's domain. The pointers passed to Split must either be nullptr or point to an ON_Curve object of the same type. If the pointer is nullptr, then a curve will be created in Split(). You may pass "this" as left_side or right_side.
Parameters
t | [in] parameter to split the curve at in the interval returned by Domain().
left_side | [out] left portion of curve returned here
right_side | [out] right portion of curve returned here
Returns
true - The curve was split into two pieces. false - The curve could not be split. For example if the parameter is too close to an endpoint.
For example, if crv were an ON_NurbsCurve, then
@verbatim
 ON_NurbsCurve right_side;
 crv.Split( crv.Domain().Mid() &crv, &right_side );
@endverbatim
would split crv at the parametric midpoint, put the left side
in crv, and return the right side in right_side.
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_ArcCurve, and ON_LineCurve.
◆ TangentAt()
 ON_3dVector ON_Curve::TangentAt  |  ( |  double  |  t | ) |   const
Evaluate unit tangent vector at a parameter.
Parameters
t | [in] evaluation parameter
Returns
Unit tangent vector of the curve at the parameter t.
No error handling.
See also
ON_Curve::EvTangent
◆ Transform()
 bool ON_Curve::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
overrides virtual ON_Geometry::Transform(). ON_Curve::Transform() calls ON_Geometry::Transform(xform), which calls ON_Object::TransformUserData(xform), and then calls this->DestroyCurveTree().
Parameters
xform | [in] transformation to apply to object.
Classes derived from ON_Curve should call ON_Curve::Transform() to handle user data transformations and curve tree destruction and then transform their definition.
Reimplemented from ON_Geometry.
Reimplemented in ON_NurbsCurve, ON_CurveProxy, ON_PolyCurve, ON_PolylineCurve, ON_CurveOnSurface, and ON_LineCurve.
◆ Trim()
 virtual bool ON_Curve::Trim  |  ( |  const ON_Interval &  |  domain | )
virtual
Removes portions of the curve outside the specified interval.
Parameters
domain | [in] interval of the curve to keep. Portions of the curve before curve(domain[0]) and after curve(domain[1]) are removed.
Returns
true if successful.
Reimplemented in ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, and ON_LineCurve.