Public Member Functions | List of all members
ON_BrepVertexArray Class Reference
#include <opennurbs_brep.h>
 Inheritance diagram for ON_BrepVertexArray:
 Public Member Functions
ON_BrepVertexArray ()
~ON_BrepVertexArray ()
bool  | Read (ON_BinaryArchive &)
unsigned int  | SizeOf () const
bool  | Write (ON_BinaryArchive &) const
 Public Member Functions inherited from ON_ObjectArray< ON_BrepVertex >
ON_ObjectArray ()
Class ON_ObjectArray<> More...
ON_ObjectArray (size_t)
ON_ObjectArray (const ON_ObjectArray< ON_BrepVertex > &)
~ON_ObjectArray ()
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
bool  | HeapSort (int(*)(const ON_BrepVertex *, const ON_BrepVertex *))
ON_ObjectArray< ON_BrepVertex > &  | operator= (const ON_ObjectArray< ON_BrepVertex > &)
bool  | QuickSort (int(*)(const ON_BrepVertex *, const ON_BrepVertex *))
Sorts the array using the heap sort algorithm. More...
ON_BrepVertex *  | Realloc (ON_BrepVertex *, int)
low level memory managment /////////////////////////////////////// More...
 Public Member Functions inherited from ON_ClassArray< ON_BrepVertex >
ON_ClassArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_ClassArray (size_t)
ON_ClassArray (const ON_ClassArray< ON_BrepVertex > &)
Copy constructor. More...
virtual  | ~ON_ClassArray ()
void  | Append (const ON_BrepVertex &)
void  | Append (int, const ON_BrepVertex *)
ON_BrepVertex &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_BrepVertex *  | Array ()
const ON_BrepVertex *  | Array () const
ON_BrepVertex *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
ON_BrepVertex *  | At (unsigned int)
ON_BrepVertex *  | At (ON__INT64)
ON_BrepVertex *  | At (ON__UINT64)
const ON_BrepVertex *  | At (int) const
const ON_BrepVertex *  | At (unsigned int) const
const ON_BrepVertex *  | At (ON__INT64) const
const ON_BrepVertex *  | At (ON__UINT64) const
int  | BinarySearch (const ON_BrepVertex *, int(*)(const ON_BrepVertex *, const ON_BrepVertex *)) const
int  | BinarySearch (const ON_BrepVertex *, int(*)(const ON_BrepVertex *, const ON_BrepVertex *), int) const
int  | Capacity () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
void  | Destroy ()
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Empty ()
ON_BrepVertex *  | First ()
const ON_BrepVertex *  | First () const
void  | Insert (int, const ON_BrepVertex &)
Insert called with a reference uses operator =. More...
ON_BrepVertex *  | KeepArray ()
ON_BrepVertex *  | Last ()
const ON_BrepVertex *  | Last () const
int  | NewCapacity () const
operator const ON_BrepVertex * () const
operator ON_BrepVertex * ()
ON_ClassArray< ON_BrepVertex > &  | operator= (const ON_ClassArray< ON_BrepVertex > &)
Assignment operator. More...
ON_BrepVertex &  | operator[] (int)
ON_BrepVertex &  | operator[] (unsigned int)
ON_BrepVertex &  | operator[] (ON__INT64)
ON_BrepVertex &  | operator[] (ON__UINT64)
const ON_BrepVertex &  | operator[] (int) const
const ON_BrepVertex &  | operator[] (unsigned int) const
const ON_BrepVertex &  | operator[] (ON__INT64) const
const ON_BrepVertex &  | operator[] (ON__UINT64) const
bool  | Permute (const int *)
void  | Remove ()
void  | Remove (int)
ON_BrepVertex *  | Reserve (size_t)
memory managment ///////////////////////////////////////////////// More...
void  | Reverse ()
int  | Search (const ON_BrepVertex *, int(*)(const ON_BrepVertex *, const ON_BrepVertex *)) const
void  | SetArray (ON_BrepVertex *)
Do not use this version of SetArray(). Use the one that takes a pointer, count and capacity: SetArray(pointer,count,capacity) More...
void  | SetArray (ON_BrepVertex *, int, int)
Expert user tool to set the memory used by the dyanmic array. More...
ON_BrepVertex *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory managment ////////////////////////////////////////// More...
void  | Shrink ()
unsigned int  | SizeOfArray () const
unsigned int  | SizeOfElement () const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_BrepVertex *, const ON_BrepVertex *)) const
Sort() fills in the index[] array so that array[index[i]] <= array[index[i+1]]. The array is not modified. More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_BrepVertex *, const ON_BrepVertex *, void *), void *) const
Sort() fills in the index[] array so that array[index[i]] <= array[index[i+1]]. The array is not modified. More...
void  | Swap (int, int)
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_ClassArray< ON_BrepVertex >
void  | ConstructDefaultElement (ON_BrepVertex *)
void  | DestroyElement (ON_BrepVertex &)
void  | Move (int, int, int)
implimentation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_ClassArray< ON_BrepVertex >
ON_BrepVertex *  | m_a
int  | m_capacity
int  | m_count
Constructor & Destructor Documentation
◆ ON_BrepVertexArray()
 ON_BrepVertexArray::ON_BrepVertexArray  |  ( |   | )
◆ ~ON_BrepVertexArray()
 ON_BrepVertexArray::~ON_BrepVertexArray  |  ( |   | )
Member Function Documentation
◆ Read()
 bool ON_BrepVertexArray::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ SizeOf()
 unsigned int ON_BrepVertexArray::SizeOf  |  ( |   | ) |   const
◆ Write()
 bool ON_BrepVertexArray::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const