openNURBS SDK Help 6.0
 Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ON_NurbsCurve Class Reference
#include <opennurbs_nurbscurve.h>
 Inheritance diagram for ON_NurbsCurve:
 Public Member Functions
ON_NurbsCurve () ON_NOEXCEPT
ON_NurbsCurve (const ON_NurbsCurve &)
ON_NurbsCurve (const ON_BezierCurve &bezier_curve)
Create a NURBS curve equal to bezier with domain [0,1]. More...
ON_NurbsCurve (int dimension, bool bIsRational, int order, int cv_count)
Create a NURBS curve with knot a cv memory allocated. More...
virtual  | ~ON_NurbsCurve ()
bool  | Append (const ON_NurbsCurve &)
bool  | ChangeClosedCurveSeam (double t) override
If this curve is closed, then modify it so that the start/end point is at curve parameter t. More...
bool  | ChangeDimension (int desired_dimension) override
Change the dimension of a curve. More...
bool  | ChangeEndWeights (double w0, double w1)
Use a combination of scaling and reparameterization to change the end weights to the specified values. More...
bool  | ClampEnd (int end)
Clamp end knots. Does not modify control points. More...
const ON_4dPoint  | ControlPoint (int cv_index) const
double  | ControlPolygonLength () const
returns the length of the control polygon More...
bool  | ConvertSpanToBezier (int, ON_BezierCurve &) const
bool  | Create (int dimension, bool bIsRational, int order, int cv_count)
Create a NURBS curve with knot a cv memory allocated. More...
bool  | CreateClampedUniformNurbs (int dimension, int order, int point_count, const ON_3dPoint *point, double knot_delta=1.0)
Create a clamped uniform NURBS curve from a list of control points More...
bool  | CreatePeriodicUniformNurbs (int dimension, int order, int point_count, const ON_3dPoint *point, double knot_delta=1.0)
Create a periodic uniform NURBS curve from a list of control points More...
double *  | CV (int cv_index) const
Expert user function to get a pointer to control vertex memory. If you are not an expert user, please use ON_NurbsCurve::GetCV( ON_3dPoint& ) or ON_NurbsCurve::GetCV( ON_4dPoint& ). More...
int  | CVCount (void) const
int  | CVSize (void) const
ON::point_style  | CVStyle () const
Returns the style of control vertices in the m_cv array. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree () const override
virtual ON_Curve::Degree override. More...
void  | Destroy ()
Deallocate knot and cv memory. Zeros all fields. More...
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain () const override
ON_Curve overrides. More...
void  | Dump (ON_TextLog &dump) const override
virtual ON_Object::Dump override More...
void  | EmergencyDestroy ()
Call if memory used by ON_NurbsCurve becomes invalid. More...
bool  | Evaluate (double, int, int, double *, int=0, int *=0) const override
virtual ON_Curve::Evaluate override. More...
bool  | Extend (const ON_Interval &domain) override
Where possible, analytically extends curve to include domain. More...
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
bool  | GetCurveParameterFromNurbFormParameter (double nurbs_t, double *curve_t) const override
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override More...
bool  | GetCV (int, ON::point_style, double *) const
bool  | GetCV (int, ON_3dPoint &) const
bool  | GetCV (int, ON_4dPoint &) const
bool  | GetGrevilleAbcissae (double *) const
bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
Search for a derivatitive, tangent, or curvature discontinuity. More...
int  | GetNurbForm (ON_NurbsCurve &nurbsform, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const override
virtual ON_Curve::GetNurbForm override. More...
bool  | GetNurbFormParameterFromCurveParameter (double curve_t, double *nurbs_t) const override
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override More...
bool  | GetParameterTolerance (double t, double *tminus, double *tplus) const override
virtual ON_Curve::GetParameterTolerance override. More...
bool  | GetSpanVector (double *knot_values) const override
virtual ON_Curve::GetSpanVector override. Get number of parameters of distinct knots in NURBS curve's domain. More...
double  | GrevilleAbcissa (int) const
bool  | HasBezierSpans () const
int  | HasNurbForm () const override
virtual ON_Curve::HasNurbForm override. More...
bool  | IncreaseDegree (int desired_degree)
void  | Initialize (void)
Zeros all fields. More...
bool  | InsertKnot (double knot_value, int knot_multiplicity)
Insert a knot and update cv locations. More...
bool  | IsArc (const ON_Plane *plane=nullptr, ON_Arc *arc=nullptr, double tolerance=ON_ZERO_TOLERANCE) const override
virtual ON_Curve::IsArc override. More...
bool  | IsClamped (int=2) const
bool  | IsClosed () const override
virtual ON_Curve::IsClosed override. More...
bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
Test continuity at a curve parameter value. More...
bool  | IsDeformable () const override
virtual ON_Geometry::IsDeformable() override More...
bool  | IsDuplicate (const ON_NurbsCurve &other, bool bIgnoreParameterization, double tolerance=ON_ZERO_TOLERANCE) const
See if this and other are same NURBS geometry. More...
bool  | IsInPlane (const ON_Plane &test_plane, double tolerance=ON_ZERO_TOLERANCE) const override
virtual ON_Curve::IsInPlane override. More...
bool  | IsLinear (double tolerance=ON_ZERO_TOLERANCE) const override
virtual ON_Curve::IsLinear override. More...
bool  | IsPeriodic () const override
virtual ON_Curve::IsPeriodic override. More...
bool  | IsPlanar (ON_Plane *plane=nullptr, double tolerance=ON_ZERO_TOLERANCE) const override
virtual ON_Curve::IsPlanar override. More...
int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const override
Several types of ON_Curve can have the form of a polyline including a degree 1 ON_NurbsCurve, an ON_PolylineCurve, and an ON_PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline. More...
bool  | IsRational (void) const
Interface. More...
bool  | IsSingular () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_Object overrides. More...
double  | Knot (int knot_index) const
Get knot value. More...
const double *  | Knot () const
Get pointer to knot vector array. More...
int  | KnotCount (void) const
int  | KnotMultiplicity (int knot_index) const
Get knot multiplicity. More...
bool  | MakeClampedUniformKnotVector (double delta=1.0)
Make knot vector a clamped uniform knot vector based on the current values of m_order and m_cv_count. Does not change values of control vertices. More...
bool  | MakeDeformable () override
virtual ON_Geometry::MakeDeformable() override More...
bool  | MakeNonRational ()
bool  | MakePeriodicUniformKnotVector (double delta=1.0)
Make knot vector a periodic uniform knot vector based on the current values of m_order and m_cv_count. Does not change values of control vertices. More...
bool  | MakePiecewiseBezier (bool bSetEndWeightsToOne=false)
Clamps ends and adds knots so the NURBS curve has bezier spans (all distinct knots have multiplitity = degree). Paremeters: bSetEndWeightsToOne - [in] If true and the first or last weight is not one, then the first and last spans are reparameterized so that the end weights are one. More...
bool  | MakeRational ()
ON_NurbsCurve &  | operator= (const ON_NurbsCurve &src)
ON_NurbsCurve &  | operator= (const ON_BezierCurve &bezier_curve)
Set NURBS curve equal to bezier with domain [0,1]. More...
int  | Order (void) const
bool  | Read (ON_BinaryArchive &binary_archive) override
virtual ON_Object::Read override More...
int  | RemoveSingularSpans ()
bool  | RemoveSpan (int span_index)
bool  | RepairBadKnots (double knot_tolerance=0.0, bool bRepair=true)
Looks for problems caused by knots that are close together or have mulitplicity >= order. If bRepair is true, the problems are fixed. Does not change the domain. More...
bool  | Reparameterize (double c)
Use a linear fractional transformation to reparameterize the NURBS curve. This does not change the curve's domain. More...
bool  | ReserveCVCapacity (int)
Tools for managing CV and knot memory. More...
bool  | ReserveKnotCapacity (int)
bool  | Reverse () override
virtual ON_Curve::Reverse override. Reverse parameterizatrion by negating all knots and reversing the order of the control vertices. More...
bool  | SetCV (int, ON::point_style, const double *)
bool  | SetCV (int, const ON_3dPoint &)
bool  | SetCV (int, const ON_4dPoint &)
bool  | SetDomain (double t0, double t1) override
virtual ON_Curve::SetDomain override. Set the domain of the curve More...
bool  | SetEndPoint (ON_3dPoint end_point) override
Force the curve to end at a specified point. More...
bool  | SetKnot (int knot_index, double knot_value)
Set knot value. More...
bool  | SetStartPoint (ON_3dPoint start_point) override
Force the curve to start at a specified point. More...
bool  | SetWeight (int, double)
Set value of control vertex weight. If curve is non-rational, it will be converted to rational. More...
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
int  | SpanCount () const override
virtual ON_Curve::SpanCount override. Get number of nonempty smooth (c-infinity) spans in curve More...
bool  | SpanIsLinear (int span_index, double min_length, double tolerance) const
bool  | SpanIsLinear (int span_index, double min_length, double tolerance, ON_Line *line) const
bool  | SpanIsSingular (int span_index) const
bool  | Split (double split_param, ON_Curve *&left_result, ON_Curve *&right_result) const override
virtual ON_Curve::Split override. More...
double  | SuperfluousKnot (int) const
bool  | SwapCoordinates (int i, int j) override
virtual ON_Geometry::SwapCoordinates override. Swaps control vertex coordinate values with indices i and j. More...
bool  | Transform (const ON_Xform &xform) override
virtual ON_Geometry::Transform override. Transforms the NURBS curve. More...
bool  | Trim (const ON_Interval &) override
virtual ON_Curve::Trim override. More...
double  | Weight (int) const
bool  | Write (ON_BinaryArchive &binary_archive) const override
virtual ON_Object::Write override More...
bool  | ZeroCVs ()
 Public Member Functions inherited from ON_Curve
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
ON_3dVector  | CurvatureAt (double t) const
Evaluate the curvature vector at a parameter. More...
ON_3dVector  | DerivativeAt (double t) const
Evaluate first derivative at a parameter. More...
void  | DestroyCurveTree ()
Destroys the runtime curve tree used to speed closest point and intersection calcuations. More...
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
virtual ON_Curve *  | DuplicateCurve () const
Get a duplicate of the curve. More...
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
Evaluate first derivative at a parameter with error checking. More...
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
Evaluate second derivative at a parameter with error checking. More...
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
Evaluate unit tangent and curvature at a parameter with error checking. More...
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
Evaluate point at a parameter with error checking. More...
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
Evaluate unit tangent at a parameter with error checking. More...
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
Return a 3d frame at a parameter. More...
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override More...
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
Decide if it makes sense to close off this curve by moving the endpoint to the start based on start-end gap size and length of curve as approximated by chord defined by 6 points. More...
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
Get a NURBS curve representation of this curve. More...
ON::object_type  | ObjectType () const override
overrides virtual ON_Object::ObjectType. More...
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
Evaluate point at a parameter. More...
ON_3dPoint  | PointAtEnd () const
Evaluate point at the end of the curve. More...
ON_3dPoint  | PointAtStart () const
Evaluate point at the start of the curve. More...
bool  | SetDomain (ON_Interval domain)
Set the domain of the curve. More...
ON_3dVector  | TangentAt (double t) const
Evaluate unit tangent vector at a parameter. More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
Get object's 3d axis aligned bounding box. More...
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
If possible, BrepForm() creates a brep form of the ON_Geometry. More...
virtual void  | ClearBoundingBox ()
Some objects cache bounding box information. If you modify an object, then call ClearBoundingBox() to inform the object that any cached bounding boxes are invalid. More...
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
If this piece of geometry is a component in something larger, like an ON_BrepEdge in an ON_Brep, then this function returns the component index. More...
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
Get object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
Get corners of object's 3d axis aligned bounding box or the union of the input box with the object's bounding box. More...
virtual bool  | HasBrepForm () const
Query an object to see if it has an ON_Brep form. Result: Returns true if the virtual ON_Geometry::BrepForm can compute an ON_Brep representation of this object. More...
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule). More...
bool  | Scale (double scale_factor)
Scales the object by the specified facotor. The scale is centered at the origin. More...
bool  | Translate (const ON_3dVector &translation_vector)
Translates the object along the specified vector. More...
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
bool  | AttachUserData (class ON_UserData *pUserData)
Attach user data to an object. More...
unsigned int  | ClearAllComponentStates () const
Set all active level component states to ON_ComponentStatus::NoneSet. More...
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
Clear the specified states on every component. More...
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
Clear states on an individual component. More...
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
Expert user tool that copies user data items with positive values of ON_UserData.m_userdata_copycount from source_object to "this. More...
void  | CopyUserData (const ON_Object &source_object)
Calls CopyUserData(source_object,ON_Object::UserDataConflictResolution::source_object). More...
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
Delete the portions of the object identified in ci_list[]. More...
bool  | DetachUserData (class ON_UserData *pUserData)
Remove user data from an object. More...
void  | EmergencyDestroy ()
Sets m_user_data_list = 0. More...
class ON_UserData *  | FirstUserData () const
User data is stored as a linked list of ON_UserData classes. FirstUserData gets the first item in the linked list. This is the most recent item attached using AttachUserData(). Remark: To iterate through all the user data on an object, call FirstUserData() and then use ON_UserData::Next() to traverse the list. More...
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
Get a pointer to user data. More...
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
Get user string from the object. More...
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
Get a list of all user string keys on the object. More...
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
Get a list of all user strings on the object. More...
bool  | IsKindOf (const ON_ClassId *pClassId) const
Low level tool to test if an object is derived from a specified class. More...
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
virtual void  | MemoryRelocate ()
The MemoryRelocate() function is called when an object's location in memory is changed. For example, if an object resides in a chunk of memory that is grown by calling a realloc that has to allocate a new chunk and copy the contents of the old chunk to the new chunk, then the location of the object's memory changes. In practice this happens when classes derived from ON_Object are stored in dynamic arrays, like the default implementation of ON_ObjectArray<>'s that use realloc to grow the dynamic array. More...
virtual ON_UUID  | ModelObjectId () const
All objects in an opennurbs model have an id ( ON_Layer.m_layer_id, ON_Font.m_font_id, ON_Material.m_material_id, ON_3dmObjectAttributes.m_uuid ). More...
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
Expert user tool that moves user data items from source_object to "this. More...
void  | MoveUserData (ON_Object &source_object)
Calls MoveUserData(source_object,ON_Object::UserDataConflictResolution::source_object,true). More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
PurgeUserData() removes all user data from object. More...
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
Set states on an individual component. More...
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
Copy status settings to an individual component. More...
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
Attach a user string to the object. This information will perisist through copy construction, operator=, and file IO. More...
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
Append entries to the user string list More...
void  | TransformUserData (const class ON_Xform &xform)
Objects derived from ON_Geometry must call TransformUserData() in their Transform() member function. More...
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. More...
int  | UserStringCount () const
 Static Public Member Functions
static ON_NurbsCurve *  | New ()
Use ON_NurbsCurve::New(...) instead of new ON_NurbsCurve(...) More...
static ON_NurbsCurve *  | New (const ON_NurbsCurve &nurbs_curve)
static ON_NurbsCurve *  | New (const ON_BezierCurve &bezier_curve)
static ON_NurbsCurve *  | New (int dimension, bool bIsRational, int order, int cv_count)
 Public Attributes
double *  | m_cv
int  | m_cv_capacity
int  | m_cv_count
int  | m_cv_stride
control vertex net memory More...
int  | m_dim
Implementation. More...
int  | m_is_rat
double *  | m_knot
int  | m_knot_capacity
knot vector memory More...
int  | m_order
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
When a userdata item is copied or moved from a source object to a destination object, the ON_Object::UserDataConflictResolution enum values specify how conficts are resolved. Remark: A userdata item "conflict" occurs when both the destination and source object have a user data item with the same value of ON_UserData::m_userdata_uuid. More...
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
 Protected Member Functions inherited from ON_Curve
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
Lookup a parameter in the m_t array, optionally using a built in snap tolerance to snap a parameter value to an element of m_t. This function is used by some types derived from ON_Curve to snap parameter values More...
Constructor & Destructor Documentation
◆ ON_NurbsCurve() [1/4]
 ON_NurbsCurve::ON_NurbsCurve  |  ( |   | )
◆ ~ON_NurbsCurve()
 virtual ON_NurbsCurve::~ON_NurbsCurve  |  ( |   | )
virtual
◆ ON_NurbsCurve() [2/4]
 ON_NurbsCurve::ON_NurbsCurve  |  ( |  const ON_NurbsCurve &  |   | )
◆ ON_NurbsCurve() [3/4]
 ON_NurbsCurve::ON_NurbsCurve  |  ( |  const ON_BezierCurve &  |  bezier_curve | )
Create a NURBS curve equal to bezier with domain [0,1].
Parameters
bezier_curve | [in]
◆ ON_NurbsCurve() [4/4]
 ON_NurbsCurve::ON_NurbsCurve  |  ( |  int  |  dimension,
|  bool  |  bIsRational,
|  int  |  order,
|  int  |  cv_count
)
Create a NURBS curve with knot a cv memory allocated.
Parameters
dimension | [in] (>= 1)
bIsRational | [in] true to make a rational NURBS
order | [in] (>= 2) The order=degree+1
cv_count | [in] (>= order) number of control vertices
Member Function Documentation
◆ Append()
 bool ON_NurbsCurve::Append  |  ( |  const ON_NurbsCurve &  |   | )
◆ ChangeClosedCurveSeam()
 bool ON_NurbsCurve::ChangeClosedCurveSeam  |  ( |  double  |  t | )
overridevirtual
If this curve is closed, then modify it so that the start/end point is at curve parameter t.
Parameters
t | [in] curve parameter of new start/end point. The returned curves domain will start at t.
Returns
true if successful.
Overrides virtual ON_Curve::ChangeClosedCurveSeam
Reimplemented from ON_Curve.
◆ ChangeDimension()
 bool ON_NurbsCurve::ChangeDimension  |  ( |  int  |  desired_dimension | )
overridevirtual
Change the dimension of a curve.
Parameters
desired_dimension | [in]
Returns
true if the curve's dimension was already desired_dimension or if the curve's dimension was successfully changed to desired_dimension.
Reimplemented from ON_Curve.
◆ ChangeEndWeights()
 bool ON_NurbsCurve::ChangeEndWeights  |  ( |  double  |  w0,
|  double  |  w1
)
Use a combination of scaling and reparameterization to change the end weights to the specified values.
Parameters
w0 | [in] weight for first cv
w1 | [in] weight for last cv
Returns
true if successful.
The domain, eucleanean locations of the control points, and locus of the curve do not change, but the weights, homogeneous cv values and internal knot values may change. If w0 and w1 are 1 and the curve is not rational, the curve is not changed.
See also
ON_ChangeRationalNurbsCurveEndWeights
◆ ClampEnd()
 bool ON_NurbsCurve::ClampEnd  |  ( |  int  |  end | )
Clamp end knots. Does not modify control points.
Parameters
end | [in] 0 = clamp start, 1 = clamp end, 2 = clamp start and end
Returns
true if successful
◆ ControlPoint()
 const ON_4dPoint ON_NurbsCurve::ControlPoint  |  ( |  int  |  cv_index | ) |   const
Parameters
cv_index | [in] zero based control point index
Returns
Control point as an ON_4dPoint.
If cv_index or the nurbs curve is not valid, then ON_4dPoint::Nan is returned. If dim < 3, unused coordinates are zero. If dim >= 4, the first three coordinates are returned. If is_rat is false, the weight is 1.
◆ ControlPolygonLength()
 double ON_NurbsCurve::ControlPolygonLength  |  ( |   | ) |   const
returns the length of the control polygon
◆ ConvertSpanToBezier()
 bool ON_NurbsCurve::ConvertSpanToBezier  |  ( |  int  |  ,
|  ON_BezierCurve &
) |   |  const
◆ Create()
 bool ON_NurbsCurve::Create  |  ( |  int  |  dimension,
|  bool  |  bIsRational,
|  int  |  order,
|  int  |  cv_count
)
Create a NURBS curve with knot a cv memory allocated.
Parameters
dimension | [in] (>= 1)
bIsRational | [in] true to make a rational NURBS
order | [in] (>= 2) The order=degree+1
cv_count | [in] (>= order) number of control vertices
◆ CreateClampedUniformNurbs()
 bool ON_NurbsCurve::CreateClampedUniformNurbs  |  ( |  int  |  dimension,
|  int  |  order,
|  int  |  point_count,
|  const ON_3dPoint *  |  point,
|  double  |  knot_delta = 1.0
)
Create a clamped uniform NURBS curve from a list of control points
Parameters
dimension | [in] 1, 2 or 3
order | [in] (>=2) order=degree+1
point_count | [in] (>=order) number of control vertices
point | [in] array of control vertex locations.
knot_delta | in knot spacing
Returns
true if successful
◆ CreatePeriodicUniformNurbs()
 bool ON_NurbsCurve::CreatePeriodicUniformNurbs  |  ( |  int  |  dimension,
|  int  |  order,
|  int  |  point_count,
|  const ON_3dPoint *  |  point,
|  double  |  knot_delta = 1.0
)
Create a periodic uniform NURBS curve from a list of control points
Parameters
dimension | [in] 1, 2 or 3
order | [in] (>=2) order=degree+1
point_count | [in] (>=max(3,order-1)) number of distinct control vertices
point | [in] array of distinct control vertex locations.
knot_delta | in knot spacing
Returns
true if successful
◆ CV()
 double* ON_NurbsCurve::CV  |  ( |  int  |  cv_index | ) |   const
Expert user function to get a pointer to control vertex memory. If you are not an expert user, please use ON_NurbsCurve::GetCV( ON_3dPoint& ) or ON_NurbsCurve::GetCV( ON_4dPoint& ).
Parameters
cv_index | [in]
Returns
Pointer to control vertex.
If the NURBS curve is rational, the format of the returned array is a homogeneos rational point with length m_dim+1. If the NURBS curve is not rational, the format of the returned array is a nonrational euclidean point with length m_dim. See Also ON_NurbsCurve::CVStyle ON_NurbsCurve::GetCV ON_NurbsCurve::Weight
◆ CVCount()
 int ON_NurbsCurve::CVCount  |  ( |  void  |   | ) |   const
◆ CVSize()
 int ON_NurbsCurve::CVSize  |  ( |  void  |   | ) |   const
◆ CVStyle()
 ON::point_style ON_NurbsCurve::CVStyle  |  ( |   | ) |   const
Returns the style of control vertices in the m_cv array.
Returns
table ON::not_rational m_is_rat is false ON::homogeneous_rational m_is_rat is true
◆ DataCRC()
 ON__UINT32 ON_NurbsCurve::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
virtual ON_Object::DataCRC override
Reimplemented from ON_Object.
◆ Degree()
 int ON_NurbsCurve::Degree  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::Degree override.
Returns
m_order-1
Implements ON_Curve.
◆ Destroy()
 void ON_NurbsCurve::Destroy  |  ( |   | )
Deallocate knot and cv memory. Zeros all fields.
◆ Dimension()
 int ON_NurbsCurve::Dimension  |  ( |   | ) |   const
overridevirtual
ON_Geometry overrides.
virtual ON_Geometry::Dimension override
Returns
value of m_dim
Reimplemented from ON_Geometry.
◆ Domain()
 ON_Interval ON_NurbsCurve::Domain  |  ( |   | ) |   const
overridevirtual
ON_Curve overrides.
virtual ON_Curve::Domain override.
Returns
domain of the NURBS curve.
Implements ON_Curve.
◆ Dump()
 void ON_NurbsCurve::Dump  |  ( |  ON_TextLog &  |  dump | ) |   const
overridevirtual
virtual ON_Object::Dump override
Reimplemented from ON_Object.
◆ EmergencyDestroy()
 void ON_NurbsCurve::EmergencyDestroy  |  ( |   | )
Call if memory used by ON_NurbsCurve becomes invalid.
◆ Evaluate()
 bool ON_NurbsCurve::Evaluate  |  ( |  double  |  ,
|  int  |  ,
|  int  |  ,
|  double *  |  ,
|  int  |   = 0,
|  int *  |   = 0
) |   |  const
overridevirtual
virtual ON_Curve::Evaluate override.
Implements ON_Curve.
◆ Extend()
 bool ON_NurbsCurve::Extend  |  ( |  const ON_Interval &  |  domain | )
overridevirtual
Where possible, analytically extends curve to include domain.
Parameters
domain | [in] if domain is not included in curve domain, curve will be extended so that its domain includes domain. Will not work if curve is closed. Original curve is identical to the restriction of the resulting curve to the original curve domain,
Returns
true if successful.
Reimplemented from ON_Curve.
◆ GetBBox()
 bool ON_NurbsCurve::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
virtual ON_Geometry GetBBox override
Reimplemented from ON_Geometry.
◆ GetCurveParameterFromNurbFormParameter()
 bool ON_NurbsCurve::GetCurveParameterFromNurbFormParameter  |  ( |  double  |  nurbs_t,
|  double *  |  curve_t
) |   |  const
overridevirtual
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override
Reimplemented from ON_Curve.
◆ GetCV() [1/3]
 bool ON_NurbsCurve::GetCV  |  ( |  int  |  ,
|  ON::point_style  |  ,
|  double *
) |   |  const
◆ GetCV() [2/3]
 bool ON_NurbsCurve::GetCV  |  ( |  int  |  ,
|  ON_3dPoint &
) |   |  const
◆ GetCV() [3/3]
 bool ON_NurbsCurve::GetCV  |  ( |  int  |  ,
|  ON_4dPoint &
) |   |  const
◆ GetGrevilleAbcissae()
 bool ON_NurbsCurve::GetGrevilleAbcissae  |  ( |  double *  |   | ) |   const
◆ GetNextDiscontinuity()
 bool ON_NurbsCurve::GetNextDiscontinuity  |  ( |  ON::continuity  |  c,
|  double  |  t0,
|  double  |  t1,
|  double *  |  t,
|  int *  |  hint = nullptr,
|  int *  |  dtype = nullptr,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Search for a derivatitive, tangent, or curvature discontinuity.
Parameters
c | [in] type of continity to test for. If ON::continuity::C1_continuous
t0 | [in] search begins at t0
t1 | [in] (t0 < t1) search ends at t1
t | [out] if a discontinuity is found, the *t reports the parameter at the discontinuity.
hint | [in/out] if GetNextDiscontinuity will be called repeatedly, passing a "hint" with initial value *hint=0 will increase the speed of the search.
dtype | [out] if not nullptr, *dtype reports the kind of discontinuity found at *t. A value of 1 means the first derivative or unit tangent was discontinuous. A value of 2 means the second derivative or curvature was discontinuous.
cos_angle_tolerance | [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported.
curvature_tolerance | [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous or ON::continuity::Gsmooth_continuous. ON::continuity::G2_continuous: If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. ON::continuity::Gsmooth_continuous: If K0 and K1 are curvatures evaluated from above and below and the angle between K0 and K1 is at least twice angle tolerance or ||K0| - |K1|| > (max(|K0|,|K1|) > curvature_tolerance, then a curvature discontinuity is reported.
Returns
true if a discontinuity was found on the interior of the interval (t0,t1).
Overrides ON_Curve::GetNextDiscontinuity.
Reimplemented from ON_Curve.
◆ GetNurbForm()
 int ON_NurbsCurve::GetNurbForm  |  ( |  ON_NurbsCurve &  |  nurbsform,
|  double  |  tolerance = 0.0,
|  const ON_Interval *  |  subdomain = nullptr
) |   |  const
overridevirtual
virtual ON_Curve::GetNurbForm override.
Reimplemented from ON_Curve.
◆ GetNurbFormParameterFromCurveParameter()
 bool ON_NurbsCurve::GetNurbFormParameterFromCurveParameter  |  ( |  double  |  curve_t,
|  double *  |  nurbs_t
) |   |  const
overridevirtual
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override
Reimplemented from ON_Curve.
◆ GetParameterTolerance()
 bool ON_NurbsCurve::GetParameterTolerance  |  ( |  double  |  t,
|  double *  |  tminus,
|  double *  |  tplus
) |   |  const
overridevirtual
virtual ON_Curve::GetParameterTolerance override.
Reimplemented from ON_Curve.
◆ GetSpanVector()
 bool ON_NurbsCurve::GetSpanVector  |  ( |  double *  |  knot_values | ) |   const
overridevirtual
virtual ON_Curve::GetSpanVector override. Get number of parameters of distinct knots in NURBS curve's domain.
Parameters
knot_values | [out] an array of length SpanCount()+1 is filled in with the distinct knot values in the list
(m_knot[m_order-2],...,m_knot[m_cv_count-1)
Returns
true if successful
Implements ON_Curve.
◆ GrevilleAbcissa()
 double ON_NurbsCurve::GrevilleAbcissa  |  ( |  int  |   | ) |   const
◆ HasBezierSpans()
 bool ON_NurbsCurve::HasBezierSpans  |  ( |   | ) |   const
◆ HasNurbForm()
 int ON_NurbsCurve::HasNurbForm  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::HasNurbForm override.
Reimplemented from ON_Curve.
◆ IncreaseDegree()
 bool ON_NurbsCurve::IncreaseDegree  |  ( |  int  |  desired_degree | )
◆ Initialize()
 void ON_NurbsCurve::Initialize  |  ( |  void  |   | )
Zeros all fields.
◆ InsertKnot()
 bool ON_NurbsCurve::InsertKnot  |  ( |  double  |  knot_value,
|  int  |  knot_multiplicity
)
Insert a knot and update cv locations.
Parameters
knot_value | [in] m_knot[order-2] < knot_value < m_knot[m_cv_count-1]
knot_multiplicity | [in] 1 to degree - includes multiplicity of existing knots.
Returns
true if successful
Does not change parameterization or locus of curve.
◆ IsArc()
 bool ON_NurbsCurve::IsArc  |  ( |  const ON_Plane *  |  plane = nullptr,
|  ON_Arc *  |  arc = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
virtual ON_Curve::IsArc override.
Reimplemented from ON_Curve.
◆ IsClamped()
 bool ON_NurbsCurve::IsClamped  |  ( |  int  |   = 2 | ) |   const
◆ IsClosed()
 bool ON_NurbsCurve::IsClosed  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::IsClosed override.
Returns
true if NURBS curve is closed. (Either curve has clamped end knots and euclidean location of start CV = euclidean location of end CV, or curve is periodic.)
Reimplemented from ON_Curve.
◆ IsContinuous()
 bool ON_NurbsCurve::IsContinuous  |  ( |  ON::continuity  |  c,
|  double  |  t,
|  int *  |  hint = nullptr,
|  double  |  point_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d1_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d2_tolerance = ON_ZERO_TOLERANCE,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Test continuity at a curve parameter value.
Parameters
c | [in] continuity to test for
t | [in] parameter to test
hint | [in] evaluation hint
point_tolerance | [in] if the distance between two points is greater than point_tolerance, then the curve is not C0.
d1_tolerance | [in] if the difference between two first derivatives is greater than d1_tolerance, then the curve is not C1.
d2_tolerance | [in] if the difference between two second derivatives is greater than d2_tolerance, then the curve is not C2.
cos_angle_tolerance | [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported.
curvature_tolerance | [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous or ON::continuity::Gsmooth_continuous. ON::continuity::G2_continuous: If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. ON::continuity::Gsmooth_continuous: If K0 and K1 are curvatures evaluated from above and below and the angle between K0 and K1 is at least twice angle tolerance or ||K0| - |K1|| > (max(|K0|,|K1|) > curvature_tolerance, then a curvature discontinuity is reported.
Returns
true if the curve has at least the c type continuity at the parameter t.
Overrides ON_Curve::IsContinuous.
Reimplemented from ON_Curve.
◆ IsDeformable()
 bool ON_NurbsCurve::IsDeformable  |  ( |   | ) |   const
overridevirtual
virtual ON_Geometry::IsDeformable() override
Reimplemented from ON_Geometry.
◆ IsDuplicate()
 bool ON_NurbsCurve::IsDuplicate  |  ( |  const ON_NurbsCurve &  |  other,
|  bool  |  bIgnoreParameterization,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
See if this and other are same NURBS geometry.
Parameters
other | [in] other NURBS curve
bIgnoreParameterization | [in] if true, parameterization and orientaion are ignored.
tolerance | [in] tolerance to use when comparing control points.
Returns
true if curves are tne same.
◆ IsInPlane()
 bool ON_NurbsCurve::IsInPlane  |  ( |  const ON_Plane &  |  test_plane,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
virtual ON_Curve::IsInPlane override.
Implements ON_Curve.
◆ IsLinear()
 bool ON_NurbsCurve::IsLinear  |  ( |  double  |  tolerance = ON_ZERO_TOLERANCE | ) |   const
overridevirtual
virtual ON_Curve::IsLinear override.
Reimplemented from ON_Curve.
◆ IsPeriodic()
 bool ON_NurbsCurve::IsPeriodic  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::IsPeriodic override.
Returns
true if NURBS curve is periodic (degree > 1, periodic knot vector, last degree many CVs are duplicates of first degree many CVs).
Reimplemented from ON_Curve.
◆ IsPlanar()
 bool ON_NurbsCurve::IsPlanar  |  ( |  ON_Plane *  |  plane = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
virtual ON_Curve::IsPlanar override.
Reimplemented from ON_Curve.
◆ IsPolyline()
 int ON_NurbsCurve::IsPolyline  |  ( |  ON_SimpleArray< ON_3dPoint > *  |  pline_points = nullptr,
|  ON_SimpleArray< double > *  |  pline_t = nullptr
) |   |  const
overridevirtual
Several types of ON_Curve can have the form of a polyline including a degree 1 ON_NurbsCurve, an ON_PolylineCurve, and an ON_PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline.
Parameters
pline_points | [out] if not nullptr and true is returned, then the points of the polyline form are returned here.
t | [out] if not nullptr and true is returned, then the parameters of the polyline points are returned here.
Returns
table 0 curve is not some form of a polyline >=2 number of points in polyline form
Reimplemented from ON_Curve.
◆ IsRational()
 bool ON_NurbsCurve::IsRational  |  ( |  void  |   | ) |   const
Interface.
◆ IsSingular()
 bool ON_NurbsCurve::IsSingular  |  ( |   | ) |   const
Returns
True if every span in the NURBS curve is singular.
See also
ON_NurbsCurve::RepairBadKnots(), ON_NurbsCurve::RemoveShortSegments()
◆ IsValid()
 bool ON_NurbsCurve::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
ON_Object overrides.
Reimplemented from ON_Geometry.
◆ Knot() [1/2]
 double ON_NurbsCurve::Knot  |  ( |  int  |  knot_index | ) |   const
Get knot value.
Parameters
knot_index | [in] 0 <= knot_index <= KnotCount()-1
Returns
knot value = m_knot[knot_index]
See also
ON_NurbsCurve::SetKnot, ON_NurbsCurve::KnotMultiplicity
◆ Knot() [2/2]
 const double* ON_NurbsCurve::Knot  |  ( |   | ) |   const
Get pointer to knot vector array.
Returns
pointer to knot vector array (m_knot).
See also
ON_NurbsCurve::SetKnot, ON_NurbsCurve::Knot,, ON_NurbsCurve::InsertKnot
◆ KnotCount()
 int ON_NurbsCurve::KnotCount  |  ( |  void  |   | ) |   const
◆ KnotMultiplicity()
 int ON_NurbsCurve::KnotMultiplicity  |  ( |  int  |  knot_index | ) |   const
Get knot multiplicity.
Parameters
knot_index | [in] 0 <= knot_index <= KnotCount()-1
Returns
knot multiplicity = m_knot[knot_index]
See also
ON_NurbsCurve::SetKnot, ON_NurbsCurve::Knot,, ON_NurbsCurve::InsertKnot
◆ MakeClampedUniformKnotVector()
 bool ON_NurbsCurve::MakeClampedUniformKnotVector  |  ( |  double  |  delta = 1.0 | )
Make knot vector a clamped uniform knot vector based on the current values of m_order and m_cv_count. Does not change values of control vertices.
Parameters
delta | in knot spacing.
Returns
true if successful.
Allocates m_knot[] if it is not big enough.
See also
ON_MakeClampedUniformKnotVector
◆ MakeDeformable()
 bool ON_NurbsCurve::MakeDeformable  |  ( |   | )
overridevirtual
virtual ON_Geometry::MakeDeformable() override
Reimplemented from ON_Geometry.
◆ MakeNonRational()
 bool ON_NurbsCurve::MakeNonRational  |  ( |   | )
◆ MakePeriodicUniformKnotVector()
 bool ON_NurbsCurve::MakePeriodicUniformKnotVector  |  ( |  double  |  delta = 1.0 | )
Make knot vector a periodic uniform knot vector based on the current values of m_order and m_cv_count. Does not change values of control vertices.
Parameters
delta | in knot spacing.
Returns
true if successful.
Allocates m_knot[] if it is not big enough.
See also
ON_MakePeriodicUniformKnotVector
◆ MakePiecewiseBezier()
 bool ON_NurbsCurve::MakePiecewiseBezier  |  ( |  bool  |  bSetEndWeightsToOne = false | )
Clamps ends and adds knots so the NURBS curve has bezier spans (all distinct knots have multiplitity = degree). Paremeters: bSetEndWeightsToOne - [in] If true and the first or last weight is not one, then the first and last spans are reparameterized so that the end weights are one.
Returns
true if successful.
◆ MakeRational()
 bool ON_NurbsCurve::MakeRational  |  ( |   | )
◆ New() [1/4]
 static ON_NurbsCurve* ON_NurbsCurve::New  |  ( |   | )
static
Use ON_NurbsCurve::New(...) instead of new ON_NurbsCurve(...)
Returns
Pointer to an ON_NurbsCurve. Destroy by calling delete.
See static ON_Brep* ON_Brep::New() for details.
◆ New() [2/4]
 static ON_NurbsCurve* ON_NurbsCurve::New  |  ( |  const ON_NurbsCurve &  |  nurbs_curve | )
static
◆ New() [3/4]
 static ON_NurbsCurve* ON_NurbsCurve::New  |  ( |  const ON_BezierCurve &  |  bezier_curve | )
static
◆ New() [4/4]
 static ON_NurbsCurve* ON_NurbsCurve::New  |  ( |  int  |  dimension,
|  bool  |  bIsRational,
|  int  |  order,
|  int  |  cv_count
)
static
◆ operator=() [1/2]
 ON_NurbsCurve& ON_NurbsCurve::operator=  |  ( |  const ON_NurbsCurve &  |  src | )
◆ operator=() [2/2]
 ON_NurbsCurve& ON_NurbsCurve::operator=  |  ( |  const ON_BezierCurve &  |  bezier_curve | )
Set NURBS curve equal to bezier with domain [0,1].
Parameters
bezier_curve | [in]
◆ Order()
 int ON_NurbsCurve::Order  |  ( |  void  |   | ) |   const
◆ Read()
 bool ON_NurbsCurve::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
virtual ON_Object::Read override
Reimplemented from ON_Object.
◆ RemoveSingularSpans()
 int ON_NurbsCurve::RemoveSingularSpans  |  ( |   | )
Returns
Number of spans removed.
◆ RemoveSpan()
 bool ON_NurbsCurve::RemoveSpan  |  ( |  int  |  span_index | )
Returns
True if the span was successfully removed.
The NURBS curve must have 2 or more spans (m_cv_count > m_order). Set m0 = mulitiplicity of the knot at m_knot[span_index+m_order-2] and m1 = mulitiplicity of the knot at m_knot[span_index+m_order-1]. If (m0 + m1) < degree, then the degree-(m0+m1) cvs will be added to the NURBS curve. If (m0+m1) > degree, then (m0+m1)-degree cvs will be removed from the curve.
See also
ON_NurbsCurve::RepairBadKnots(), ON_NurbsCurve::RemoveShortSegments()
◆ RepairBadKnots()
 bool ON_NurbsCurve::RepairBadKnots  |  ( |  double  |  knot_tolerance = 0.0,
|  bool  |  bRepair = true
)
Looks for problems caused by knots that are close together or have mulitplicity >= order. If bRepair is true, the problems are fixed. Does not change the domain.
Parameters
knot_tolerance | [in] >= 0 When in doubt, use zero.
bRepair | [in] If true, then problems are repaired. Otherwise this function looks for problemsn that can be repaired, but does not modify the curve.
Returns
True if bad knots were found and can be repaired.
See also
ON_NurbsCurve::RemoveShortSegments
◆ Reparameterize()
 bool ON_NurbsCurve::Reparameterize  |  ( |  double  |  c | )
Use a linear fractional transformation to reparameterize the NURBS curve. This does not change the curve's domain.
Parameters
c | [in] reparameterization constant (generally speaking, c should be > 0). The control points and knots are adjusted so that output_nurbs(t) = input_nurbs(lambda(t)), where lambda(t) = c*t/( (c-1)*t + 1 ). Note that lambda(0) = 0, lambda(1) = 1, lambda'(t) > 0, lambda'(0) = c and lambda'(1) = 1/c.
Returns
true if successful.
The cv and knot values are values are changed so that output_nurbs(t) = input_nurbs(lambda(t)).
See also
ON_ReparameterizeRationalNurbsCurve
◆ ReserveCVCapacity()
 bool ON_NurbsCurve::ReserveCVCapacity  |  ( |  int  |   | )
Tools for managing CV and knot memory.
◆ ReserveKnotCapacity()
 bool ON_NurbsCurve::ReserveKnotCapacity  |  ( |  int  |   | )
◆ Reverse()
 bool ON_NurbsCurve::Reverse  |  ( |   | )
overridevirtual
virtual ON_Curve::Reverse override. Reverse parameterizatrion by negating all knots and reversing the order of the control vertices.
Domain changes from [a,b] to [-b,-a]
Implements ON_Curve.
◆ SetCV() [1/3]
 bool ON_NurbsCurve::SetCV  |  ( |  int  |  ,
|  ON::point_style  |  ,
|  const double *
)
◆ SetCV() [2/3]
 bool ON_NurbsCurve::SetCV  |  ( |  int  |  ,
|  const ON_3dPoint &
)
◆ SetCV() [3/3]
 bool ON_NurbsCurve::SetCV  |  ( |  int  |  ,
|  const ON_4dPoint &
)
◆ SetDomain()
 bool ON_NurbsCurve::SetDomain  |  ( |  double  |  t0,
|  double  |  t1
)
overridevirtual
virtual ON_Curve::SetDomain override. Set the domain of the curve
Parameters
t0 | [in]
t1 | [in] new domain will be [t0,t1]
Returns
true if successful.
Reimplemented from ON_Curve.
◆ SetEndPoint()
 bool ON_NurbsCurve::SetEndPoint  |  ( |  ON_3dPoint  |  end_point | )
overridevirtual
Force the curve to end at a specified point.
Parameters
end_point | [in]
Returns
true if successful.
Some end points cannot be moved. Be sure to check return code.
See also
ON_Curve::SetStartPoint, ON_Curve::PointAtStart, ON_Curve::PointAtEnd
virtual
Reimplemented from ON_Curve.
◆ SetKnot()
 bool ON_NurbsCurve::SetKnot  |  ( |  int  |  knot_index,
|  double  |  knot_value
)
Set knot value.
Parameters
knot_index | [in] 0 <= knot_index <= KnotCount()-1
knot_value | [in]
Returns
true if successful
m_knot[] must exist. Use ReserveKnotCapacity to allocate m_knot[].
See also
ON_NurbsCurve::ReserveKnotCapacity
◆ SetStartPoint()
 bool ON_NurbsCurve::SetStartPoint  |  ( |  ON_3dPoint  |  start_point | )
overridevirtual
Force the curve to start at a specified point.
Parameters
start_point | [in]
Returns
true if successful.
Some end points cannot be moved. Be sure to check return code.
See also
ON_Curve::SetEndPoint, ON_Curve::PointAtStart, ON_Curve::PointAtEnd
virtual
Reimplemented from ON_Curve.
◆ SetWeight()
 bool ON_NurbsCurve::SetWeight  |  ( |  int  |  ,
|  double
)
Set value of control vertex weight. If curve is non-rational, it will be converted to rational.
◆ SizeOf()
 unsigned int ON_NurbsCurve::SizeOf  |  ( |   | ) |   const
overridevirtual
virtual ON_Object::SizeOf override
Reimplemented from ON_Curve.
◆ SpanCount()
 int ON_NurbsCurve::SpanCount  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::SpanCount override. Get number of nonempty smooth (c-infinity) spans in curve
Returns
Number of nonempty smooth (c-infinity) spans.
A nonempty span is bracked by knots m_knot[i] < m_knot[i+1] with m_order-2 <= i < m_cv_count-1.
Implements ON_Curve.
◆ SpanIsLinear() [1/2]
 bool ON_NurbsCurve::SpanIsLinear  |  ( |  int  |  span_index,
|  double  |  min_length,
|  double  |  tolerance
) |   |  const
Parameters
span_index | [in] (0 <= span_index <= m_cv_count-m_order)
min_length | [in] minimum length of a linear span
tolerance | [in] distance tolerance to use when checking control points between the span ends Returns true if the span is a non-degenrate line. This means:
dimension = 2 or 3
There are full multiplicity knots at each end of the span.
The length of the the line segment from the span's initial control point to the span's final control point is >= min_length.
The distance from the line segment to the interior control points is <= tolerance and the projections of these points onto the line increases monotonically.
◆ SpanIsLinear() [2/2]
 bool ON_NurbsCurve::SpanIsLinear  |  ( |  int  |  span_index,
|  double  |  min_length,
|  double  |  tolerance,
|  ON_Line *  |  line
) |   |  const
◆ SpanIsSingular()
 bool ON_NurbsCurve::SpanIsSingular  |  ( |  int  |  span_index | ) |   const
Returns
true if the span_index parameter is valid and the span is singular (collapsed to a point). false if the span is not singular or span_index does not identify a non-empty span.
◆ Split()
 bool ON_NurbsCurve::Split  |  ( |  double  |  split_param,
|  ON_Curve *&  |  left_result,
|  ON_Curve *&  |  right_result
) |   |  const
overridevirtual
virtual ON_Curve::Split override.
Split() divides the curve at the specified parameter. The parameter must be in the interior of the curve's domain. The pointers passed to ON_NurbsCurve::Split must either be nullptr or point to an ON_NurbsCurve. If the pointer is nullptr, then a curve will be created in Split(). You may pass "this" as one of the pointers to Split(). For example,
ON_NurbsCurve right_side; crv.Split( crv.Domain().Mid() &crv, &right_side );
would split crv at the parametric midpoint, put the left side in crv, and return the right side in right_side.
Reimplemented from ON_Curve.
◆ SuperfluousKnot()
 double ON_NurbsCurve::SuperfluousKnot  |  ( |  int  |   | ) |   const
◆ SwapCoordinates()
 bool ON_NurbsCurve::SwapCoordinates  |  ( |  int  |  i,
|  int  |  j
)
overridevirtual
virtual ON_Geometry::SwapCoordinates override. Swaps control vertex coordinate values with indices i and j.
Parameters
i | [in] coordinate index
j | [in] coordinate index
Reimplemented from ON_Geometry.
◆ Transform()
 bool ON_NurbsCurve::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
virtual ON_Geometry::Transform override. Transforms the NURBS curve.
Parameters
xform | [in] transformation to apply to object.
When overriding this function, be sure to include a call to ON_Object::TransformUserData() which takes care of transforming any ON_UserData that may be attached to the object.
Reimplemented from ON_Curve.
◆ Trim()
 bool ON_NurbsCurve::Trim  |  ( |  const ON_Interval &  |   | )
overridevirtual
virtual ON_Curve::Trim override.
Reimplemented from ON_Curve.
◆ Weight()
 double ON_NurbsCurve::Weight  |  ( |  int  |   | ) |   const
◆ Write()
 bool ON_NurbsCurve::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
virtual ON_Object::Write override
Reimplemented from ON_Object.
◆ ZeroCVs()
 bool ON_NurbsCurve::ZeroCVs  |  ( |   | )
Member Data Documentation
◆ m_cv
 double* ON_NurbsCurve::m_cv
◆ m_cv_capacity
 int ON_NurbsCurve::m_cv_capacity
◆ m_cv_count
 int ON_NurbsCurve::m_cv_count
◆ m_cv_stride
 int ON_NurbsCurve::m_cv_stride
control vertex net memory
◆ m_dim
 int ON_NurbsCurve::m_dim
Implementation.
◆ m_is_rat
 int ON_NurbsCurve::m_is_rat
◆ m_knot
 double* ON_NurbsCurve::m_knot
◆ m_knot_capacity
 int ON_NurbsCurve::m_knot_capacity
knot vector memory
◆ m_order
 int ON_NurbsCurve::m_order