openNURBS SDK Help 6.0
 Public Member Functions | List of all members
ON_BrepEdgeArray Class Reference
#include <opennurbs_brep.h>
 Inheritance diagram for ON_BrepEdgeArray:
 Public Member Functions
ON_BrepEdgeArray ()
~ON_BrepEdgeArray ()
bool  | Read (ON_BinaryArchive &)
unsigned int  | SizeOf () const
bool  | Write (ON_BinaryArchive &) const
 Public Member Functions inherited from ON_ObjectArray< ON_BrepEdge >
ON_ObjectArray ()
Class ON_ObjectArray<> More...
ON_ObjectArray (size_t)
ON_ObjectArray (const ON_ObjectArray< ON_BrepEdge > &)
~ON_ObjectArray ()
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
bool  | HeapSort (int(*)(const ON_BrepEdge *, const ON_BrepEdge *))
ON_ObjectArray< ON_BrepEdge > &  | operator= (const ON_ObjectArray< ON_BrepEdge > &)
bool  | QuickSort (int(*)(const ON_BrepEdge *, const ON_BrepEdge *))
Sorts the array using the heap sort algorithm. More...
ON_BrepEdge *  | Realloc (ON_BrepEdge *, int)
low level memory managment /////////////////////////////////////// More...
 Public Member Functions inherited from ON_ClassArray< ON_BrepEdge >
ON_ClassArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_ClassArray (size_t)
ON_ClassArray (const ON_ClassArray< ON_BrepEdge > &)
Copy constructor. More...
virtual  | ~ON_ClassArray ()
void  | Append (const ON_BrepEdge &)
void  | Append (int, const ON_BrepEdge *)
ON_BrepEdge &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_BrepEdge *  | Array ()
const ON_BrepEdge *  | Array () const
ON_BrepEdge *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
ON_BrepEdge *  | At (unsigned int)
ON_BrepEdge *  | At (ON__INT64)
ON_BrepEdge *  | At (ON__UINT64)
const ON_BrepEdge *  | At (int) const
const ON_BrepEdge *  | At (unsigned int) const
const ON_BrepEdge *  | At (ON__INT64) const
const ON_BrepEdge *  | At (ON__UINT64) const
int  | BinarySearch (const ON_BrepEdge *, int(*)(const ON_BrepEdge *, const ON_BrepEdge *)) const
int  | BinarySearch (const ON_BrepEdge *, int(*)(const ON_BrepEdge *, const ON_BrepEdge *), int) const
int  | Capacity () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
void  | Destroy ()
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Empty ()
ON_BrepEdge *  | First ()
const ON_BrepEdge *  | First () const
void  | Insert (int, const ON_BrepEdge &)
Insert called with a reference uses operator =. More...
ON_BrepEdge *  | KeepArray ()
ON_BrepEdge *  | Last ()
const ON_BrepEdge *  | Last () const
int  | NewCapacity () const
operator const ON_BrepEdge * () const
operator ON_BrepEdge * ()
ON_ClassArray< ON_BrepEdge > &  | operator= (const ON_ClassArray< ON_BrepEdge > &)
Assignment operator. More...
ON_BrepEdge &  | operator[] (int)
ON_BrepEdge &  | operator[] (unsigned int)
ON_BrepEdge &  | operator[] (ON__INT64)
ON_BrepEdge &  | operator[] (ON__UINT64)
const ON_BrepEdge &  | operator[] (int) const
const ON_BrepEdge &  | operator[] (unsigned int) const
const ON_BrepEdge &  | operator[] (ON__INT64) const
const ON_BrepEdge &  | operator[] (ON__UINT64) const
bool  | Permute (const int *)
void  | Remove ()
void  | Remove (int)
ON_BrepEdge *  | Reserve (size_t)
memory managment ///////////////////////////////////////////////// More...
void  | Reverse ()
int  | Search (const ON_BrepEdge *, int(*)(const ON_BrepEdge *, const ON_BrepEdge *)) const
void  | SetArray (ON_BrepEdge *)
Do not use this version of SetArray(). Use the one that takes a pointer, count and capacity: SetArray(pointer,count,capacity) More...
void  | SetArray (ON_BrepEdge *, int, int)
Expert user tool to set the memory used by the dyanmic array. More...
ON_BrepEdge *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory managment ////////////////////////////////////////// More...
void  | Shrink ()
unsigned int  | SizeOfArray () const
unsigned int  | SizeOfElement () const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_BrepEdge *, const ON_BrepEdge *)) const
Sort() fills in the index[] array so that array[index[i]] <= array[index[i+1]]. The array is not modified. More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_BrepEdge *, const ON_BrepEdge *, void *), void *) const
Sort() fills in the index[] array so that array[index[i]] <= array[index[i+1]]. The array is not modified. More...
void  | Swap (int, int)
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_ClassArray< ON_BrepEdge >
void  | ConstructDefaultElement (ON_BrepEdge *)
void  | DestroyElement (ON_BrepEdge &)
void  | Move (int, int, int)
implimentation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_ClassArray< ON_BrepEdge >
ON_BrepEdge *  | m_a
int  | m_capacity
int  | m_count
Constructor & Destructor Documentation
◆ ON_BrepEdgeArray()
 ON_BrepEdgeArray::ON_BrepEdgeArray  |  ( |   | )
◆ ~ON_BrepEdgeArray()
 ON_BrepEdgeArray::~ON_BrepEdgeArray  |  ( |   | )
Member Function Documentation
◆ Read()
 bool ON_BrepEdgeArray::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ SizeOf()
 unsigned int ON_BrepEdgeArray::SizeOf  |  ( |   | ) |   const
◆ Write()
 bool ON_BrepEdgeArray::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const