Public Member Functions | List of all members
ON_DebugWriteArchive Class Reference
#include <opennurbs_archive.h>
 Public Member Functions
ON_DebugWriteArchive ()
~ON_DebugWriteArchive ()
ON_BinaryArchive *  | Archive () const
const ON_wString &  | FilePath () const
unsigned int  | Number () const
the number of the archive or 0 More...
Detailed Description
ON_DebugWriteArchive debug;
if(debug.m_Archive)
 ON_WriteArchive( *debug.m_Archive, geometry );
Constructor & Destructor Documentation
◆ ON_DebugWriteArchive()
 ON_DebugWriteArchive::ON_DebugWriteArchive  |  ( |   | )
◆ ~ON_DebugWriteArchive()
 ON_DebugWriteArchive::~ON_DebugWriteArchive  |  ( |   | )
Member Function Documentation
◆ Archive()
 ON_BinaryArchive* ON_DebugWriteArchive::Archive  |  ( |   | ) |   const
◆ FilePath()
 const ON_wString& ON_DebugWriteArchive::FilePath  |  ( |   | ) |   const
◆ Number()
 unsigned int ON_DebugWriteArchive::Number  |  ( |   | ) |   const
the number of the archive or 0