openNURBS SDK Help 6.0
 Public Member Functions | List of all members
ON_CurveArray Class Reference
#include <opennurbs_curve.h>
 Inheritance diagram for ON_CurveArray:
 Public Member Functions
ON_CurveArray (int=0)
~ON_CurveArray ()
void  | Destroy ()
bool  | Duplicate (ON_CurveArray &) const
bool  | GetTightBoundingBox (ON_BoundingBox &tight_bbox, bool bGrowBox=false, const ON_Xform *xform=nullptr) const
Get tight bounding box of the bezier. More...
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Member Functions inherited from ON_SimpleArray< ON_Curve *>
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< ON_Curve * > &)
Copy constructor. More...
ON_SimpleArray (size_t)
virtual  | ~ON_SimpleArray ()
void  | Append (const ON_Curve * &)
void  | Append (int, const ON_Curve * *)
ON_Curve * &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_Curve * *  | Array ()
const ON_Curve * *  | Array () const
ON_Curve * *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
ON_Curve * *  | At (unsigned int)
ON_Curve * *  | At (ON__INT64)
ON_Curve * *  | At (ON__UINT64)
const ON_Curve * *  | At (int) const
const ON_Curve * *  | At (unsigned int) const
const ON_Curve * *  | At (ON__INT64) const
const ON_Curve * *  | At (ON__UINT64) const
int  | BinarySearch (const ON_Curve * *, int(*)(const ON_Curve * *, const ON_Curve * *)) const
int  | BinarySearch (const ON_Curve * *, int(*)(const ON_Curve * *, const ON_Curve * *), int) const
int  | Capacity () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Empty ()
ON_Curve * *  | First ()
const ON_Curve * *  | First () const
bool  | HeapSort (int(*)(const ON_Curve * *, const ON_Curve * *))
void  | Insert (int, const ON_Curve * &)
ON_Curve * *  | KeepArray ()
Expert user tool to take charge of the memory used by the dyanmic array. More...
ON_Curve * *  | Last ()
const ON_Curve * *  | Last () const
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const ON_Curve * * () const
operator ON_Curve ** ()
ON_SimpleArray< ON_Curve * > &  | operator= (const ON_SimpleArray< ON_Curve * > &)
ON_Curve * &  | operator[] (int)
ON_Curve * &  | operator[] (unsigned int)
ON_Curve * &  | operator[] (ON__INT64)
ON_Curve * &  | operator[] (ON__UINT64)
const ON_Curve * &  | operator[] (int) const
const ON_Curve * &  | operator[] (unsigned int) const
const ON_Curve * &  | operator[] (ON__INT64) const
const ON_Curve * &  | operator[] (ON__UINT64) const
bool  | Permute (const int *)
bool  | QuickSort (int(*)(const ON_Curve * *, const ON_Curve * *))
virtual ON_Curve * *  | Realloc (ON_Curve * *, int)
low level memory managment ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
ON_Curve * *  | Reserve (size_t)
memory managment //////////////////////////////////////////////////// More...
void  | Reverse ()
int  | Search (const ON_Curve * &) const
int  | Search (const ON_Curve * *, int(*)(const ON_Curve * *, const ON_Curve * *)) const
void  | SetArray (ON_Curve * *)
Do not use this version of SetArray(). Use the one that takes a pointer, count and capacity. More...
void  | SetArray (ON_Curve * *, int, int)
Expert user tool to set the memory used by the dyanmic array. More...
ON_Curve * *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory managment ////////////////////////////////////////// More...
void  | Shrink ()
unsigned int  | SizeOfArray () const
unsigned int  | SizeOfElement () const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_Curve * *, const ON_Curve * *)) const
Sort() fills in the index[] array so that array[index[i]] <= array[index[i+1]]. The array is not modified. More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_Curve * *, const ON_Curve * *, void *), void *) const
Sort() fills in the index[] array so that array[index[i]] <= array[index[i+1]]. The array is not modified. More...
void  | Swap (int, int)
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_SimpleArray< ON_Curve *>
void  | Move (int, int, int)
implimentation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< ON_Curve *>
ON_Curve * *  | m_a
int  | m_capacity
int  | m_count
Constructor & Destructor Documentation
◆ ON_CurveArray()
 ON_CurveArray::ON_CurveArray  |  ( |  int  |   = 0 | )
◆ ~ON_CurveArray()
 ON_CurveArray::~ON_CurveArray  |  ( |   | )
Member Function Documentation
◆ Destroy()
 void ON_CurveArray::Destroy  |  ( |   | )
◆ Duplicate()
 bool ON_CurveArray::Duplicate  |  ( |  ON_CurveArray &  |   | ) |   const
◆ GetTightBoundingBox()
 bool ON_CurveArray::GetTightBoundingBox  |  ( |  ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const ON_Xform *  |  xform = nullptr
) |   |  const
Get tight bounding box of the bezier.
Parameters
tight_bbox | [in/out] tight bounding box
bGrowBox | [in] (default=false) If true and the input tight_bbox is valid, then returned tight_bbox is the union of the input tight_bbox and the tight bounding box of the bezier curve.
xform | [in] (default=nullptr) If not nullptr, the tight bounding box of the transformed bezier is calculated. The bezier curve is not modified.
Returns
True if the returned tight_bbox is set to a valid bounding box.
◆ Read()
 bool ON_CurveArray::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_CurveArray::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const