openNURBS SDK Help 6.0
 Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_Texture Class Reference
#include <opennurbs_texture.h>
 Inheritance diagram for ON_Texture:
 Public Types
enum  | FILTER : unsigned int { FILTER::nearest_filter = 0, FILTER::linear_filter = 1 }
enum  | MAPPING_CHANNEL : unsigned int {
 MAPPING_CHANNEL::tc_channel = 0U, MAPPING_CHANNEL::default_channel = 1U, MAPPING_CHANNEL::screen_based_channel = 0xFFFFFFF1U, MAPPING_CHANNEL::wcs_channel = 0xFFFFFFF2U,
 MAPPING_CHANNEL::wcs_box_channel = 0xFFFFFFF3U, MAPPING_CHANNEL::environment_map_box_channel = 0xFFFFFFF4U, MAPPING_CHANNEL::environment_map_light_probe_channel = 0xFFFFFFF5U, MAPPING_CHANNEL::environment_map_spherical_channel = 0xFFFFFFF6U,
 MAPPING_CHANNEL::environment_map_cube_map_channel = 0xFFFFFFF7U, MAPPING_CHANNEL::environment_map_vcross_cube_map_channel = 0xFFFFFFF8U, MAPPING_CHANNEL::environment_map_hcross_cube_map_channel = 0xFFFFFFF9U, MAPPING_CHANNEL::environment_map_hemispherical_channel = 0xFFFFFFFAU,
 MAPPING_CHANNEL::environment_map_emap_channel = 0xFFFFFFFFU, MAPPING_CHANNEL::srfp_channel = 0xFFFFFFFEU, MAPPING_CHANNEL::emap_channel = 0xFFFFFFFFU
 }
list of pre-defined channel ids More...
enum  | MODE : unsigned int { MODE::no_texture_mode = 0, MODE::modulate_texture = 1, MODE::decal_texture = 2, MODE::blend_texture = 3 }
enum  | TYPE : unsigned int {
 TYPE::no_texture_type = 0U, TYPE::bitmap_texture = 1U, TYPE::bump_texture = 2U, TYPE::transparency_texture = 3U,
 TYPE::emap_texture = 86U
 }
enum  | WRAP : unsigned int { WRAP::repeat_wrap = 0, WRAP::clamp_wrap = 1 }
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
When a userdata item is copied or moved from a source object to a destination object, the ON_Object::UserDataConflictResolution enum values specify how conficts are resolved. Remark: A userdata item "conflict" occurs when both the destination and source object have a user data item with the same value of ON_UserData::m_userdata_uuid. More...
 Public Member Functions
ON_Texture ()=default
ON_Texture (const ON_Texture &)=default
~ON_Texture ()=default
const ON_SHA1_Hash  | ContentHash () const
void  | Dump (ON_TextLog &) const override
Creates a text dump of the object. More...
bool  | IsTiled (int dir, double *count, double *offset) const
Examines the m_uvw matrix and harvests tiling constants. More...
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_Object overrides. More...
ON_Texture &  | operator= (const ON_Texture &)=default
bool  | Read (ON_BinaryArchive &binary_archive) override
Low level archive writing tool used by ON_BinaryArchive::ReadObject(). More...
bool  | ReverseTextureCoordinate (int dir)
Reverses the texture in the specified direction. More...
void  | SetBuiltInMappingChannel (ON_Texture::MAPPING_CHANNEL built_in_mapping_channel_as_unsigned)
void  | SetMappingChannel (unsigned int mapping_channel_id)
unsigned int  | SizeOf () const override
bool  | SwapTextureCoordinate (int i, int j)
Swaps the specified texture coordinates. More...
bool  | TileTextureCoordinate (int dir, double count, double offset)
Tiles the specified texture coordinates. More...
bool  | Write (ON_BinaryArchive &binary_archive) const override
Low level archive writing tool used by ON_BinaryArchive::WriteObject(). More...
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
bool  | AttachUserData (class ON_UserData *pUserData)
Attach user data to an object. More...
unsigned int  | ClearAllComponentStates () const
Set all active level component states to ON_ComponentStatus::NoneSet. More...
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
Clear the specified states on every component. More...
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
Clear states on an individual component. More...
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
Expert user tool that copies user data items with positive values of ON_UserData.m_userdata_copycount from source_object to "this. More...
void  | CopyUserData (const ON_Object &source_object)
Calls CopyUserData(source_object,ON_Object::UserDataConflictResolution::source_object). More...
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
Returns a CRC calculated from the information that defines the object. This CRC can be used as a quick way to see if two objects are not identical. More...
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
Delete the portions of the object identified in ci_list[]. More...
virtual void  | DestroyRuntimeCache (bool bDelete=true)
Expert user function. If you are using openNURBS in its default configuration to read and write 3dm archives, you never need to call this function. Many objects employ lazy creation of (runtime) caches that save information to help speed geometric calculations. This function will destroy all runtime information. More...
bool  | DetachUserData (class ON_UserData *pUserData)
Remove user data from an object. More...
void  | EmergencyDestroy ()
Sets m_user_data_list = 0. More...
class ON_UserData *  | FirstUserData () const
User data is stored as a linked list of ON_UserData classes. FirstUserData gets the first item in the linked list. This is the most recent item attached using AttachUserData(). Remark: To iterate through all the user data on an object, call FirstUserData() and then use ON_UserData::Next() to traverse the list. More...
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
Get a pointer to user data. More...
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
Get user string from the object. More...
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
Get a list of all user string keys on the object. More...
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
Get a list of all user strings on the object. More...
bool  | IsKindOf (const ON_ClassId *pClassId) const
Low level tool to test if an object is derived from a specified class. More...
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
Call whenever a component status setting is modifed by directly changing it on a component in a way that will result in any saved information about the parent object's aggretate component status becoming invalid. More...
virtual void  | MemoryRelocate ()
The MemoryRelocate() function is called when an object's location in memory is changed. For example, if an object resides in a chunk of memory that is grown by calling a realloc that has to allocate a new chunk and copy the contents of the old chunk to the new chunk, then the location of the object's memory changes. In practice this happens when classes derived from ON_Object are stored in dynamic arrays, like the default implementation of ON_ObjectArray<>'s that use realloc to grow the dynamic array. More...
virtual ON_UUID  | ModelObjectId () const
All objects in an opennurbs model have an id ( ON_Layer.m_layer_id, ON_Font.m_font_id, ON_Material.m_material_id, ON_3dmObjectAttributes.m_uuid ). More...
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
Expert user tool that moves user data items from source_object to "this. More...
void  | MoveUserData (ON_Object &source_object)
Calls MoveUserData(source_object,ON_Object::UserDataConflictResolution::source_object,true). More...
virtual ON::object_type  | ObjectType () const
Useful for switch statements that need to differentiate between basic object types like points, curves, surfaces, and so on. More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
PurgeUserData() removes all user data from object. More...
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
Set states on an individual component. More...
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
Copy status settings to an individual component. More...
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
Attach a user string to the object. This information will perisist through copy construction, operator=, and file IO. More...
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
Append entries to the user string list More...
void  | TransformUserData (const class ON_Xform &xform)
Objects derived from ON_Geometry must call TransformUserData() in their Transform() member function. More...
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. More...
int  | UserStringCount () const
 Static Public Member Functions
static ON_Texture::MAPPING_CHANNEL  | BuiltInMappingChannelFromUnsigned (unsigned int mapping_channel_as_unsigned)
static int  | Compare (const ON_Texture &a, const ON_Texture &b)
static ON_Texture::FILTER  | FilterFromUnsigned (unsigned int filter_as_unsigned)
static ON_Xform  | GetPictureShrinkSurfaceTransformation (const class ON_Brep *original, const class ON_Brep *shrunk, const ON_Xform *error_return)
static ON_Xform  | GetPictureShrinkSurfaceTransformation (const class ON_Surface *original, const class ON_Surface *shrunk, const ON_Xform *error_return)
static ON_Xform  | GetPictureShrinkSurfaceTransformation (const class ON_Interval &original_udomain, const class ON_Interval &original_vdomain, const class ON_Interval &shrunk_udomain, const class ON_Interval &shrunk_vdomain, const ON_Xform *error_return)
static bool  | IsBuiltInMappingChannel (unsigned int mapping_channel_id)
static ON_Texture::MODE  | ModeFromUnsigned (unsigned int mode_as_unsigned)
static ON_Texture::TYPE  | TypeFromUnsigned (unsigned int type_as_unsigned)
static ON_Texture::WRAP  | WrapFromUnsigned (unsigned int wrap_as_unsigned)
 Public Attributes
double  | m_blend_A0 = 1.0
double  | m_blend_A1 = 1.0
double  | m_blend_A2 = 0.0
double  | m_blend_A3 = 0.0
double  | m_blend_constant_A = 1.0
ON_Color  | m_blend_constant_RGB = ON_Color::Black
int  | m_blend_order = 0
double  | m_blend_RGB0 = 1.0
double  | m_blend_RGB1 = 1.0
double  | m_blend_RGB2 = 0.0
double  | m_blend_RGB3 = 0.0
bool  | m_bOn = true
ON_Color  | m_border_color = ON_UNSET_COLOR
ON_Interval  | m_bump_scale = ON_Interval::ZeroToOne
ON_FileReference  | m_image_file_reference = ON_FileReference::Unset
ON_Texture::FILTER  | m_magfilter = ON_Texture::FILTER::linear_filter
unsigned int  | m_mapping_channel_id = 0
ON_Texture::FILTER  | m_minfilter = ON_Texture::FILTER::linear_filter
ON_Texture::MODE  | m_mode = ON_Texture::MODE::modulate_texture
ON_UUID  | m_texture_id = ON_nil_uuid
ON_UUID  | m_transparency_texture_id = ON_nil_uuid
ON_Color  | m_transparent_color = ON_UNSET_COLOR
ON_Texture::TYPE  | m_type = ON_Texture::TYPE::bitmap_texture
ON_Xform  | m_uvw = ON_Xform::IdentityTransformation
Texture coordinate transformation. More...
WRAP  | m_wrapu = ON_Texture::WRAP::repeat_wrap
WRAP  | m_wrapv = ON_Texture::WRAP::repeat_wrap
WRAP  | m_wrapw = ON_Texture::WRAP::repeat_wrap
 Static Public Attributes
static const ON_Texture  | Default
Member Enumeration Documentation
◆ FILTER
 enum ON_Texture::FILTER : unsigned int
strong
Enumerator
nearest_filter
linear_filter
◆ MAPPING_CHANNEL
 enum ON_Texture::MAPPING_CHANNEL : unsigned int
strong
list of pre-defined channel ids
Enumerator
tc_channel
default_channel
screen_based_channel
wcs_channel
wcs_box_channel
environment_map_box_channel
environment_map_light_probe_channel
environment_map_spherical_channel
environment_map_cube_map_channel
environment_map_vcross_cube_map_channel
environment_map_hcross_cube_map_channel
environment_map_hemispherical_channel
environment_map_emap_channel
srfp_channel
emap_channel
◆ MODE
 enum ON_Texture::MODE : unsigned int
strong
Enumerator
no_texture_mode
modulate_texture
decal_texture
blend_texture
◆ TYPE
 enum ON_Texture::TYPE : unsigned int
strong
Enumerator
no_texture_type
bitmap_texture
bump_texture
transparency_texture
emap_texture
emap_texture is OBSOLETE - set m_mapping_channel_id = ON_MappingChannel::emap_mapping
◆ WRAP
 enum ON_Texture::WRAP : unsigned int
strong
Enumerator
repeat_wrap
clamp_wrap
Constructor & Destructor Documentation
◆ ON_Texture() [1/2]
 ON_Texture::ON_Texture  |  ( |   | )
default
◆ ~ON_Texture()
 ON_Texture::~ON_Texture  |  ( |   | )
default
◆ ON_Texture() [2/2]
 ON_Texture::ON_Texture  |  ( |  const ON_Texture &  |   | )
default
Member Function Documentation
◆ BuiltInMappingChannelFromUnsigned()
 static ON_Texture::MAPPING_CHANNEL ON_Texture::BuiltInMappingChannelFromUnsigned  |  ( |  unsigned int  |  mapping_channel_as_unsigned | )
static
◆ Compare()
 static int ON_Texture::Compare  |  ( |  const ON_Texture &  |  a,
|  const ON_Texture &  |  b
)
static
◆ ContentHash()
 const ON_SHA1_Hash ON_Texture::ContentHash  |  ( |   | ) |   const
◆ Dump()
 void ON_Texture::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
Creates a text dump of the object.
Dump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
The default implementations of this virtual function prints the class's name.
Reimplemented from ON_Object.
◆ FilterFromUnsigned()
 static ON_Texture::FILTER ON_Texture::FilterFromUnsigned  |  ( |  unsigned int  |  filter_as_unsigned | )
static
◆ GetPictureShrinkSurfaceTransformation() [1/3]
 static ON_Xform ON_Texture::GetPictureShrinkSurfaceTransformation  |  ( |  const class ON_Brep *  |  original,
|  const class ON_Brep *  |  shrunk,
|  const ON_Xform *  |  error_return
)
static
Parameters
original | [in] A brep used as a picture object (1 face with a bitmap texture applied)
shrunk | [in] A copy of original with the face's surface shrunk in some way. The domain of the shrunk surface must be contained in the domain of the original surface.
error_return | [in] value to return if the input parameters are not valid. If error_return is nullptr, then ON_Xform::Nan is returned when input parameters are not valid.
Returns
Texture transformation that will map a [0,1]x[0,1] to the appropriate sub rectangle of the picture image.
ON_Brep original_picture = ...;
ON_Brep shrunk_picture = original_picture;
shrunk_picture.ShrinkSurfaces();
ON_Material original_material = ...;
ON_Material new_material = original_material;
ON_Texture& new_texture = new_material.m_textures[0];
new_texture.m_uvw
 = ON_Texture::GetPictureShrinkSurfaceTransformation(
 &original_picture,
 &shrunk_picture,
 &ON_Xform::IdentityXform)*new_texture.m_uvw;
◆ GetPictureShrinkSurfaceTransformation() [2/3]
 static ON_Xform ON_Texture::GetPictureShrinkSurfaceTransformation  |  ( |  const class ON_Surface *  |  original,
|  const class ON_Surface *  |  shrunk,
|  const ON_Xform *  |  error_return
)
static
Parameters
original | [in] A surface used as a picture object (1 face with a bitmap texture applied)
shrunk | [in] A surface trimmed/split from the original
error_return | [in] value to return if the input parameters are not valid. If error_return is nullptr, then ON_Xform::Nan is returned when input parameters are not valid.
Returns
Texture transformation that will map a [0,1]x[0,1] to the appropriate sub rectangle of the picture image.
ON_Brep original_picture = ...;
ON_Brep shrunk_picture = original_picture;
shrunk_picture.ShrinkSurfaces();
ON_Material original_material = ...;
ON_Material new_material = original_material;
ON_Texture& new_texture = new_material.m_textures[0];
new_texture.m_uvw
 = ON_Texture::GetPictureShrinkSurfaceTransformation(
 &original_picture,
 &shrunk_picture,
 &ON_Xform::IdentityXform)*new_texture.m_uvw;
◆ GetPictureShrinkSurfaceTransformation() [3/3]
 static ON_Xform ON_Texture::GetPictureShrinkSurfaceTransformation  |  ( |  const class ON_Interval &  |  original_udomain,
|  const class ON_Interval &  |  original_vdomain,
|  const class ON_Interval &  |  shrunk_udomain,
|  const class ON_Interval &  |  shrunk_vdomain,
|  const ON_Xform *  |  error_return
)
static
Parameters
original_udomain | [in]
original_vdomain | [in] original picture surface domain
shrunk_udomain | [in]
shrunk_vdomain | [in]
sub | domain of the original picture.
error_return | [in] value to return if the input parameters are not valid. If error_return is nullptr, then ON_Xform::Nan is returned when input parameters are not valid.
Returns
Texture transformation that will map a [0,1]x[0,1] to the appropriate sub rectangle of the picture image.
ON_Brep original_picture = ...;
ON_Brep shrunk_picture = original_picture;
shrunk_picture.ShrinkSurfaces();
ON_Material original_material = ...;
ON_Material new_material = original_material;
ON_Texture& new_texture = new_material.m_textures[0];
new_texture.m_uvw
 = ON_Texture::GetPictureShrinkSurfaceTransformation(
 &original_picture,
 &shrunk_picture,
 &ON_Xform::IdentityXform)*new_texture.m_uvw;
◆ IsBuiltInMappingChannel()
 static bool ON_Texture::IsBuiltInMappingChannel  |  ( |  unsigned int  |  mapping_channel_id | )
static
◆ IsTiled()
 bool ON_Texture::IsTiled  |  ( |  int  |  dir,
|  double *  |  count,
|  double *  |  offset
) |   |  const
Examines the m_uvw matrix and harvests tiling constants.
Parameters
dir | [in] 0 = reverse "u", 1 = reverse "v", 2 = reverse "w".
count | [out] number of tiles
offset | [out] offset of the tile
Returns
True if if the m_uvw matrix had entries that were compatible with tiling.
◆ IsValid()
 bool ON_Texture::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
ON_Object overrides.
Reimplemented from ON_Object.
◆ ModeFromUnsigned()
 static ON_Texture::MODE ON_Texture::ModeFromUnsigned  |  ( |  unsigned int  |  mode_as_unsigned | )
static
◆ operator=()
 ON_Texture& ON_Texture::operator=  |  ( |  const ON_Texture &  |   | )
default
◆ Read()
 bool ON_Texture::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::ReadObject().
Parameters
binary_archive | archive to read from
Returns
Returns true if the read is successful.
Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ ReverseTextureCoordinate()
 bool ON_Texture::ReverseTextureCoordinate  |  ( |  int  |  dir | )
Reverses the texture in the specified direction.
Parameters
dir | [in] 0 = reverse "u", 1 = reverse "v", 2 = reverse "w".
Returns
True if input is valid.
Modifes m_uvw so that the spedified direction transforms the texture coordinate t to 1-t.
◆ SetBuiltInMappingChannel()
 void ON_Texture::SetBuiltInMappingChannel  |  ( |  ON_Texture::MAPPING_CHANNEL  |  built_in_mapping_channel_as_unsigned | )
◆ SetMappingChannel()
 void ON_Texture::SetMappingChannel  |  ( |  unsigned int  |  mapping_channel_id | )
◆ SizeOf()
 unsigned int ON_Texture::SizeOf  |  ( |   | ) |   const
overridevirtual
Returns
An estimate of the amount of memory the class uses in bytes.
Reimplemented from ON_Object.
◆ SwapTextureCoordinate()
 bool ON_Texture::SwapTextureCoordinate  |  ( |  int  |  i,
|  int  |  j
)
Swaps the specified texture coordinates.
Parameters
i | [in]
j | [in] (0 <= i, j <= 3 and i != j)
Returns
True if input is valid.
Modifes m_uvw so that the specified texture coordinates are swapped.
◆ TileTextureCoordinate()
 bool ON_Texture::TileTextureCoordinate  |  ( |  int  |  dir,
|  double  |  count,
|  double  |  offset
)
Tiles the specified texture coordinates.
Parameters
dir | [in] 0 = reverse "u", 1 = reverse "v", 2 = reverse "w".
count | [in] number of tiles (can be negative)
offset | [in] offset of the tile (can be any number)
Returns
True if input is valid.
Modifes m_uvw so that the specified texture coordinate is tiled.
◆ TypeFromUnsigned()
 static ON_Texture::TYPE ON_Texture::TypeFromUnsigned  |  ( |  unsigned int  |  type_as_unsigned | )
static
◆ WrapFromUnsigned()
 static ON_Texture::WRAP ON_Texture::WrapFromUnsigned  |  ( |  unsigned int  |  wrap_as_unsigned | )
static
◆ Write()
 bool ON_Texture::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Low level archive writing tool used by ON_BinaryArchive::WriteObject().
Parameters
binary_archive | archive to write to
Returns
Returns true if the write is successful.
Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
Member Data Documentation
◆ Default
 const ON_Texture ON_Texture::Default
static
◆ m_blend_A0
 double ON_Texture::m_blend_A0 = 1.0
◆ m_blend_A1
 double ON_Texture::m_blend_A1 = 1.0
◆ m_blend_A2
 double ON_Texture::m_blend_A2 = 0.0
◆ m_blend_A3
 double ON_Texture::m_blend_A3 = 0.0
◆ m_blend_constant_A
 double ON_Texture::m_blend_constant_A = 1.0
◆ m_blend_constant_RGB
 ON_Color ON_Texture::m_blend_constant_RGB = ON_Color::Black
◆ m_blend_order
 int ON_Texture::m_blend_order = 0
◆ m_blend_RGB0
 double ON_Texture::m_blend_RGB0 = 1.0
◆ m_blend_RGB1
 double ON_Texture::m_blend_RGB1 = 1.0
◆ m_blend_RGB2
 double ON_Texture::m_blend_RGB2 = 0.0
◆ m_blend_RGB3
 double ON_Texture::m_blend_RGB3 = 0.0
◆ m_bOn
 bool ON_Texture::m_bOn = true
◆ m_border_color
 ON_Color ON_Texture::m_border_color = ON_UNSET_COLOR
◆ m_bump_scale
 ON_Interval ON_Texture::m_bump_scale = ON_Interval::ZeroToOne
◆ m_image_file_reference
 ON_FileReference ON_Texture::m_image_file_reference = ON_FileReference::Unset
◆ m_magfilter
 ON_Texture::FILTER ON_Texture::m_magfilter = ON_Texture::FILTER::linear_filter
◆ m_mapping_channel_id
 unsigned int ON_Texture::m_mapping_channel_id = 0
◆ m_minfilter
 ON_Texture::FILTER ON_Texture::m_minfilter = ON_Texture::FILTER::linear_filter
◆ m_mode
 ON_Texture::MODE ON_Texture::m_mode = ON_Texture::MODE::modulate_texture
◆ m_texture_id
 ON_UUID ON_Texture::m_texture_id = ON_nil_uuid
◆ m_transparency_texture_id
 ON_UUID ON_Texture::m_transparency_texture_id = ON_nil_uuid
◆ m_transparent_color
 ON_Color ON_Texture::m_transparent_color = ON_UNSET_COLOR
◆ m_type
 ON_Texture::TYPE ON_Texture::m_type = ON_Texture::TYPE::bitmap_texture
◆ m_uvw
 ON_Xform ON_Texture::m_uvw = ON_Xform::IdentityTransformation
Texture coordinate transformation.
◆ m_wrapu
 WRAP ON_Texture::m_wrapu = ON_Texture::WRAP::repeat_wrap
◆ m_wrapv
 WRAP ON_Texture::m_wrapv = ON_Texture::WRAP::repeat_wrap
◆ m_wrapw
 WRAP ON_Texture::m_wrapw = ON_Texture::WRAP::repeat_wrap